{
    "2M-UBKKG7DyAXcvGLwNH2w": {
        "keywords": {
            "bigrams": [
                "part_meal",
                "three_bean",
                "diced_tomatoes",
                "good_place",
                "bean_salad",
                "make_sure",
                "baked_goods",
                "best_part",
                "iced_tea",
                "grilled_cheese"
            ],
            "unigrams": [
                "good",
                "place",
                "food",
                "lunch",
                "sandwich",
                "nachos",
                "cheese",
                "time",
                "soup",
                "don"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Good For Groups": true,
                "Good for Kids": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Wheelchair Accessible": true
            },
            "business_id": "2M-UBKKG7DyAXcvGLwNH2w",
            "categories": [
                "Bakeries",
                "Food",
                "American (Traditional)",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "Krannert Center\n500 S Goodwin Ave\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "15:30",
                    "open": "07:30"
                },
                "Monday": {
                    "close": "15:30",
                    "open": "07:30"
                },
                "Thursday": {
                    "close": "15:30",
                    "open": "07:30"
                },
                "Tuesday": {
                    "close": "15:30",
                    "open": "07:30"
                },
                "Wednesday": {
                    "close": "15:30",
                    "open": "07:30"
                }
            },
            "latitude": 40.108,
            "longitude": -88.222501,
            "name": "Intermezzo Café",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/Oci5jby6gql7xNxWQybHBA/ms.jpg",
            "review_count": 9,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Some meals are good, but others.. For sides: the low-fat cottage cheese just tasted off. Check your order if you get it to go (this is good for any place you go but especially here). ",
        "reviews": [
            {
                "review": "if you're near goodwin, need to refuel, don't feel like messing with green street, etc, then this is a good bet for lunch.  i usually get the tuna salad sandwich.  i give that 3 stars.  but what should probably be noted is the 5 star rating on the carnegie cheesecake.  the crust is really more of a sable cookie and the creaminess of the cake is unparalleled.  it's total museum food with a nice vibe from the crowd.  if you sit along the north bank of windows which appear to be 50 feet high, you can almost forget you are surrounded by cornfields.  good place for meetings too cuz there are tons of tables.  dinner before a performance is plausible as well if you are under time constraints.",
                "reviewer_id": "6pC5j-hfP4xLZB2W0Wi1vg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.003504392823918678,
                    "positive_probability": 0.9964956071760798
                },
                "stars": 3
            },
            {
                "review": "This place is pretty inconsistent.  Some meals are good, but others.. I'll get to that.  In general, most of the more complicated items on the menu are frozen and microwaved when you order.Their breakfast offerings are not bad.  The breakfast burrito and breakfast pizza are both pretty cheap and reasonably filling.  In fairness, I have heard their grilled cheese and soup on Thursdays is good.  (I haven't had it myself.)The lunch dishes are not as good; the options change each day.  The ones that are good are .. okay, and not that pricey for near campus.  The ones that are bad are pretty bad.The nachos are alright - canned pickled jalepenos, diced up tomatoes, olives, thick tortilla chips, gloppy cheese.  There is a lot of it.  Not bad if you have a craving, but there are better options elsewhere.The salsa and hummus plate's not bad for a snack.  Of what I have had here, I would recommend it most.The hamburgers are gross.  They taste like school cafeteria low-grade meat and have the texture of frozen sausage patties.  My girlfriend's cheeseburger had a big piece of scorched .. something on top of the cheese.  Mmm.  The \"albacore tuna with mango\" sandwich is alright, but the mango is mixed in with the canned tuna, along with a lot of mayonnaise and relish.  There is not much mango to be found either.  (I've noticed charred bits on the breakfast sandwiches too, which is baffling considering I think they are just microwaved.)For sides: the low-fat cottage cheese just tasted off.  I have eaten a lot of cottage cheese and never had it taste like that - kinda chalky, kinda sour.  My girlfriend got the pasta salad, which was a little better, but swimming in vinegar with some pepperoni plopped down into it.  Our iced tea was very opaque and did not taste very fresh.  They charge for refills on soft drinks, too.Service was alright, the kitchen guy is cheerful, but the food was unpleasant enough at my last lunch that I'm not going back.  Within the same walking distance I can get to Derald's lunch truck and Espresso Royale - and I've been much happier with the food at both.  Or Red Herring, or Bevier.It is worth noting that I paid with gift certificates - none of my own money - and still felt disappointed at the cost of free.Can't comment on the baked goods, haven't had them.  What I hear is that the stuff made in house isn't great, but they get the cookies from elsewhere and they're okay.Also, after hearing - from one of the staff - that they don't change out the coffee every day in the pots, I am knocking it down to one star.  Just, don't go here except maybe for the nachos.",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9913991243692596,
                    "positive_probability": 0.00860087563076197
                },
                "stars": 1
            },
            {
                "review": "I've been here twice now, both times on Wednesdays for lunch.The first time I went, I got the beef nachos. Yes. Yes. Yes. For six bucks, you get a mountain of nachos. If you're trying to really fill up, this is a place to get \"the bang for your buck.\" In addition, the nachos were tasty. While they weren't the greatest nachos I've ever had, I'd certainly put them above mediocre.Yesterday, I did half a sandwich and a soup. I chose turkey and swiss on challah and red pepper & gouda soup. The sandwich wasn't that much to write home about (though I was happy to see challah, even if the student working behind the counter didn't know how to pronounce it...) but that soup was fantastic. Seriously, I would eat that stuff by the gallon - so savory and creamy with little cheese chunks hanging out in there. OH MY GOD YES.In short, I'll probably be back. It's kind of a wheelhouse restaurant but I think they do a good job at it.",
                "reviewer_id": "_9uvL80xzBxDjWzFM7Da5g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9996722847563503,
                    "positive_probability": 0.0003277152436511868
                },
                "stars": 5
            },
            {
                "review": "I used to work here in college (along with the Interlude bar and Catering dept).  Good times were had here behind the register :)  We always made coffee fresh each shift.  Coffee and soda are cheap.  Best bet for a good meal is to get a sandwich, we made those fresh to order (dinners are just microwaved).  In the daytime there's an assortment of baked goods, at night it's just cakes & pies.  If it's going to be a busy night and you want food, make sure to go early to get a table and get your food in time, as there will be a long line.Tip - if you want something to eat during intermission, place your orders ahead of time, and it will be waiting for you at a reserved table when you get out.  Only desserts and drinks are available after the show ends.There's a parking lot underneath that used to be free, and street parking in the neighborhood is usually easy.",
                "reviewer_id": "BcNdlyXsmyYYBMfHq6UFpQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5216180359538882,
                    "positive_probability": 0.4783819640461129
                },
                "stars": 4
            },
            {
                "review": "Some of the employees (main chef and some of the order takers) are rude.  Forget about substitutions if you have allergies.  The chef does not care. Definitely not the place for people with ANY food considerations.  Their emails say \"Intermezzo is open all year long\" but note that they are sometimes closed without warning.  Make sure you get their emails and only go on days you get the email or call there first.  Walking all the way there and finding them closed is annoying, especially on short lunch days. Check your order if you get it to go (this is good for any place you go but especially here).  Mistakes happen often. Their tomato soup is like tasteless tomato water (the grilled cheese that goes with it is almost equally tasteless).",
                "reviewer_id": "E3EFB-ZH9Cr_MZ8ovYhUQg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018516802670576562,
                    "positive_probability": 0.9814831973294266
                },
                "stars": 2
            },
            {
                "review": "This place is the dietary downfall of many students and Champaign-Urbana residents.  I never had enough time during intermissions to properly savor the cakes, eclairs, pies and coffees, so we would sometimes go even if we weren't attending a performance.  I don't think it's even freshly made, but the endless dessert possibilities will impress.",
                "reviewer_id": "HANb8-8InWnju-XzBQQSBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013058874830630113,
                    "positive_probability": 0.9869411251693694
                },
                "stars": 4
            },
            {
                "review": "The food here is only okay, but there is something utterly perfect about a campus lunchtime meal at the Intermezzo. If you're a veggie, go for the nachos and/or veggie burger. I also recommend you appreciate along with me the gruff style of the cashier. Untouchable.",
                "reviewer_id": "K9uvy5T1ElR96Hcwz5Yy8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13533290413479632,
                    "positive_probability": 0.8646670958651996
                },
                "stars": 4
            },
            {
                "review": "This is my new favorite place for lunch in C-U. Good selection of sandwiches/salads/soups, reasonable prices, plenty of tables, and a nice atmosphere. It feels more grown up than most of your other lunch options, but the food is ready super fast. A number of veggie selections, and the desserts look amazing.",
                "reviewer_id": "kw3gw2eoJdgOuuvKpatayA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.129192032399446,
                    "positive_probability": 0.8708079676005528
                },
                "stars": 4
            },
            {
                "review": "I've read the other reviews for this place, but cannot imagine why our experience was so different from what others have described. I think I'd rather eat junk from a vending machine next time.We had a BLT. I've never before had a BLT that used diced tomatoes and shredded lettuce. At least nothing about the sandwich was actually horrible, but when talking about a sandwich that should be as simple to do well as a BLT being mediocre and the best part of a meal....We also had the Chili, served in a bread bowl. It was thick and gummy, reminding me of Hormel's canned product. blech.For sides, we had the \"Three Bean Salad\". I don't think I've ever had a  three bean salad that featured bits of broccoli or some kind of mysterious yellow disk vegetable. Other than mysterious extra ingredients, I do not recall it being particularly horrid, but it certainly was not something I'd order again. We also had the Potato Salad,  which was decent but kinda sweet.The Iced Tea a fright, with a very industrial taste.Vying for best part of the meal with the mediocre BLT were the Oyster Crackers that came with the Chili. They were made by Nabisco, not my favorite brand, but they were fresh.",
                "reviewer_id": "oH_EeAPfH3QJzR9xNWmuvg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9659235995170059,
                    "positive_probability": 0.03407640048301236
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "g5I1qNIGWTU3lizsneXQiw",
            "bkbOmsZ9cOggOnpKsxOyiQ",
            "O_HxmcRtxdJluerS2RYqtA",
            "SeQv-RJ2rS070NvSRh_siQ",
            "UV04TEpMGWoQs36FkBwOgQ",
            "Z8EGaOokvK2hoD6tGup0MA",
            "Gf9HbiraKNZpxbxwScHBVw",
            "KUpdnQi16DGP54FlDWOJ6g",
            "rm2OnyNDnlWkSNUSxETsGg",
            "kQIa72d-V_MuklkrDig3Mg"
        ]
    },
    "SeQv-RJ2rS070NvSRh_siQ": {
        "keywords": {
            "bigrams": [
                "sunday_brunch",
                "prime_rib",
                "chocolate_cake",
                "food_service",
                "food_good",
                "pretty_good",
                "lunch_dinner",
                "quality_food",
                "definitely_back",
                "courier_cafe"
            ],
            "unigrams": [
                "food",
                "good",
                "brunch",
                "place",
                "silvercreek",
                "service",
                "great",
                "time",
                "lunch",
                "nice"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "full_bar",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": false,
                "Dogs Allowed": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": true,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "average",
                "Order at Counter": false,
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "free"
            },
            "business_id": "SeQv-RJ2rS070NvSRh_siQ",
            "categories": [
                "Bakeries",
                "Food",
                "Breakfast & Brunch",
                "American (New)",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "402 N Race St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "23:00",
                    "open": "17:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Saturday": {
                    "close": "23:00",
                    "open": "17:00"
                },
                "Sunday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "17:00"
                }
            },
            "latitude": 40.115461,
            "longitude": -88.2086039,
            "name": "Silvercreek",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/gjB7V-SylGPz0mcRQsE6ag/ms.jpg",
            "review_count": 98,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Service was great, the restaurant was not too busy, would definitely go back again for lunch. Not too much, not too little food, but what was there was great. This was my 5th time to Silvercreek for brunch. ",
        "reviews": [
            {
                "review": "You could do better a chain restaurant. Food and service are below average and they are not even that busy. Man where is an Outback restaurant in Urbana? I guess it's been here long enough so people send us strangers and visitors here but find somewhere else and do better than here. My second time and won't need to try again.",
                "reviewer_id": "-2RVxn8RRN3j9bOiqGkjug",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6445705470938671,
                    "positive_probability": 0.3554294529061304
                },
                "stars": 2
            },
            {
                "review": "Bad service, overpriced food, food is WAY overrated",
                "reviewer_id": "0bR3IX3OtEo4_uZCrSYZGw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8089865969579512,
                    "positive_probability": 0.19101340304204978
                },
                "stars": 1
            },
            {
                "review": "I was extremely disappointed with Sunday brunch today.  (Oh and by the way, today was Easter for Orthodox people, so I was hoping for this to be a special occasion.)  While I don't think that $18 a person is too much for a nice brunch every once in awhile, i do expect to get what I pay for.I don't want to be ignored by the hostess, then treated rudely by both her and the waitress.  Additionally, I expect the food to be restocked.  If you own a restaurant and advertise that brunch is offered until 2:30, the brunch should be stocked until that time.  If you want to stop stocking the brunch at 1:00, the advertise that the brunch ends at 1:00.  The good foods were omelets and waffles, smoked salmon and shrimp; the two things I could get cooked fresh, and the two things that are served best cold.  Everything else was cold, crusty crap.We were rushed by the waitress who couldn't be bothered to refill our drinks.  Busboys were texting, no one would check us out when it was time to pay.  In fact, the only nice people there were the bartender and the omelet chef.  I liked this place in the past, and if I have another chance to come back, I will...so I guess the have a chance to gain some stars.",
                "reviewer_id": "1Q8Hdkd-3pJ7zJe798MhOg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03692404973292384,
                    "positive_probability": 0.9630759502670667
                },
                "stars": 2
            },
            {
                "review": "I went there with my family, the food was very good but not quite outstanding.  The service was good The price were fair as well.  We sat in the glass conservatory in the back and it was comfortable in even on a cold night.  This place is worth a visit.",
                "reviewer_id": "1rFh71D2uCj3nvZnax0jew",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7338887024054541,
                    "positive_probability": 0.26611129759454694
                },
                "stars": 4
            },
            {
                "review": "Here Price = Quality. Brunch on Sunday is the best I've been to in the longest. Only upset feeling from trying their desserts is for the people who DIDN'T try the desserts.",
                "reviewer_id": "1UtoLbW5RjZobzwW6uuQeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15630235981956622,
                    "positive_probability": 0.8436976401804342
                },
                "stars": 4
            },
            {
                "review": "Went here for lunch. Not many young people were eating here but the atmosphere was great. I had the trainwreck sandwich. It was loaded with meat and the bread was freshly made. Everyone else in my party had a gourmet burger and everything was devoured. My husband said when his family comes to visit he will be taking them here.",
                "reviewer_id": "3qFI4GeLEDUtWNRpLBY68Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.022924671219605484,
                    "positive_probability": 0.9770753287803983
                },
                "stars": 5
            },
            {
                "review": "I don't hand out a lot of five-star reviews but this place definitely deserves one. From the food to the ambience to the helpful and wonderful staff this place has it all. You will definitely not be disappointed here.",
                "reviewer_id": "5RrSV_EVvG57M-5kKax93Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10445265621538194,
                    "positive_probability": 0.8955473437846191
                },
                "stars": 5
            },
            {
                "review": "Sunday brunch is yum ! Tons of good food. Mimosa and bloody' are included. Make sure to arrive early if you don't want to wait",
                "reviewer_id": "69hQExBnDcV3Q2rxCsOGMA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8968274543638703,
                    "positive_probability": 0.10317254563612926
                },
                "stars": 4
            },
            {
                "review": "Fourth time there, first time for Sunday brunch.  Not too much, not too little food, but what was there was great.  Really dug the peppered fried chicken.  Desert selection was wide and I became a fan of the Bailey's Chocolate Cake.  Was seated in the converted greenhouse which added (positively) to the experience.  Look forward to trying the brunch again.  Only negative (also positive) was the huge crowd.",
                "reviewer_id": "6lLTQ5Vl5983Di-8sa-IsA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2825635586686921,
                    "positive_probability": 0.7174364413313058
                },
                "stars": 4
            },
            {
                "review": "Great service and an amazing filet. Will definitely go back!",
                "reviewer_id": "6o2wTgPJRnyZYet8J3hwUg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21957302974897608,
                    "positive_probability": 0.7804269702510241
                },
                "stars": 5
            },
            {
                "review": "Checked out Silvercreek for lunch, it was very tasty.  My boyfriend and I tried a couple sandwiches, the BLT (topped with goat cheese and guac) and the cuban.  Both were delicious and moderately priced; only about $7-7.50 each (cheaper than some of the other cafes in downtown urbana or champaign).  Service was great, the restaurant was not too busy, would definitely go back again for lunch.",
                "reviewer_id": "9epEUZ6VFX800EwrbXhdQQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6924287822970702,
                    "positive_probability": 0.3075712177029315
                },
                "stars": 5
            },
            {
                "review": "We had a great family dining experience here earlier this week - I really love the rennovated old building feel, and the way they weave history into the ambience but still manage to be modern. It's the kind of place that could be romantic enough for a date but casual enough to bring the whole extended family. The food is pub-fare but with some good twists (lobster mac and cheese!). I had the BLT (with avocado and goat cheese). Very delicious. There were also veggie burger options that looked good. Wait staff was friendly and accomodating. Definitely recommend this place!",
                "reviewer_id": "9rIp4qjZ8DJFfUQ5X9v-ug",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08942895758180701,
                    "positive_probability": 0.9105710424181878
                },
                "stars": 5
            },
            {
                "review": "I had the lobster mac n cheese.  The dish was advertised with shallots, but came with green onion. The lobster was extremely overcooked, like chewing on tire. Also went overboard with cheese,  left the dish swimming in liquid. Service was great,  but there was not a host upon arriving which left me wandering around looking for my table.  Overall just average, but advertised as fine dining. I would like to go back to try something else.",
                "reviewer_id": "_EB2O2GjkTkUdGLi01O5hw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40136166601480755,
                    "positive_probability": 0.5986383339851891
                },
                "stars": 2
            },
            {
                "review": "Sorry Silvercreek, but I just can't with you. I've been here probably 20 times over the course of many years. It's never my choice-- Champaign has a handful of restaurants where everyone goes when they're looking for a somewhat upscale experience and Silvercreek falls into this category. And so I find myself here for graduation celebrations, birthdays, meals for when relatives are visiting, and so on. Most of my experiences here have been for their Sunday buffet brunch. They offer your standard biscuits, gravy, bacon, potatoes, as well as some lunch-ier fare like pasta and prime rib. It is all less than mediocre. Last time I was there for brunch, my dad said, \"We should have gone to Ryan's.\" Ouch. They have a pretty big selection of desserts. It really grinds my gears that even though they have an omelet and waffle station, they can't make eggs to order because they only have a big bowl of premade egg mix on hand. So yeah, no fresh eggs on hand. They have scrambled eggs in the buffet line but... gross. Side note, try not to get seated by the omelet station. It gets boiling hot. Last time I was here, I actually dunked my cloth napkin in my water and dabbed my face and neck with it. I mentioned the heat to the hostess on the way out-- she asked how the meal was-- and her response was \"Oh, in the greenhouse? Yeah, hot day.\" No, not in the greenhouse. But that reminds me...My best friend had her bridal shower at Silvercreek about a year ago, in the greenhouse. In the middle of the meal, one of the chandeliers DROPPED FROM THE CEILING and shattered on the middle of a table. Unreal. The staff did not know how to handle the situation and the only compensation was free dessert. This place is such a mess.",
                "reviewer_id": "_t3rDMTYvvi5mSlRosSYGA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00018266876420404394,
                    "positive_probability": 0.9998173312357794
                },
                "stars": 1
            },
            {
                "review": "Generally speaking, the service is good -- I've had some bad ones.  The food is pretty good, but the reason to go is for the brunch.  It can get crowded, but worth the wait.  They make their desserts on site, and make omlettes and waffles while you wait.  The meats can be overcooked, but it's still all quite tasty.",
                "reviewer_id": "AFK20uwV5Kr-f8at2_BV8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40600890644778004,
                    "positive_probability": 0.5939910935522208
                },
                "stars": 4
            },
            {
                "review": "We came here for lunch and had a good experience. The landscaping and the atmosphere are great. Very friendly service. I enjoyed my Italian turkey club, which came with good sweet potato fries. Would return if in the area again.",
                "reviewer_id": "Au8zxtMKpouKEfG0GnXo-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29494063492074174,
                    "positive_probability": 0.7050593650792598
                },
                "stars": 3
            },
            {
                "review": "Have come here several times for lunch as I work close by at Carle.I'm very impressed with Silvercreek.Food is consistently excellent. Have sampled many things and it's all very tasty.Also service is super quick. We are in and out in enough time to get back to work.Also nice ambiance. No brainer  A+",
                "reviewer_id": "AXRgek05lwZcUt5IIRPnBQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4225989536102581,
                    "positive_probability": 0.5774010463897373
                },
                "stars": 5
            },
            {
                "review": "Went here for an anniversary a while back with the idea that it was one of the nicer places in town. I did have high expectations and was a bit disappointed. I do like the rustic ambiance, but the menu has little to no imagination and the wine list is quite small. I would suggest the lobster Mac-n-cheese though.",
                "reviewer_id": "Ba9fIJAmGNjFXU2Oc0fyxQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9228578468897245,
                    "positive_probability": 0.07714215311027996
                },
                "stars": 3
            },
            {
                "review": "The best food I've had in ages!  Ambiance is unique: relaxed but casual sheik. Bekka Is an amazing waitress.  I ordered the 6oz fillet, mashed potatoes, Spinach salad. So good.  You won't be sorry visiting Silvercreek.",
                "reviewer_id": "bGW2QMvpb6KZ9CDmwlKP1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1784479204940792,
                    "positive_probability": 0.8215520795059225
                },
                "stars": 5
            },
            {
                "review": "We recently had my daughter's bridal shower in the greenhouse, and guests were delighted with the fare, especially the grilled chicken alfredo and sweet potato fries. Lunch was rounded out with a delicious field greens salad, quesadillas, and a fresh fruit salad. The buffet style option fit our needs, and it was a most pleasant and memorable occasion in a lovely setting!",
                "reviewer_id": "bMWkEdtfpXyBqM8ZXVODFQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.964946808736027e-06,
                    "positive_probability": 0.9999940350531843
                },
                "stars": 4
            },
            {
                "review": "I was very impressed with the quality of service and the food at Silvercreek!  Headed there for the first time for a friend's birthday with a large group of people.  Since I try to eat vegan and I know it can be a pain to sort that out in a large party, I called ahead to ask if there were any vegan items on the menu.  The hostess was incredibly helpful, pointing me toward a couple of salads and a vegetarian entree that could easily be made vegan, and reassuring me that if nothing on the menu caught my eye, the chef would be more than happy to create something for me with the veggies and pasta they have available.Service at the restaurant was equally good.  I went with the autumn salad (Garden greens, apricots, pears, grapes, pecans, hazelnut vinaigrette) which was refreshing and delicious, and the stuffed poblano peppers (Black bean, corn & rice stuffing, red onion, cilantro, chihuahua cheese, paquillo pepper sauce) without the cheese.  The peppers were TO DIE for.  The pepper sauce was insane, creamy and delicious, yet somehow dairy free.  I still wish I had gotten that recipe!I'd definitely recommend Silvercreek for any vegans or non-vegans looking to get a high-quality meal!",
                "reviewer_id": "bPzcpkhSeQDu6WQTUh08yw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00030472362287709524,
                    "positive_probability": 0.9996952763771387
                },
                "stars": 5
            },
            {
                "review": "Traditional American food: burgers, sandwiches... pretty much the same as they are at Courier Cafe, its sister restaurant nearby. Had lunch there, not much choices. Foods were just so-so.Environment was very good! This was a large place with back yard. The decoration was classic. A good place for family gathering!",
                "reviewer_id": "C74BJGf0RuKdYKxjm7SDuQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.41910471690301515,
                    "positive_probability": 0.5808952830969851
                },
                "stars": 3
            },
            {
                "review": "This was an unexpected fuel stop for a small group of us last weekend after discovering the long wait at the Courier Cafe just up the street.  The restaurant has a warm & cozy feel to it - equipped with a full fireplace and lodge-esque interior.  The bread variety was quite delicious - esp. the olive and rye breads.  I ordered the jumbo shrimp appetizer (the name escapes me), which was incredibly spicy.  It was ok.  I also ordered the spinach salad, which was quite good.  My fiancee ordered the pot roast entree, which I sampled, and it was actually very good.  My friend ordered the brie appetizer, which was also quite tasty.  The only downside was the service, which was slightly lacking.  The price is moderate but nothing completely unreasonable.  They also have a nice selection of domestic and import beverages, which always makes me warm and fuzzy inside.",
                "reviewer_id": "C_FKTAsnaGDF_CyyDIe_Rw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009393247178427044,
                    "positive_probability": 0.990606752821554
                },
                "stars": 3
            },
            {
                "review": "Just hosted my daughters bridal shower at Silvercreek. I would highly recommend it. Most of the planning was done via telephone as I'm from out of town but I couldn't be happier with the end result! The food  and desserts were everything I expected and more! The waitstaff was super helpful and courteous...they were wonderful! Thanks Silvercreek for a wonderful bridal shower! I definitely recommend!",
                "reviewer_id": "CSz5FyQxrfY-KfiX2VSa4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03962100208513395,
                    "positive_probability": 0.9603789979148619
                },
                "stars": 5
            },
            {
                "review": "When I was about to leave Champaign for Chicago, my boss and I went on a culinary tour around Chambana and Silvercreek was on the top of our list. She was raving about the Sunday brunch and they were right, it was so so good. There's an egg station if you want your eggs custom made. Then there's other fancy meats, fish like whole smoked salmon, pastries, and of course, desserts.  The price tag is expensive for the Chambana area but the food selection will all be worth it. This is a must do for anyone in town.",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09376121507161275,
                    "positive_probability": 0.9062387849283909
                },
                "stars": 4
            },
            {
                "review": "Had dinner with my boyfriend here recently and their new menu options look delicious! We are, however, only able to eat so much food so I'll review the dishes we did eat. We started with the heirloom tomato salad and it was delicious! The dressing goes so well with the delicious cornbread, arugula and tomatoes all together. I got the Scottish salmon and it was very good with a nice olive tapenade. My boyfriend got the filet and he definitely seemed to enjoy it. We finished the meal with the amazingly delicious butterscotch budino which is like fancy pudding, yum! They also seem to have a very extensive mixed drink and wine menu which we didn't have any of but it looks impressive. We will definitely go back!",
                "reviewer_id": "d4M64Nc3BBF-167s19zPgA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16598967331690284,
                    "positive_probability": 0.8340103266831059
                },
                "stars": 5
            },
            {
                "review": "I came here for lunch with some co-workers for lunch and I was pleasantly surprised!  This place has a reputation for being overpriced however,  I didn't see anything on the lunch menu over $15. I won't say it's world class food or anything (only slightly better than Courier Cafe) but very well prepared and is good for people looking for classic American dishes - no weird exotic ingredients here!3/4/15 UPDATECame in with some co-workers during Urbana Restaurant Week for my birthday. What a great deal! $10 per person and I left absolutely stuffed. While the service was a bit slow, it was really good. They even brought out dessert for the table for my birthday and accommodated the gluten free eaters as well!",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09159520176596005,
                    "positive_probability": 0.9084047982340475
                },
                "stars": 4
            },
            {
                "review": "Yelp steered us here for brunch, but your only option is a buffet.  And it's not good.My waffle was okay, but the syrup dish had a lot of \"skin\" that had developed in the tray.  Kinda chunky when pouring it out.The bacon and sausage weren't particularly flavorful.  The \"homemade\" biscuits were hard.Of all the places we ate in Champaign, this was the worst.  Definitely not worth $20+ for the same kind of Sterno-warmed slop you'd find at Old Country Buffet.Go get a cup of Jarling's Custard and make that your brunch.",
                "reviewer_id": "dxl9ZmoFYymlf6q3pQqXww",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6935754782147481,
                    "positive_probability": 0.30642452178525603
                },
                "stars": 2
            },
            {
                "review": "I have gone to Silvercreek several times -  for Brunch, Lunch, and Dinner and also been to many upscale dining establishments.   The food is amazing.  I have never been disappointed.  Recently, I went to dinner there during Grad week.  It was very busy (as to be expected) and I had a large party of 9 people, we had a reservation but still had  to wait for our table, during our wait a girl came around with a cookie basket and the manager made several stops to ask us if we needed anything.  Once we got seated, our waitress, \"Diana\" (?) greeted us immediately and was very knowledgeable about the menu, she was very nice and personable.  A few of us sampled the specialty drinks on the menu which were delicious.  I had the Lobster Bisque soup - holy crap, unbelievable!  I mean, I could have licked the bowl.  Another gentleman in my party pretty much did!  For my entree I had the filet, the quality of meat and preparation was so nice.  The way the Chef placed the meat on top of the potatoes and asparagus was very upscale, not to mention easily the best steak I have ever had.  The potatoes & asparagus perfectly complimented the flavor of the filet.  For dessert I had the flour-less chocolate cake.  No cake should ever have flour, as this was the best dessert I have ever had...  In my life.  I would HIGHLY recommend this restaurant, the price is reasonable and for a casual upscale dining you can't get any better!  Go there now!",
                "reviewer_id": "E3ya_FU99KDwxIVXvm71zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009143578282710596,
                    "positive_probability": 0.99085642171729
                },
                "stars": 5
            },
            {
                "review": "One of my favourite restaurants in the area. the $20 Sunday Brunch Buffet are totally worth it - and do try the desserts! The dinner is delicious as well. Usually, I don't rave about soups but their tomato basil soup was the best I've ever had! My husband who also doesn't necessarily like soups though it was delicious as well. Silvercreek is worth the price and it is a good idea to make reservatiosn.",
                "reviewer_id": "eEGQLXY9R96GguW6lGrG-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06230674703428623,
                    "positive_probability": 0.9376932529657163
                },
                "stars": 5
            },
            {
                "review": "So this is a fancy establishment that exudes an aura of fine dining. It almost feels as if there should be a business casual dress code. Almost. I ordered the most basic macaroni dish. I wish the menu listed all the items that come with these dishes since I don't enjoy onions (it comes with green onions). The dish definitely was a bit better than your standard macaroni fare, but I don't think it's good enough to warrant an $18 price tag. The Sunday buffet is similar. It costs $20 and the food is a bit better than your standard buffet food, but not enough to warrant the much higher price.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04315276939941437,
                    "positive_probability": 0.9568472306005761
                },
                "stars": 3
            },
            {
                "review": "I have had a couple so-so experiences here, one bad experience, and one horrible experience. After the last one I decided never to try again. Bad service, terrible (and expensive) food, awful ambiance. Last time the highlights featured an absent host so we stood around aimlessly waiting to be seated, even though it was basically empty. It was August and it felt like the A/C was broken in there, I had to use a menu as a fan. Service was slow and rude (we waited about 10 minutes just to get a beer menu, which we had to make a special request for). Music was terrible and so loud I couldn't tune it out (bad slow jams and classic 70s tunes). My so-called  \"Roasted red pepper risotto\" had not red pepper, but contained raw green pepper. And a fly died in my husband's beer. Yeah, like I said: Never again. There are much better places to eat within just a few blocks, for way cheaper.",
                "reviewer_id": "f_S4zZc7_azOf0MKEbcBFg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9966222326036273,
                    "positive_probability": 0.0033777673963660496
                },
                "stars": 1
            },
            {
                "review": "In a word, dissapointed. I thought it would be much better. The bread was boring, my 25.00 Filet had no flavor. My mashed potatos and zuchini were good. My server did not want to be there. There were flies and the grass outside needed mowing and the trash picked up. I had a view of Reds Muffler Shop.",
                "reviewer_id": "FFsuViuxEt6rvWPyTMo02Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6449509012515656,
                    "positive_probability": 0.35504909874843915
                },
                "stars": 2
            },
            {
                "review": "We haven't been to Silvercreek in years - we were disappointed with the food. Rumor spread that they got a new manager.  We decided to give them another try. The Chef's Line Burger is best burger in town - no exageration. Even my wife thinks so and she does not like to eat burgers. Tonight we enjoyed the appetizer buffet with oysters, chicken, shrimp, salads, artichoke dip, fresh fruit and chef cooked steak on the grill - delicious. You must try the Peach Kuchen to finish your meal. Silvercreek is now our local favorite. If you haven't been lately you must give them a try.",
                "reviewer_id": "fmWOwQcqkISbRnQkCHUEfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19690995265136066,
                    "positive_probability": 0.8030900473486422
                },
                "stars": 5
            },
            {
                "review": "Very good buffet on Sunday. Very fresh shrimps and fishes. The desserts are too sweet for me but I saw many other people queueing to grab those cakes. Beef is also great.",
                "reviewer_id": "GKci9s_NDb2rO6frxyjpBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0975358079637433,
                    "positive_probability": 0.9024641920362588
                },
                "stars": 5
            },
            {
                "review": "Amazing place for the sunday brunch. The waffles and maple syrup are amongst the best you will get in town! Don't miss out on the enticing array of deserts, it is easy to, since there is such a wide variety of food before it!",
                "reviewer_id": "h8ZdjqyHNRnlukDg-9OTww",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.921391544340278,
                    "positive_probability": 0.07860845565972033
                },
                "stars": 4
            },
            {
                "review": "This is one of the finer restaurants in Urbana, owned by the same people as at Courier Cafe, just up the road.  It loses a couple stars because it wants to be a fine dining establishment with an accompanying pricetag, but the servers are generally not as experienced as you'd like (although they are trying, so it's not right to totally pan them).  And the food quality and inventiveness leaves something to be desired.  They have a good location, dining rooms, including a nice garden room, and it's quite comfortable overall.  It just needs an infusion of talent.For brunch, four stars.",
                "reviewer_id": "HANb8-8InWnju-XzBQQSBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001207735958297098,
                    "positive_probability": 0.9998792264041736
                },
                "stars": 3
            },
            {
                "review": "Perhaps if I had eaten any food I could rate the food but this is a rating of service only. After a short wait to be seated I was given a table and a menu. When five minutes had passed and no one had come to the table not even to bring a water I was starting to wonder where a server was. After another five minutes had passed I was becoming rather annoyed. I decided to wait another two minutes for anyone to come to the table and when no one did I left.",
                "reviewer_id": "HFtXNbKRPoEiazH52QNLEg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9155883316836526,
                    "positive_probability": 0.084411668316344
                },
                "stars": 1
            },
            {
                "review": "We really wanted to like this place. I enjoy the farm-to-table, localvore style a lot. Our experience here was... less than optimal. I dined with my husband, and we had a late reservation. We had tickets to a performance at the Krannert, and wanted to eat dinner afterward. Silvercreek was one of the few places which had their kitchen open past 10, so we decided to check it out. We made a reservation, because we wanted them to know that we were coming. There were still two other tables dining when we got there, but that was it. I should have realized that something was wrong when I saw the totally empty parking lot at 10pm on a Saturday night.First problem: the place was really bright and the music was awful. Chain-restaurant bad 70s music and lighting. Not what I was expecting for the description of what they were going for or for their prices. Pros: the restored location is really charming, and with better lighting and a less cheap and intrusive soundtrack, the place could be beautiful.Second problem: the booth was dirty. The whole place was practically empty, they knew we were coming and they didn't bother to make sure that the table was clean?The menu is a nice one. We opted for the calamari to start, then my husband ordered the lamb and I ordered the duck. We like both medium rare, which is the standard way that both meats should be served.The food was just such a miss. The calamari was okay, and it would have been fine at Applebee's. For the price, a pile of frozen calamari rings (interspersed with pieces of fries and onion fritters - clean your fryer guys!) served with canned sauces is not the \"best of local, seasonal Illinois\". The entrees came out fast. I mean really fast. So fast that they were decidedly undercooked. I had already gotten a sense that even though the place was theoretically open for another hour, they were unhappy that we were there. Even though they knew we were coming. And they were open for another hour. Both the lamb and the duck were under rare. The cherry jam that was served accompanying my duck was refrigerator cold.We probably should have sent the food back, but it was obvious that the kitchen was hostile to the idea that people were bothering them an hour before they were even supposed to be closed, so I was somewhat afraid of what would happen if we did. Flat out: the kitchen shouldn't have sent out grossly undercooked food and the server shouldn't have brought the meat to our table that way. The message \"here's your food, eat and get the hell out so we can go home\" was not exactly subtle.The food would have been good if it had been cooked properly. The plate presentations were nice and the cherry jam was pretty good - nice warm spices and cherries cooked just soft enough. The jam would have been a great accompaniment to the duck, if it wasn't obviously straight out of the walk-in.It got worse, though. We had ordered a bottle of wine to share, and the entrees came out so fast that we were only half-way through. I'd noticed an \"artisinal cheese plate\" on the appetizer list. I figured that that would be something we could snack on while we finished our wine. Especially since the raw meat wasn't exactly a palatable meal. It also wasn't something that would take a whole lot of work from the kitchen, so I figured it would be safe. When she walked away from the table, the server yelled back to the kitchen \"Cheese plate coming\" Mel's diner-style. Seriously. The kitchen yelled something back to her about not knowing how to make one.The cheese plate was $19.00 for the large. What we got was a platter of cheese straight from the deli case at the local supermarket. Boursin, some sort of italian herb cheese, a really cheap Double Glouster, a brie and some bland white cheese. Not one of them were anything that would be close to artisan. Not one of them is \"the best of local, seasonal Illinois\". It was served with a handful of jarred black olives and a heaping scoop of the aforementioned ice-cold cherry jam. It wasn't an awful cheese plate, but it is not what it's advertised as, which is surprising since there are a fair number of artisan cheese producers in the area. For $19, I was expecting more than cold supermarket cheese.Soon after the cheese came the bill. No offer of desert, which is fine, since by that time we really wanted to get out of there and I could have stopped by the store on the way home and gotten some frozen pie if more stuff out of a box was where I wanted to go with the night.If you're looking for a nice meal, especially late, go elsewhere. The price they charge here does not match the atmosphere, service, quality or taste. It's more family dining, and it would have been great if the bill hadn't run to almost $200 (that's with wine, tax and tip). For slightly more money there are better places in town that don't make you feel like they hate you for coming in while they are open.",
                "reviewer_id": "hgullUyZOg1Ui35JAcnJYw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9999965888723387,
                    "positive_probability": 3.4111276763557008e-06
                },
                "stars": 1
            },
            {
                "review": "I think it's a pretty good brunch.  I would give it four stars if it wasn't as pricey.  $18 for a brunch buffet is pretty steep, especially since they don't continually serve food in fresh portions.  By the time we got there, the meats and pastas were on the dry side.  The desserts are yummy, omelet was very good, and the variety you can't beat.  I would go earlier and not as often.",
                "reviewer_id": "hMUQG4aiSqLIbYbJDb_dHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03336843491519674,
                    "positive_probability": 0.9666315650848064
                },
                "stars": 3
            },
            {
                "review": "I attended a wedding reception in the Silvercreek Greenhouse last weekend and it was exceptional. There were 70 guests in attendance. The atmosphere was beautiful and intimate and the space was used well to include the head table, guest tables, the DJ, a bar, food tables and a projector reflecting a lovely slide show of the couple. The food was honestly the best i've ever had at a wedding reception and there was more than enough even with the guests piling enough food on their plates for a small nation! After dinner, the staff inconspicuously removed two tables to create a dance floor that stayed full the rest of the evening. The couple had a very tight budget for their wedding so I suspect the cost of the reception was well below what one would expect. It was truly lovely.",
                "reviewer_id": "Hzun0IU2achZVfiyjAi7eA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.469622138152194,
                    "positive_probability": 0.5303778618478073
                },
                "stars": 5
            },
            {
                "review": "without a doubt absolutely the best most unique burger around.  I'm surprised more people do not know about it. When family visits from out of town they insist on me taking them here for the burgers. If you like burgers and live in or near this town and you haven't had the Silvercreek burger, I encourage you to check it out.  I'm talking freshly ground beef that is not flattened like a pancake,but delicately formed into an uber thick loosly molded mound of juicy beefy goodness, housemade bun similar to brioche, and if you like your burger cooked to a specific doneness, ie medium, Medium rare,etc.. it will actually arrive at the table the way you had requested it.",
                "reviewer_id": "IUX3WkuIh82xjl883kXcqg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7059875799428853,
                    "positive_probability": 0.2940124200571227
                },
                "stars": 5
            },
            {
                "review": "I went to Silvercreek for lunch today with my dad-- and I feel like it's undervalued for lunch!  I had pesto rock shrimp pasta ($8.25 and the most expensive lunch item,) and though I wish the menu had mentioned it was a light pesto cream sauce, it was delicious, and the garlic bread was awesome.  My dad had their burger of the day, and he loved it too.  Our waitress was a little spacey, but that'll happen.Our entire meal including drinks and tip was still under $25; you can get a bill higher than that for lunch at places  with far inferior quality of food.",
                "reviewer_id": "jFB4m2Na8fTIhc3TAYoeYw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.058013595504543075,
                    "positive_probability": 0.9419864044954535
                },
                "stars": 4
            },
            {
                "review": "I have to say, this has quickly become one of my favorite restaurants in Chambana.  I've only visited for lunch and although their dinner menu looks good, I haven't made a trip to try.  I have always had great service and the food has always been wonderful.  The only time I haven't been completely pleased was with the Farro salad which came with veggies, but there were only two quarter pieces of zucchini and two 1-inch slices of asparagus.  This place is now my go-to restaurant for lunch because of the extensive burger and sandwich menu.  They have great sides and the prices are great for the quality of food and creativity.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5091302786713651,
                    "positive_probability": 0.49086972132863227
                },
                "stars": 5
            },
            {
                "review": "Higher end restaurant. You should probably dress up. Pre-nights are held here.I'd only recommend going here only for happy hour appetizer specials and drinksOff-campus in Urbana.",
                "reviewer_id": "jvcqOUPPVBXErhjfdejPng (1)",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7139985429514614,
                    "positive_probability": 0.28600145704853674
                }
            },
            {
                "review": "Higher end restaurant. You should probably dress up. Pre-nights are held here.I'd only recommend going here only for happy hour appetizer specials and drinksOff-campus in Urbana.",
                "reviewer_id": "jvcqOUPPVBXErhjfdejPng",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7139985429514614,
                    "positive_probability": 0.28600145704853674
                },
                "stars": 3
            },
            {
                "review": "After seeing all the negative reviews I was a little hesitant to try this place. But this morning my boyfriend and I drove pass right when they opened their door and my boyfriend said that we should try this place out since other breakfast places were packed with homecoming weekend. I was surprised when I walked through the door, the decor were nice and the hostess was pleasant. Our waitress was nice, she kept our drinks full and came by often to check on us. The food was good, I really liked the prime rib and the mixed green salad was good as well. For those sweets lover, the cake area is the best. It's like being in dessert heaven! Overall, I really enjoy the service and the food. I would definitely recommend this to others.",
                "reviewer_id": "k2JaaZagPByLKHGT_RrNdA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02272914425140369,
                    "positive_probability": 0.9772708557485921
                },
                "stars": 4
            },
            {
                "review": "This is a review of the Sunday brunch which is AWWWWESOME! I usually try to get a group to go to brunch every couple of months and we always come here.  There is so much on the buffet ranging from a waffle station, omelette station, salads, veggies, pasta, salmon, shrimp, potatoes, a carving station, and an absolutely wonderful array of desserts to choose from!  I walk out of here feeling stuffed for days!  While the cost is not cheap- I think it's around $19 including a beverage, it is well, well worth it! I have tried the other top Sunday brunch place in Urbana, and Silvercreek blows them away!  :)",
                "reviewer_id": "k_cDemzIDkm44br8pCVQfw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19968512826921786,
                    "positive_probability": 0.8003148717307735
                },
                "stars": 4
            },
            {
                "review": "This was my 5th time to Silvercreek for brunch. I have yet to go any other time. Sunday afternoons are really fun here! Brunch... because mimosas. I mean really, do you need another reason. And they have them!!! This is a buffet style brunch and they keep it classy. Everything is good! The waffle bar is fun and full of amazing toppings. They have your normal breakfast food and they have a salad bar with smoked salmon and cream cheese. I love love love that they have turkey sausage links on the hot food bar. I don't eat pork, so this makes me very happy. There service is great too. We call ahead for seats and they are always happy to help. The manager came by our table and is always friendly. I love it here. We will be back of course! The 4 start is because they are a little pricey. It's $20.00 a person, with no drinks. Ouch. But in a way, they do give you a lot. Try to flourless chocolate cake. I promise you its amazing.",
                "reviewer_id": "kGVK_HmOjliHrKiPGiXmxQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21749858866955601,
                    "positive_probability": 0.7825014113304465
                },
                "stars": 4
            },
            {
                "review": "Silvercreek has been a great place to go to with my parents as a more upscale night out. That being said, I have had some hit or miss experiences with both the food and the service while I have been there. Most recently, I had dinner with my family there to celebrate my graduation for the University of Illinois. We had put in a reservation for our party well in advance and paid a substantial deposit. We showed up slightly early for the reservation and still had to wait almost an hour after the designated time. We were repeatedly told that it wouldn't be much longer, but by the time our party got to the table we were starving and pretty tired of being there. While I recognized that graduation is a very hectic time for people, I just did not understand what the point of making a reservation was when we had to wait as long as people who walked in the door. Once we were seated, the service was a little slow but was much more reasonable. Everyone enjoyed the food, which was flavorful and filling. Our favorite item was some sort of crab hushpuppies that were simply phenomenal. However, on other occasions, I have ordered fish dishes and found them to be somewhat bland. Overall, this place is a nice place to eat if you're looking for somewhere with a fancy vibe in Urbana. However, I would steer clear of it for important events (parents weekends, graduation, homecoming and other peak times) and check the menu before you go to ensure that the food suits your tastes.",
                "reviewer_id": "L22HGpj1zZUImYfxjae8PA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.4466398324762672e-05,
                    "positive_probability": 0.9999755336016721
                },
                "stars": 3
            },
            {
                "review": "Just had a pretty disappointing lunch experience here today. Courier Cafe had a 15 minute wait so we decided to hop over here. Not a very smart move. First, it took 5 minutes to be seated because no one was up at the front. Then we got a little sass from the server who sat us because I asked if we could go to a booth instead of the floater table she took us to. The worst part, though, was that it took about 10-15 minutes to order, and then about 20 minutes for our burgers to come. Another couple that had arrived 25 minutes after us got their burgers right after us, so it seemed to be an issue with just our order. Either way, the food wasn't anything spectacular in the end and this visit today left a bad impression on me :/",
                "reviewer_id": "leIgp16pp6_1feLNEtL_JA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9987904126178748,
                    "positive_probability": 0.0012095873821259913
                },
                "stars": 2
            },
            {
                "review": "I always like this place. I don't think I have ever had a bad meal here.",
                "reviewer_id": "ljKsIz9hTLsaFKQp6Ffd0Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7410062571403971,
                    "positive_probability": 0.2589937428596027
                },
                "stars": 4
            },
            {
                "review": "SilverCreek may have given me one of the better experiences of my food eating career. Here's the thing: I like a burger just as much as the next person. But the burger I had at this place was one of the most fancy-schmancy burgers ever served to me. But let's start with the service. Every time our waitress spoke, I couldn't help but wonder if she was frustrated from constipation. Her aggressive questioning made me feel uncomfortable, but at the same time she got the job done, so I'm not going to judge. Since we were in a hurry, we decided to skip the appetizers, but the the dinner was fantastic. The burger was cooked to order, and the fries were one of the tastiest things I have ever experienced, and I could easily eat them for the rest of my long life.",
                "reviewer_id": "ltZOHivDcQYf4xdxz3AErQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.42102623161195374,
                    "positive_probability": 0.57897376838805
                },
                "stars": 4
            },
            {
                "review": "Delicious!  I was in town to visit my brother and we went there for dinner.  !  They serve warm bread with the meal, which is always a good start.I had the filet and it was soo good, and we shared a couple desserts for dessert and I would recommend each on - creme brule, bread budding, and a torte.It was so good we went for their Sunday brunch.  It's $20.95 and worth every penny!  When can you get salmon, prime rib, fresh waffles, red velvet cake for $20!  It also comes with drinks included (I had juice and coffee).They also have an awesome beer and wine selection - much better than your typical restaurant.I would seriously recommend this place!",
                "reviewer_id": "m6bGEJVlq3VZHW3FPWx-lQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0635788536052702,
                    "positive_probability": 0.9364211463947385
                },
                "stars": 5
            },
            {
                "review": "The food was good, but it doesn't outweigh the management practices. The experience was bordering on a nightmare. Definitely a stressful and extremely unpleasant dream.Graduation day at U of I. Reservations were made far in advance. We had a 9pm reservation with a $50 required deposit. When we walked in a few minutes before 9, we found ourselves shoulder to shoulder with angry and annoyed patrons. We spoke to several people who had been waiting to be seated 1, 2, and even 2 and a half hours AFTER their reservation time. They know how to take a reservation, just not how to keep the reservation. And that's really the most important part of the reservation.So, due to the $50 required credit card deposit, all those people were stuck waiting and waiting and waiting. After waiting an hour, we asked what would happen if we left, and they said they would charge us $50. I'm pretty sure this wouldn't hold up in a court of law, but the small claims filing fee is more than $50 so they have people hooked. When we were finally seated an hour and a half after our \"reservation\" time, the 5 of us were squished into a small booth with a chair at the end. There was no space for that chair. It was very uncomfortable. Were our drinks comped? Were we offered anything for our long wait? No. The server was very nice, but we were starved and exhausted and really annoyed. The food was great, but way overpriced. I had \"little parcels\" pasta filled with cheese. Really great. The taste was worth 5 stars. I find management's policy on the U of I graduation date coupled with their failure to keep reservations absolutely unacceptable. It is completely unnecessary, their restaurant would be packed skipped reservations or not. The management decided to take this opportunity to swindle people.",
                "reviewer_id": "MiLWKMATtlx2qX7ZxKdjBQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007934203704012172,
                    "positive_probability": 0.9920657962959974
                },
                "stars": 1
            },
            {
                "review": "Not very professional. It wants to be fine dining but the staff lacks training an the menu options are less than impressive. When I walked in there was no one greeting so me and another group stood around for a while not knowing what to do. The host then showed up and after a time of her not knowing why she was at work and why I was there I literally had to say \"I'm here to eat food\" before she clued in to seat me. Nice building. As a business, needs improvement.",
                "reviewer_id": "MNVKFM4jP80wGAohHOPVPQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6120338616319809,
                    "positive_probability": 0.3879661383680215
                },
                "stars": 2
            },
            {
                "review": "Traveling through town and used Yelp to find a place to eat. Nearby first choice was too crowded, found this place around the corner. Beautiful interior, excellent service and delicious food. Stuffed mushrooms, chicken breast, both terrific. Hot bread slightly sweet with real butter couldn't have been better. Too full for dessert then but couldn't resist taking chocolate cake for later. Not disappointed. Not a cheap dinner but what a treat!",
                "reviewer_id": "n2WGQ8K7nmyhIVdIj2nBJA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011162390497648566,
                    "positive_probability": 0.9888376095023488
                },
                "stars": 5
            },
            {
                "review": "Incredible brunch service! My family booked three tables in the Greenhouse on a recent Sunday and we could not have been more pleased. The selection of breakfast/lunch foods was borderline overwhelming, but in a good way. Of course they have the classics - waffles, bacon, eggs, sausage - and then many more premium choices like prime rib, lox, and shrimp cocktail. There is also a fabulous dessert selection for those with more of a sweet tooth. The servers are quick to refill a drink or pick up an empty plate and were more than kind and tolerant of our group which was frequently moving around and staging photos in the middle of a booming time slot. I would absolutely come back!",
                "reviewer_id": "NNfFXwbcGjgPIy6h9Iwn8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.020558992515871996,
                    "positive_probability": 0.979441007484122
                },
                "stars": 5
            },
            {
                "review": "Silvercreek is one of my favorite places to go when I'm in the mood to be pampered with great service and excellent food.  The restaurant's ambience is just about perfect, with romantic lighting and a beautiful garden room that's just breathtaking (more on that in a minute).There are some complaints on here about the food, but I think it's delicious.  I haven't had anything here I didn't like.  One of my favorites is a salad, whose name escapes me at the moment, made with field greens, goat cheese, toasted walnuts, dried cherries, and a champagne vinaigrette dressing.  It's simply divine; I could be happy with just that.  However, it just keeps getting better.  I think the chefs are pretty creative, although the menu hasn't changed much in the three years I've lived here.  The desserts are excellent, as is the wine selection.I've heard that brunch is fabulous, but we've only been for lunch once and dinner a handful of times.  They put on quite a show for New Year's Eve, with a special menu and a generally festive atmosphere.  It was New Year's Eve 2004 that my sweetie and I were sitting in that gorgeous garden room, enjoying a night out on the town, when all of a sudden, a diamond ring was staring me in the face, and my sweetie was down on one knee asking me to marry him.  Now, Silvercreek isn't directly responsible for one of the happiest nights of my life, but they certainly helped make it as perfect as it was, and for that, I thank them.",
                "reviewer_id": "NtmiVAP4zoM8Kx8_8SNgMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002061267582566388,
                    "positive_probability": 0.997938732417423
                },
                "stars": 5
            },
            {
                "review": "i really wanted silvercreek to be better than it actually was, especially because it is one of the only fancy sit-down places walking distance from my apartment.  i went on a monday night, the week after valentines day.  my friend and i wanted to start with the mushroom puff pastry appetizer, but the valentines crowd had apparently wiped them out.  so we opted for the potato pancakes, which looked fantabulous...but one bite covered in white wine cream sauce had us puckering up so bad, the sauce was so sour that we could barely finish the first bite.  both of us ordered pasta dishes as our entrees, he the lasagna, i the gnocchi.  the lasagna was ok...really nothing special at all.  the gnocchi was in a subpar tomato sauce, and the gnocchi was overcooked to this dry, powdered mashed potatoes type consistency.  it couldn't choke more than a few dumplings down. the dessert, however was delicious. warm chocolate brioche bread pudding topped with vanilla ice cream? super-win!i will be back, if only because i have to check out this friday happy hour that is so well spoken of.  perhaps the steaks and chops, or the chicken and fish are a better choice? we shall see...",
                "reviewer_id": "OdL7XAqENNpR7A1Z5yMPpg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9707839967359161,
                    "positive_probability": 0.029216003264100676
                },
                "stars": 2
            },
            {
                "review": "Off the beaten path, cozy and quaint environment. Wait staff very pleasant and courteous. Prices reflect the food quality and service...",
                "reviewer_id": "ojI8x_6b2NH0Cetu6C9_bQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0331280434266807,
                    "positive_probability": 0.9668719565733178
                },
                "stars": 4
            },
            {
                "review": "Went for brunch here on a Sunday. The after church crowd really packed the place. The tables of food were scattered all around the place. Seemed to me with no organization at all. Worst of all the omelet station was put into as corner by the bar where two people at most could get to it And multiple tables around there as well so people were trying to get by and eventually giving up on waiting like I did because the two cooks were so unorganized and cooking on dorm room skillets. Definitely not worth $20. Pretty good food but not $20 a person food and experience overall.",
                "reviewer_id": "piZI7D8fa-iV68zj2ZzN4Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.54640191370204,
                    "positive_probability": 0.45359808629795456
                },
                "stars": 2
            },
            {
                "review": "Amazing lunch for a decent price! I don't know why everybody is bitching so hardcore about this place. I almost didn't try this place because of all the one star reviews but my grandma loves the creme brle here so we went.I had the lunch combo: half the gourmet grilled cheese (awesome), tomato basil soup (amazing), and sweet potato french fries (nothing to rave about but nothing bad with them).For dessert we had the vanilla creme brle topped with fresh blueberries and strawberries. AMAZING! We both had lunch, a dessert, and each an herbal tea (great selection of herbal teas!) and the total was only $34.50.They also have a nice outdoor area to sit.",
                "reviewer_id": "Pw-3gJ8XylIFgMtLVhM-Fg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07693404173400606,
                    "positive_probability": 0.9230659582659927
                },
                "stars": 5
            },
            {
                "review": "I've eaten at Silvercreek many many times over the years since they opened.  It used to be a reliably wonderful experience.  Unfortunately in the past 5-10 years the quality has just not been there.  The restored mill building is beautiful and if you've never been there it's worth a visit just for the architecture.  But I keep hoping for a better dining experience for the money and being disappointed.",
                "reviewer_id": "pYt8vLzszegpqyl0ufeQaw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0031192237084772174,
                    "positive_probability": 0.9968807762915252
                },
                "stars": 3
            },
            {
                "review": "Went there for NYE at the early set for Candy Foster.  He was the best part of the visit.  Ashley our server was good.  I ordered the scallops and could not eat them as they were raw and only barely grilled.  The sprouts had been warm at onetime but were also cold.  My friend ordered the duck and it was good.  It was a very expensive meal for something I could not eat.  Next time a salad for me.  I only went for the music and I guess that's what I got:(",
                "reviewer_id": "q0XqCjIefzm_dA5qmTcFzw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11311367556758037,
                    "positive_probability": 0.8868863244324189
                },
                "stars": 2
            },
            {
                "review": "Great food and service although a bit overpriced. I went for the Sunday brunch buffet which was $20 per person. The selection is smaller than what you would get at other buffets, but the quality of the food blows all the others away. I would say that it even rivals other non-buffet restaurants in terms of the quality of the food. I liked their prime ribs and croissants, they were very fresh, a new batch being brought out once every fifteen minutes. The ribs were flavorful and not under or overcooked in my opinion. Some people may find some of the slices of meat to be too undercooked, but there are plenty to choose from. One thing that was kind of disappointing is the selection of fruits. There was plenty of meats, vegetables, and baked goods to choose from, but I found the selection of fruits kind of lacking. Their website showed a whole platter of fruits with various melons berries, etc, but there was only a bucket of oranges and lemons (yes whole lemons) that you had to peel yourself. I would expect pictures to be slightly exaggerated, but this is a little too much. Even cheap buffets like Ichiban Chinese Buffet or Hometown will have slices of ready to eat fruit. Just that felt like a glaring hole, considering the price and the otherwise great food and service.The service is definitely above average and my water was refilled often, and the waiter was prompt at taking my used plates. I felt comfortable eating at Silvercreek, with the restaurant being clean and the friendly staff. Overall a really nice restaurant, but one star off for the lack of fruits and higher price.",
                "reviewer_id": "qZpkw9oFYughFfAFtTM8Ig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2604389082564991,
                    "positive_probability": 0.7395610917435161
                },
                "stars": 4
            },
            {
                "review": "When I come to UI in 1990 as an undergrad, other than the country clubs and Kennedy's/Rick's: An American Cafe and Timpone's, Silvercreek was really THE place to go.  The space is still lovely.  I thought the food quite good until maybe the late 90's.  Several chefs have come and gone recently (last few years).  I have had lunch/dinner here a few times over the last, say, 6 months, and it has been decent.  Nothing too stellar, but not horrible.  The menu gets tweaked more frequently.  HOWEVER - today I stopped by for brunch at about 12:40, it is scheduled to go until 2:30.  Brunch at the Silvercreek of old was very good - lots of salad and hot items, bustling crowd.  It wasn't too crowded, but I was saddened at the brunch I saw.  VERY limited salad items (though the dressing was good).  Mostly very standard breakfast fare, except that the scrambled eggs were somewhat brown (not from brown eggs, either).  Very few hot items, either - some brisket, the kind you would put on a bun, fried chicken (boring), and some salty, rapidly cooling prime rib and ham.  Desserts were unmemorable as well, including a key lime pie that had so much green food coloring in it that I wondered if one of the ingredients was green food coloring.  The trifle I had and the cheesecake were lackluster.  To top it off, I saw my server three times - once for my inital drink, once to clear plates, and once for the bill (which was wrong, I was charged for 2 buffets!) .  Never asked how things were - breezy and unprofessional.  Come on Silvercreek, there are too many other good brunch choices in town, including Luna and Jim Gould (best brunch in town as far as I am concerned, though I don't think they do other meals well).  I think the owner is too busy with his car collection to oversee his eating establishments.  I have not been very impressed with the Courier lately, either (same owner).",
                "reviewer_id": "S3dhPGW9PJfK6ZuQoJhKfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.029612710833028175,
                    "positive_probability": 0.9703872891669606
                },
                "stars": 3
            },
            {
                "review": "I ate here for my Graduation dinner. The service was pretty good and the food was decent. They have a pretty extensive menu and the atmosphere is great. The outside and surrrounding property at this place is awesome! I got some great pictures here with my family!",
                "reviewer_id": "sUrU9l3_f1iWYZdLmop0Rw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07307057425953074,
                    "positive_probability": 0.9269294257404687
                },
                "stars": 4
            },
            {
                "review": "Great friday happy hour specials keep me coming back for more! Good draft beer rotation as well.",
                "reviewer_id": "t_wzMgl2Q390xAn2ads0GQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9103052687125012,
                    "positive_probability": 0.08969473128749907
                },
                "stars": 4
            },
            {
                "review": "On Friday's Sivercreek has 'appyhour that is great! Half price appetizers in the bar area and live music. I love the atmosphere here and the regular Firday night bartendar is great (Brooke). She always knows what to recommend to drink and I hear she makes an amazing Bloody Mary. She prepares them prior to the Sunday brunch, which I still have yet to taste.The fries are really good with truffle oil and the Steak & blue cheese Quesadillas are excellent. The 'appyhour menu changes regularly, which is nice if you visit often.They have a large selection of bottled beers and change the tap regularly. They also have a good selection of wine. I just recently relocated to Urbana from Chicago and am happy to have found a place that I can frequent and always leave smiling!",
                "reviewer_id": "TijmvK49EbIENGun6HSY5Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005315625781875439,
                    "positive_probability": 0.994684374218127
                },
                "stars": 4
            },
            {
                "review": "Went to Urbana for quick Sunday visit with our U of I son.  Thought that taking him out for brunch would be nice and it was!  Even though our son is a senior we have never thought about taking him our for brunch before.  What a shame.  Silvercreek is a great find.First of all, half price mimosas and bloody Mary's.  Need I say more.  (Though a bit strange that they put a maraschino cherry in the mimosa.)  They have a nice omelette and waffle station that  the men enjoyed.  The buffet is filled with lots of hot options and a small table of cold items.  The hot table included two types of scrambled eggs, sausage, bacon, vegetable, two types of potatoes (the sweet potatoes au gratin were outstanding), fried chicken, salmon and a carving station with both ham and prime rib.  I always enjoy a nice piece of prime rib with horseradish cream sauce.  The dessert bar had a nice selection too, including a hot chocolate bread pudding that was absolutely decadent.",
                "reviewer_id": "TmbZeBevb4doESCOvhyr7g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002310270561053833,
                    "positive_probability": 0.9976897294389434
                },
                "stars": 5
            },
            {
                "review": "Disappointing.  For the money they charge the food should be better.  Scallop entree was lukewarm, terrible.  Lobster mac has changed, it was wonderful a couple years ago, now just nasty.  Steaks were good.  Never again.",
                "reviewer_id": "TOworX0HTY_yUt-ELSUHzA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5155258357186975,
                    "positive_probability": 0.48447416428130213
                },
                "stars": 1
            },
            {
                "review": "This place wants to be better than it actually is. The ambiance is really quite nice. They did a great job restoring the building and the grounds. It is beautiful, and it was also  the first smoke-free restaurant in town. I very much appreciated that at the time. The food wants to be outstanding, but it is only very good. For as much as this place costs, I want it to be better. More innovative, more spectacular. The wait staff is mostly very young and not quite experienced enough to pull off the fine dining experience. One time, one of them addressed my dining companion as \"dude.\" He took offense, and rightly so. We are not your surfin' buddies, we are your customers. That said, this is a great place for a big celebratory dinner with your whole family. It's a beautiful setting, the wine and beer lists are good, and your grandmother will be able to find something she wants to eat. So will your vegetarian cousin and her picky five-year-old, and so will you.",
                "reviewer_id": "uKgbjPhcrS2pi9hS39Az6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0003485135530386107,
                    "positive_probability": 0.9996514864469578
                },
                "stars": 3
            },
            {
                "review": "I've heard good things about Silvercreek's brunch, but woke up too late Sunday to go, so my friend and I settled on trying their dinner instead.Despite the weather starting to cool off, we decided to sit outside and enjoy the last traces of summer.  Sunday = 1/2 price wine night (per glass) which was surprising as their wine isn't unreasonably priced to begin with (~ $5-$9), and they have a nice selection to choose from.We split their goat cheese salad, I ordered their stuffed chicken breast, and my friend got their 5-spiced alaskan halibut (which I tried a bite of).  We both agreed that the chicken was really yummy and juicy, anwhile their halibut was well cooked and moist, I found it a bit tasteless (plus a on the more expensive for what you got).The ambiance is quite romantic (both inside and out), but you don't need to dress up unless you want (I was just in shorts, a tee, and a fleece), and it's just a nice place for a quiet dinner.I'm going between 3 and 4 stars here, but I until I try their brunch, I'll have to say 3.",
                "reviewer_id": "urDog6OhPoNKPJFUDob7AA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9109027141363085,
                    "positive_probability": 0.08909728586369747
                },
                "stars": 3
            },
            {
                "review": "I ate here last night and I was very impressed. I loved the atmosphere, and the food was very good. Everyone who took care of me was very attentive and knowledgeable.The bread that came with the meal was very tasty. I started off with the Roasted Squash Panzaella which is a crouton salad, and it was very good. There were too many croutons in it for me, but I just picked out some of them and ate the rest. For the entree, I got the Crispy Potato Crusted Michigan Whitefish. It was so good. I loved every bite. By the time I got to the end,  I was glad that I had not eaten all of the croutons in the appetizer.For dessert, I got the Apple Dumpling A La Mode and again it was amazing. It was on the small side, but I thought it was the perfect size for me. Someone else may be disappointed that it wasn't bigger but any bigger and I would not have been able to eat it all.All in all, I was very happy with my experience and if I am ever in town again, I will definitely go back.",
                "reviewer_id": "uX6MFUA0T-bwRgEvs77Xuw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0009051604553305708,
                    "positive_probability": 0.9990948395446768
                },
                "stars": 5
            },
            {
                "review": "I never choose this place but end up here a couple times a year because this is where people want to go (for whatever reason). It's always disappointing. After reading some of the reviews I can see it's not just me. Two repeat offenses. (1) reservations that are meaningless because they either overseat or over-reserve, and (2) mediocre food & service. Not worth it. Too bad Kennedy's closed.",
                "reviewer_id": "Va-MEqffAp5YOHFciwBkUw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9669824714664654,
                    "positive_probability": 0.03301752853353579
                },
                "stars": 2
            },
            {
                "review": "The food here is just plain terrible. Quantity is all they aim at while forgoing quality. I actually think this one and great impasta are by far the worst restaurants in town. As an Italian I can tell you this food has nothing what so ever to do with Italian cuisine.If I could I would give them negative stars.",
                "reviewer_id": "vCh812goLfIoFxtUVoyXJg (1)",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8980178429644443,
                    "positive_probability": 0.10198215703555472
                }
            },
            {
                "review": "The food here is just plain terrible. Quantity is all they aim at while forgoing quality. I actually think this one and great impasta are by far the worst restaurants in town. As an Italian I can tell you this food has nothing what so ever to do with Italian cuisine.If I could I would give them negative stars.",
                "reviewer_id": "vCh812goLfIoFxtUVoyXJg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8980178429644443,
                    "positive_probability": 0.10198215703555472
                },
                "stars": 1
            },
            {
                "review": "Ordered a medium rare steak, which was cooked correctly, but switched up with another diner's well done steak. We switched plates, no big deal. The steak itself was dry, chewy, and flavorless. The service was nothing of note either way. I ordered a Tom Collins and myself and my party were unable to tell if it was virgin or not. Even if it wasn't a virgin drink, it was an inexcusably small and undetectable amount of alcohol. I wont be returning and would not recommend.",
                "reviewer_id": "vclHUVjw2fSCDUnJ2mSVHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15562936681002845,
                    "positive_probability": 0.8443706331899764
                },
                "stars": 1
            },
            {
                "review": "Been here several times over the years and have never been impressed. The waiters are slow and unresponsive. The food is mediocre and has always taken a long time to reach the table.For example, once ordered a steak, asked for medium rare but got well-done, so I sent it back. The waiter was hesitant but took it to the kitchen. After coming back, the waiter was argumentative and said the chef said that is how it is supposed to be. Paid the overpriced bill and left. Don't care to return, which is a shame because I like the ambiance and want to support local restaurants.",
                "reviewer_id": "VToSHMGLUnoxfdMZBvSLHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.055544397336764695,
                    "positive_probability": 0.9444556026632374
                },
                "stars": 1
            },
            {
                "review": "I have been using for business lunch/dinner.   Nice atmosphere, good servings.  Foods are ok, but they got nice wine selections.",
                "reviewer_id": "W1Y-KXnONh3hARvwy-IeqQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8808644223036372,
                    "positive_probability": 0.11913557769636236
                },
                "stars": 4
            },
            {
                "review": "I have visited Silvercreek multiple times for both dinner and lunch. Without a doubt, the BEST restaurant in central Illinois! I always order the fillet when I'm there for dinner and it ALWAYS comes out perfect! Cooked medium, just the way I like it. Seasoned perfectly! Not to mention the staff is always attentive to every need! I never have to ask for anything...they are always one step ahead! I've also experienced the same amazing food and service for lunch! Just when you think it can't get any better, it does with their Sunday brunch! It's worth every penny! I usually frequent Silvercreek about 3 or 4 times a month, and it never lets me down. ABSOLUTELY AMAZING! The quality of food and service at Silvercreek sets the standard for all other restaurants! I wish I could afford to eat dinner here every night! It's awesome! I can't get enough! Keep up the amazing work!",
                "reviewer_id": "wPJtYECbe7QpXnMx5MNjLA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0002460624094198705,
                    "positive_probability": 0.9997539375905833
                },
                "stars": 5
            },
            {
                "review": "Where to start... OK I always thought that Silvercreek was a good place to go if you were A) Old, B) White, and C) middle-class and want to feel good  about your middle-classness. Which is why I never went, because I A) Feel old, B) am really white and C am horribly middle class. I don't like to go places where I all I see is clones of myself, but we went to Silvercreek for the first time 10 days ago, and have already been back another time since!First things first, the decor will suit anyone's parents, but isn't so stuffy and lame that you want to rip the crocheted crap off the walls and scream. The service is good, although knowledge of the wine list could be better (from both servers so far). The menu is really interesting, with a lot of options, and some cool creative twists on some meals which would otherwise be your typical American bistro fare. Prices are worth it, HUGE portions (generally speaking-but the pork chop especially is Massive and the Hangar steak notsomuch).I fully intend on going back, frequently.",
                "reviewer_id": "wtsl05RJj5f6YBDQPEwP2w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9704171367279529,
                    "positive_probability": 0.02958286327204691
                },
                "stars": 4
            },
            {
                "review": "I tip my hat to Silvercreek and their amazing staff for accommodating my rather large family during my father's funeral. I know we were boisterous, but they didn't blink an eye and served us like royalty with quality food & beverages. We had called ahead initially to Longhorn Steakhouse (my mother's favorite) who informed us they wouldn't accept a party our size. A sibling and I had each had very good experiences with Silvercreek and were able to persuade my mother. This is now her favorite restaurant.",
                "reviewer_id": "wwe-x6uzHL9Kb4ianyxp3w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08048641135979404,
                    "positive_probability": 0.9195135886402049
                },
                "stars": 4
            },
            {
                "review": "We have been to Silvercreek several times for lunch, dinner and special occasions (booked events in the greenhouse).  I've always noted good service and the food is very good, especially the house-made breads.  This past weekend we tried the brunch for the first time and were delighted!  It is quite an extravagant lunch with MANY options, and they were constantly refilling the trays so everything was fresh!  The waffles were fantastic, light and fluffy, the salads were fresh, and the hot items were flavorful.  I was struck, as a vegetarian, with how many green vegetable options I had!  Brussels sprouts, broccoli, zucchini with cherry tomatoes, spinach salad, cucumber salad!  For meat eaters, there were all sorts of coldcuts, fish and seafood, fried chicken, beef and ham.  And save room for dessert, there are almost as many dessert items available as there are main course, so many cakes!  Along with tarts, candy, apple crisp, bread pudding (which wasn't very good, the only thing I didn't like at all), trifle and fruit.  This is the perfect place to bring visiting family or have a nice brunch out with friends.  Service for us was good, though I did have a bit of a wait once for a water refill.  The only thing that was kind of surprising was the treatment of the line/where the buffet is set up, it's not ideal but it seems to work so-so.",
                "reviewer_id": "wZ2B3_9CiWUQCd6hS156Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0003048663279076405,
                    "positive_probability": 0.999695133672097
                },
                "stars": 5
            },
            {
                "review": "My bf and I went with another couple to this place as we'd heard great reviews. The ambiance is wonderful and we had a very friendly and attentive server. The food was absolutely delicious. The only downside was they were out of the one dessert we wanted to order but I would definitely go back to dine again (especially to try for the chocolate cake again).One of the nicer places in Champaign and Urbana - loved it!",
                "reviewer_id": "XXaUQHIcjaROjFhXkllw7A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00016656827520977944,
                    "positive_probability": 0.9998334317247894
                },
                "stars": 5
            },
            {
                "review": "I look forward to Silvercreek's Sunday brunch and try to go often.  Its always full of great tasting choices and everything is fresh.  Love the make to order omelets and especially the prime rib and ham carving station.",
                "reviewer_id": "xZhXEZnxK9eJ-gMzAn5GRg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1559661824955783,
                    "positive_probability": 0.8440338175044175
                },
                "stars": 4
            },
            {
                "review": "Never gone wrong here with the lobster tempura appetizer, filet mignon, & creme brulee! They change up their menu seasonally which is fun. My boyfriend & I prefer it over going into downtown Champaign now. Easier parking, quieter atmosphere, & better service in our experience.",
                "reviewer_id": "ypPrpnH-Hehp7iwPupBvcg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5178736034422466,
                    "positive_probability": 0.48212639655775125
                },
                "stars": 5
            },
            {
                "review": "Dad's day needs a step up on the C-U restaurant ladder, don't you think?We made a reservation at Silvercreek and were so glad to have this beautiful, WARM and welcoming spot to retire to after another bitter loss on the field.The lunch menu is not quite as diverse as the dinner menu but we all loved our entrees.  We started with the corn chowder which was filling and nuanced.  My husband had the special pork tenderloin and my daughter and I had the vegetable ravioli - rich and delicious.  Plus the best bread basket in town.I was a tad diaspointed in the chocolate cake - beautiful but the taste was dull.  That cake looked so much better than it tasted.  Had the dessert been better, this would be a five.  I have been there multiple times and have long felt this is the weak link in an otherwise great restaurant.When the football team disappoints, the food will not! I L LI N I",
                "reviewer_id": "zfuJwHFip_KoJlb9SR-g4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006216493809332731,
                    "positive_probability": 0.9993783506190695
                },
                "stars": 4
            },
            {
                "review": "I was really expecting much better things from this restaurant. Based on the good reviews and seemingly more upscale menu, I thought this would be a nicer restaurant with good decor and great food. Well, not so much. My friend and I showed up around 7:30 on a Friday night and the place was only about half full. That should have been our first hint. The restaurant has a rather strange look what with the exposed brick and ceiling beams combined with the country-style tables, carpet, and booths. Overall, it just looked a little dated and old, especially the booths that were in a bit of disrepair. The dinner menu isn't huge and has a handful of selections for seafood, steaks, and pasta. I opted for the potato-crusted whitefish. It came with a cream sauce, asparagus, mushrooms, and carrots. It came out nicely presented, but when I lifted up the outer potato crust and got a glimpse of the actual fish I was so annoyed. I'm not exaggerating in the slightest when I say that piece of fish was 2x2 inches. Maybe you're not supposed to notice that with all the potato lumped on top of it, but at $18 that was absolutely ridiculous. My friend said her lobster mac and cheese was good, but so rich she could only eat half. And, BTW, it was corkscrew pasta, not macaroni.Sadly, I didn't order a salad because those actually looked pretty good. And there was also a good looking maple banana cake, but I refused to spend any more money there so I can't attest to the desserts. Overall, this place is way, way overpriced and I would never go back.",
                "reviewer_id": "Zi1UeAxAHu36Fv6vZcTRNg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9982243595975313,
                    "positive_probability": 0.001775640402468743
                },
                "stars": 2
            },
            {
                "review": "Atmosphere is warm and comfortable. Waitstaff is attentive but mostly young and inexperienced. Food was... Ok. Ordered the mixed grill special. Gremolata ( overpowering and chemical flavor) on over-cooked scallops, undercooked fingerling potatoes and a passable steak with uninspired brown sauce poured over. Overall, quite \"ok\" but no better. Highlight was the dessert, a chocolate cake with ganache and mousse. Best part of the meal was feeling welcome to linger and chat, which we certainly did.",
                "reviewer_id": "ZqrBLRi54SBNvFyQUYqEfQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001097622160234151,
                    "positive_probability": 0.9989023778397654
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "bkbOmsZ9cOggOnpKsxOyiQ",
            "g5I1qNIGWTU3lizsneXQiw",
            "sBw0ZgTVeRgdOA3sfGIcwQ",
            "DntkMrzlbFPdOdxJtEWLBw",
            "uJczFcnoK8f9uWgtb0hFGw",
            "AB5RgQ0ZnMThdqgFS3cPuw",
            "JlcbIU8V6ohFCwfuMr7tBg",
            "JCqFWCn31OMSk-vqF5aYNQ",
            "qevmzWge4_pwJ6SB8gKTiA",
            "6HKjKhgDLBpuZFNBOCzVQw"
        ]
    },
    "bkbOmsZ9cOggOnpKsxOyiQ": {
        "keywords": {
            "bigrams": [
                "bread_company",
                "chocolate_fondue",
                "cheese_fondue",
                "pretty_good",
                "great_place",
                "goat_cheese",
                "food_good",
                "good_food",
                "roast_beef",
                "lunch_dinner"
            ],
            "unigrams": [
                "bread",
                "food",
                "good",
                "place",
                "fondue",
                "dinner",
                "service",
                "company",
                "time",
                "sandwich"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": true,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": false,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "free"
            },
            "business_id": "bkbOmsZ9cOggOnpKsxOyiQ",
            "categories": [
                "Bakeries",
                "Food",
                "American (New)",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "706 S Goodwin Ave\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "23:00",
                    "open": "08:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "08:00"
                },
                "Saturday": {
                    "close": "23:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "08:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "08:00"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "08:00"
                }
            },
            "latitude": 40.1066554,
            "longitude": -88.2236278,
            "name": "The Bread Company",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/gX06VGDODfp6z4MkRo3YvQ/ms.jpg",
            "review_count": 92,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "And the food is not good. I think it would have been a good sandwich. Good food. ",
        "reviews": [
            {
                "review": "Food was pretty good. Nice ambiance for dinners. I got the hot turkey sandwich that came with some tasty potatoes in the side and a salad. Was a little bit on the pricey side for a sandwich, but I think that if you go during lunch you'll get a better value for money. My friend ended up getting a pasta dish which was pretty decent however like I mentioned it was pretty expensive. Would be nice for a special occasion.",
                "reviewer_id": "-9N-SGoWsgjHUC8hjDY60g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9083275487734745,
                    "positive_probability": 0.09167245122651853
                },
                "stars": 3
            },
            {
                "review": "It had been a couple years since I last went to The Bread Company, and since today was a beautiful day to sit outside and eat a sandwich, my boyfriend and I decided to give it a go.  I got a half portobello sandwich, half strawberry salad - a delightful combination, and everything tasted fresh.  (I'm gonna have to figure out how to make that sandwich on my own!)  My boyfriend's salmon burger was pretty good, but served on bread and not a bun, which was kind of odd.  I also had the English Orange iced tea, which was refreshing and a little sweet without being cloying.Our waitress had a major stick up her ass, though, which is why I'm downgrading them a star.  Bread Co., why must you hire rude people?  More often than not, the people working here are gruff and disdainful of the customers.  I get it, you're too cool to smile.  I'm not asking for a hug at the end of the meal, all I'm looking for is service without a scowl.",
                "reviewer_id": "-C93MHl3n-O_5KU_zGjEgQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013823882088468605,
                    "positive_probability": 0.9861761179115298
                },
                "stars": 3
            },
            {
                "review": "I ate dinner at The Bread Company for the first time last night prior to attending a play at the Krannert Center.  I had read many reviews of the restaurant and entered with some trepidation.  My party had a reservation for ten people at 6:00pm and I was in the last group to arrive - a little late. The other guests were already enjoying a drink while waiting. The service and food were both outstanding. Our server, Nick, was prompt, polite, and knowledgeable.  Everyone's food looked so good. I ordered a vegan pasta dish with vegetables, which was excellent.  My wife had one of the unique pizzas and enjoyed it thoroughly. I noticed that at the end of dinner all in our party had left nothing on their plates.  We were all full happy campers! Only one member ordered dessert - chocolate mousse. He said it was great.We were finished with a leisurely dinner and had our bill paid with more than enough time to stroll down the block to see our play. The only negatives were bread that was a bit burnt due to what appeared to be a hot spot in the oven and the meals which were delivered to the table one or two at a time, which seemed a bit odd. However, the overall experience was enjoyed by everyone, making for an excellent prelude to the play. I will definitely come here again.",
                "reviewer_id": "-KZ0k14H3zdZVzEnhVq1ag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00021861858672571734,
                    "positive_probability": 0.9997813814132775
                },
                "stars": 5
            },
            {
                "review": "Super romantic spot on a cold winter night. The fondue is excellent. Staff is intelligent and attentive. The crowd is the highly educated, super liberal type. Refreshing sometimes.",
                "reviewer_id": "-mqE7uZSnGEAb_quhfcyJQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018431189851476296,
                    "positive_probability": 0.9815688101485214
                },
                "stars": 4
            },
            {
                "review": "Come here regularly for lunch but never knew it was such a nice place for dinner!  The original plan had been Timpone's, but apparently despite their website and store sign saying they open at 5 PM they somehow decided they wouldn't open till 5:30, and since I was too hungry to wait around for 30 minutes (the excruciatingly loud construction out front did not help either) I \"settled\" for Bread Company.  They're usually a soup and sandwich place during lunch, but for dinner they completely switch up their menu: filet mignon, duck breast, tapas, and fondue???  On CAMPUS??  The food was absolutely delicious if slightly pricey ($15-20 for an modestly portioned entree), but if paying $20-some will get me amazing bread, salad, ahi tuna steak, bread pudding, and a mint iced tea, all without leaving campus, well then I'm sold =P",
                "reviewer_id": "-Yk1KPbMJGY5OkRUeo8jlw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9573634870194151,
                    "positive_probability": 0.04263651298059847
                },
                "stars": 4
            },
            {
                "review": "Pretty much my favorite spot in C-U. Relaxed atmosphere and very nice food. Love the salads, pizza and pasta.",
                "reviewer_id": "0TMxhtrYQjbgkuqs_j2GqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14272491986989302,
                    "positive_probability": 0.8572750801301068
                },
                "stars": 4
            },
            {
                "review": "Three star food with two star prices - not to be confused with the two dollar sign symbols on yelp :p So yes, I mean it's extremely overpricedDecent for an \"special occasion\" and students tend to be impressed with this place just because it's actually a nice sit-down restaurant and not on Green Street, but it needs to get over itself a little if it wants to thrive in Chambana. Fondue is really the only reason to check this place out since I don't know of anything else nearby that has this for dessert, but food is just average. Oh and their sangria is on point, too. But really, what college kid is drinking sangria? If they are, they are probably used to their wine out of a box",
                "reviewer_id": "0YlyigoFd3dNepDvNr3sVw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21968050139730436,
                    "positive_probability": 0.7803194986026913
                },
                "stars": 2
            },
            {
                "review": "I popped in here once for lunch last summer, on the recommendation of my nutrition professor.  Our chat on carbs and training for races and triathlons led to \"you HAVE to go to the Bread Company!\" Though this overly subtle carb stop doesn't have a sign (anymore?) on its exterior, it can be identified by the variety of wine bottles lining the window sills.  There's a variety of sandwiches for the lunch hour, but I hit the Bread Company tonight, and my, do they swank it up for dinner.Dim lights, plentiful menu of pasta-pizza-sandwich options, and extensive specials list, including tapas.  Who knew?  I had the roast beef sandwich, served atop roasted potatoes and a light salad.  I think all of the sammies are served up open faced, so open your mouth, and get ready for a carbolicious meal.",
                "reviewer_id": "2sklUYBnk7LxzM-11yPUPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19611538868990525,
                    "positive_probability": 0.803884611310086
                },
                "stars": 3
            },
            {
                "review": "Another time I may have given this restaurant 4 stars, because in the past we haven't had the best service. However, my husband and I went here last night for our anniversary, and everything was perfect. Even though we have had some issues with the service in the past, my family (pre-husband) has been coming here for as long as I can remember, probably over 10 years. The food is so good, there is really nothing the servers could do to keep us from coming back. My favorite meal in the world is the cheese fondue (sometimes with the tomato puree), one of the yummy pizzas (preferably with brie), followed by their chocolate fondue. (I think I have strayed from that formula once, I can't remember what I ordered)I didn't think it was possible, but last night, all three of those items were better than ever. We had the cheese fondue with the tomato puree this time, as well as the pesto, portobello mushrooms, artichoke hearts and brie pizza - it was amazing.The chocolate fondue came with more fruits than I remember in the past, red and green apples, pears, strawberries and some yummy little cake pieces. The best meal I had all year.The service was excellent.",
                "reviewer_id": "2uOoaDGEzwKToEGcpxhXIA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.910485896530065,
                    "positive_probability": 0.08951410346992783
                },
                "stars": 5
            },
            {
                "review": "The Bread Company is one of my favorite restaurants, and is one of the things I miss most about U of I.  I ate here frequently as a student and as an alumna I make sure to stop in every time I return to campus.  The atmosphere of the restaurant makes me feel like I'm taken away from the stress of every day life.  They have a fireplace in the corner and white lights strung up to make it feel romantic, but it is modernized with the art that they have on the walls.  My husband and I usually share an order of cheese fondue and a gourmet pizza.  The Bread Company offers a nice selection of wine and beer, including wine by the carafe.  I can't forget to mention their selection of fresh baked cookies.  The sables and chocolate macaroons are delicious.  Great atmosphere, delicious food, and reasonable prices - I love this place!",
                "reviewer_id": "3_yZvh675CdJvmoSShBB3g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018936831580978947,
                    "positive_probability": 0.981063168419023
                },
                "stars": 5
            },
            {
                "review": "Bread Company has been around for 15+ years, it is the kind of local place that visitors to town are likely to miss, but it's worth checking out especially for those who like to avoid chain restaurants.I recently stopped by for Sunday brunch--something I almost skipped because their website didn't list a brunch menu (I thought I knew most of the brunches in town and didn't know Bread Company was an option until today).The service was friendly, but like a lot of local restaurants, the timing was not-so-great and generally felt inexperienced.The waiter offered slow-drip pour-over coffee, but called the coffee \"blends\" when they were actually single varietals (sorry, coffee nerd here). The Ethiopian Yirgacheffe, though, was aromatic and worth the extra charge (though it's reasonable to expect that the menu had listed the price or the waiter had known it after I asked: no luck on either).I waited much too long to place my order after sitting (and it was not busy).  But the prosciutto and gruyere omelet (which I added spinach to with no problem) that arrived vastly exceeded expectations: it was flavorful, chock full of good ingredients and not overcooked. The pan-fried potatoes were spiced but not overly salty (though I sent them back when they arrived with a huge dollop of unmentioned sour-cream--ew).The baked bread was sourdough and crusty and a perfect accompaniment. Nice job, Bread Company. Great food. Lacking final star only because my waiter could have used some some further training on the menu and service timing.",
                "reviewer_id": "3zxHXzxP6D6K6kvDImzMAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17115061203750176,
                    "positive_probability": 0.8288493879624983
                },
                "stars": 4
            },
            {
                "review": "When our department has to entertain guest speakers or job candidates, The Bread Company always becomes the default dinner/lunch location.  Embarrassingly, I've heard some job candidates comment that they were taken here for 3 different meals during their visit!  My department is probably at fault for their lack of imagination when choosing restaurants, but The Bread Company offers some benefits that elevate it to a top pick for business-casual university diners:(1) Location.  For people who have short lunch periods and need to be within walking distance of campus, this restaurant's location is unbeatable.  (And since it's next door to an Espresso Royale, you can grab a coffee after your meal, if desired.)(2) Atmosphere.  Most college restaurants resemble a McDonald's Playroom for adolescents: neon walls and heavy-duty plastic furniture, with underlying scents of urine and vomit.  While The Bread Company does have a hint of grunge, it also invokes a strong sense of urban, artistic chic.  There are real paintings on the wall (not poster prints).  At night, they bring out white tablecloth and mood lighting.(3) Price.  I think the prices are reasonable depending on who you ask.  This place IS pricey when compared to most campus restaurants, where students are always trying to squeeze their dollars.  Lunch generally runs around $7 to $10, which is not unreasonable when entertaining guests.  (And still comparable/cheaper than what you can get at Timpone's, the other \"nice\" restaurant in the area.)All of the food is fairly conservative, with obvious combinations of flavors (brie + portobello, turkey + pesto, etc.).  I think this is also a reason that it ranks highly among options for guests; you will find nothing offensive here in terms of food (but also nothing exciting).  The presentation tends to be elegant and you can tell that most of the ingredients are of good quality.For lunch, I always go with the egg salad, which is creamy, well-seasoned, and always satiates my craving for egg goodness.  In the early evening, sometimes I stop by for a beer and appetizer with friends.  The cheese selection is quite good (you'll find Stilton, Gouda, Manchego, etc.), and the beers are all microbrews (if you're into that kind of thing).  Dinner selections include fondue, pastas, pizzas, and some specialties, but the prices are on par with more interesting restaurants in downtown Champaign/Urbana.In terms of baked goods, I am quite fond of ordering my sandwiches here with sourdough or rye bread.  Yum!  At most places with a baking reputation, I always find myself enticed by the sweet buns and cookies, but I almost never find myself tempted by the ones at The Bread Company.  Their treats always look colorless and hardened, as if they were made by an angry grandma.Overall, I'd recommend this to people who like simple, light food.  If you are cheap and don't care about indie street cred, you could probably get the same food at Panera.",
                "reviewer_id": "6nqakbu2zU6fjOmbE83_-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013850934064814559,
                    "positive_probability": 0.9861490659351995
                },
                "stars": 3
            },
            {
                "review": "One of my favorite places to go in town, especially when I'm not in a hurry! Everything is delicious - the bread is wonderful, paninis and french onion soup are superb. I always start with the lemon garlic green salad. Pizza beats nearby restaurants' offerings by a long shot! Try the savory or sweet fondue. Excellent brunch spot as well (the quiche is a standout). The atmosphere is calm, praceful and inviting. Waitstaff tends to move on the slower side, but are genuinely interested in helping you create a meal you'll enjoy.",
                "reviewer_id": "6RBEizXvqPcWBVg8ORuEWA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.020412439176589907,
                    "positive_probability": 0.9795875608234121
                },
                "stars": 5
            },
            {
                "review": "An OK , but not great, place to grab a sandwich for lunch.  Not surprisingly, they do have really good bread.  Horrible destination for dinner.The lines are long and the sandwiches are pretty decent at lunch time, and it's certainly worth a try if you've never been here before.I've been in twice for dinner and was very disappointed both times.  The first time I was here, the place was dead and there were maybe 2 other tables seated.  The other time was for Valentine's Day (stupid, I know), and the place was packed and seriously overbooked since they apparently had given reservations to everyone who called and asked for them.Both times, the service was very slow and the staff was *extremely* rude, to include elbowing and pushing customers during the crowded V-Day fiasco, which I found inexcusable.  The quality of the food was poor, the servings small, and the prices high.  There were definitely some interesting looking recipes on the menu, but the quality of the ingredients was very substandard so nothing tasted very good at all.  Produce is not fresh and all the fruits and vegetables I had on both occasions were over or under ripe and clearly prepackaged.  The first time I was in there, about 3 different entrees were ordered before we picked something they weren't out of.I only went back the second time for V-Day because I wanted to try out the chocolate fondue.  In addition to being waaaaaaaay overbooked, they were understaffed and had a limited V-Day menu that was basically just 6 or so items from the regular menu with the already high prices about doubled.  Portions were so unbelievably small that even after spending $75+ on dinner, we had to go to LaBamba's afterward because my husband was still really hungry.  Seriously, he was served a piece of lamb that was roughly the size of a sliver dollar and probably could've been eaten in one bite with a little effort.  Total time in restaurant was in the 3 hour range due to the poor service and inability to seat in accordance with reservations.  The chocolate fondue was served in a beat up saucepan that had something crusted all over the outside of it.  Chocolate itself was actually pretty good, but the amount of stuff they gave us to dip in it was staggeringly small and the vast majority of it consisted of bananas and apples that were overripe to the point they couldn't be eaten. Although it was fondue for two, there was only one piece each of the more high quality dipping items (cookie, strawberry, etc.)I will certianly not be back for dinner and probably not for lunch either since there are a variety of other lunch places in town that are just as good or better that are easier to get to, Paradiso in particular.",
                "reviewer_id": "6uSW2qLSL5w0iz0g-Iwa-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0031684887105837252,
                    "positive_probability": 0.9968315112893856
                },
                "stars": 2
            },
            {
                "review": "It has been probably a decade since I have been to the bread company, and today I found out why and have vowed I don't have to go back....ever. A coworker and I went and the service was horrible (nothing new here - read the other comments - it must be their 'thing'!), price was absolutely atrocious for lunch and I ended up being sick all afternoon. I ordered the ham sandwich and my friend ordered their special salad of the day. Price was over $15. She got a diet coke, I was offered a shot glass of water with no ice. We get to the cashier and she refuses to listen to me as I try to tell her what our order was. I asked the gentleman who took our order to put it on one ticket as it was my turn to pay, and he didn't. So, she proceeds to ring me up, and then not give us the drink. So, I tell her, we need the diet coke. She flips back through the register tape and says, \"Oh, I overcharged you a little. Oh well. I'll go get the drink.\" NEVER offered me a refund or to make it correct. Then, gives me a picture to put on our table so she can bring us our items, but then said, \"Oh, nevermind, they are both ready.\" So, I'm standing there with a drink, my wallet and looking at two plates. I said, \"I can't carry all this.\" she says, \"You can take a tray\" and points to the cafeteria trays on the counter. I opted to deliver my friends salad to her (as she had secured us a table) and drink, and then came back for my sandwich. I ordered a ham sandwich. I got a turkey sandwich. And then, I got sick......I will NEVER return. I don't need to pay over fifteen dollars for a salad and drink and sandwich and be treated like shit only to then be sick all afternoon.",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.995449734265022,
                    "positive_probability": 0.004550265734975948
                },
                "stars": 1
            },
            {
                "review": "I LOVE this place. My boyfriend and I used to go there on dates when we went to school there, and we'd order the cheese fondue and a bottle of wine. It's a great date place, and the ambiance is better than many places in the Champaign-Urbana area. Plus, the prices are very reasonable! I'll be going back whenever we're down there!",
                "reviewer_id": "_aM0UJTwUEpGrQOCICYkCg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18945755473604986,
                    "positive_probability": 0.8105424452639489
                },
                "stars": 5
            },
            {
                "review": "At first i thought this place was a little pricey but when my food came out, it was totally worth it. The pizza i got was delicious and the whole restaurant is so cute and comfortable! It has a great vibe to it and the employees were very nice. I ordered a margarita pizza, i was expected a cheese pizza with tomatoes and basil but it was just a cheese pizza........lol but it was still really good!",
                "reviewer_id": "_KZ5ryxqtn2MDaVfpIGzMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11540607619307,
                    "positive_probability": 0.8845939238069329
                },
                "stars": 4
            },
            {
                "review": "The Bread Company is one of the best restaurants in C-U!  If you think that the reason why they are selling out of different entrees at dinner is because of poor planning, it is obvious that you have never worked in the restaurant industry.  Dishes sell out at the Bread Company because they are popular...duh!  There is no way to predict what will sell what night, and if you are upset that dishes are out of stock, you should be showing up earlier to insure that they still have their full night's supply.  As for the service being poor, it's true: the servers are mostly college kids that could give two shakes about their job, but the food is so incredible, it just doesn't matter to me.  The head chef, Daniel is honest to God a pure genius when it comes to creating new dishes and I never order off of anything but the specials menu.  Trust me when I say trust Dan with your dinner.  If he has a hand in creating it it's bound to be amazing.",
                "reviewer_id": "_qXYOeydUziFOfHwoFxPMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04093692242495011,
                    "positive_probability": 0.9590630775750502
                },
                "stars": 5
            },
            {
                "review": "Something has got to be done about the abominable service at The Bread Company.. It's such a shame because their food is not bad, but the service is so badly below standard, I decided I am simply never coming back here.There is one particular worker with tattoos on his arm who is very insolent towards customers, raising his voice at them for asking questions.For months, I've ordered a grilled sandwich to pick up for lunch time, and the result is totally random. If the owner (tall bald guy) is there when you call, chances are you'll get a good sandwich with the potatoes and salad on the side, but if he's not there, watch out: there's no telling what you'll get. Sometimes they include potatoes and salad with the sandwich, sometimes they don't. Sometimes they slice the sandwich, sometimes they don't. Sometimes the sandwich is available since the grill is on, and other times it's not even available since they turn off the grill in the middle of the day to save money randomly.Today for example, I went to pick up my grilled sandwich to-go, and was surprised to see that on this occasion there were no potatoes and salad included, even though two weeks ago I ordered around the same time and they were included. So I asked the short-haired lady in front of me behind the register, \"are there potatoes and salad?\" (pointing at the sandwich) and she stared directly at my eyes without answering! So I repeated the question and she stood there completely quiet, staring at me without answering, when the tattooed arm punk butted in our conversation, cocked his head at me and yelled, \"didn't we go over this already?!\" Don't bother coming here. Unless the owner fires some of the incompetent and insolent flunkies buzzing behind the counter soon, this place needs to go out of business ASAP.",
                "reviewer_id": "ApioERn8BQGE-HWEEZMM_A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9915059265600711,
                    "positive_probability": 0.008494073439914467
                },
                "stars": 1
            },
            {
                "review": "The food at TBC is fine if you like moderately soggy vegetables and bland sandwiches. They have vegetarian options, that are okay, more diverse than many places, but the few times I've been there, the salads needed a little work.  It is a-ok to tear the lettuce up a bit so people don't have to slobber it all over their faces.  I really hate a clunky salad.  The pear panini was satisfying and but the IKEA tables outside make me nostalgic for my own yard and my own cooking, thus reinforcing my tagline \"Vegetarian with a touch of snobbery\"I don't rate restaurants on their administrative prowess, but if I did I wouldn't give any to the TBC.  The waitstaff and management made it nearly impossible to process a reimbursement through the University of Illinois.  You would think, given their proximity to campus, that they would train people adequately with respect to how to handle the idiosyncrasies of receipt processing through the University.  Instead, I am wasting my work and personal time chasing down the original receipt for a charge entered incorrectly by a waitress.  And the day manager can't help me?  Um... I just recommend not going here at all if there is a chance you will need to then make your lifework sleuthing receipts.  Oh how fulfilling.   I've heard other people say that it is always a nightmare to expense TBC meals.   The U of I-area restaurants need to take a page from the book of vendors in other college towns and get their act together.",
                "reviewer_id": "b60JsTGYbVqUGYbI81aOsw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04946593779222614,
                    "positive_probability": 0.9505340622077925
                },
                "stars": 2
            },
            {
                "review": "I've been here a couple of times with a group of people at an off time. The experiences I've had were fine. The service was good, food is decent, a little bit more than what I would like to spend for the amount that I get, but is a solid change to add in your repertoire of restaurants for lunch.",
                "reviewer_id": "Ba9fIJAmGNjFXU2Oc0fyxQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.055243369237290625,
                    "positive_probability": 0.944756630762711
                },
                "stars": 3
            },
            {
                "review": "I like it enough to come back. The grilled Hawaiian sandwich is good, but crispy borderline burnt tasting today. Their tuna salad is really yummy. They are pretty skimpy on salad dressings and a few times I've had some wilty, yuckiness in my field greens salad. Nice ambience though, and good outdoor seating.",
                "reviewer_id": "bq7NqilNqH3_kYW1pSaHRw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9279507188446171,
                    "positive_probability": 0.0720492811553809
                },
                "stars": 3
            },
            {
                "review": "My wife and I ate dinner here while passing through after deciding to skip a local BBQ joint that smelled great but was very crowded. We were not disappointed by ending up here instead. The place is small, fairly intimate, and quiet enough we could enjoy the music playing in the background and converse without having to shout.We had the caramelized onion and cheese fondue for an appetizer, shared a delicious entree of skewered lamb served on a bed of naan bread and tzatziki sauce, and finished off with a tasty but not too sweet dark chocolate dessert fondue. The house-made mint iced tea and mulled wine were also very good.The food was interesting and delicious, and our waitress Joanna was awesome. She was friendly, answered all of our questions, and checked in just often enough to make sure we had what we needed without being overbearing. Best service I've had at a restaurant in a long time!If we ever pass through again, we will definitely stop in at The Bread Company.",
                "reviewer_id": "C1_uVFa-BKeKbx9VOpOVRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25636502898272256,
                    "positive_probability": 0.7436349710172628
                },
                "stars": 5
            },
            {
                "review": "This is probably the best restaurant in Urbana. First of all, they bake their own bread and fresh pastries are available for breakfast everyday. My favorite is the cheese (gruyere) croissant because it is so flaky. It literally melts in my mouth. My coworker called it high class junk food but I call this good stuff. Sometimes, when I felt lazy to go to lunch, I would just buy a loaf of bread and eat that with a cup of coffee. The zufte or zoft, which is a Swiss specialty bread is amazing. It is fresh and out of the oven by 11am during school days. I have not seen other places in the area that sell zufte but the bread is really worth trying. Oh, if you have cravings for day old bread, they sell them at half price.They also have a wonderful selection for dinner. Daily specials change quite often but they have their regular dinner menu. I usually go with the daily special. This place also has fondue, both cheese and chocolate. I had both and I have to say that they are pretty stingy with their cheese and chocolate. I had barely enough to cover the fruit or bread. Do expect $12-$17 for entrees and about $10 for fondue. By the way, they sell cheeses too in the day.They have pretty good service but the people do not seem to smile a lot during the day, especially the owner. They should be happy because of the wonderful smell of fresh bread. The decor is a little European and has a fireplace at the corner which makes the place extra cozy in the evening. Anyhows, this place is highly recommended. I am sure you'll love it.",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28905426324088485,
                    "positive_probability": 0.7109457367590974
                },
                "stars": 5
            },
            {
                "review": "We were here a couple of months ago with a large group of friends. The server took really good care of us and even did a good job of splitting up the bill. I think this is a great place to check out if you want something a little higher quality than the in and out places on campus. I feel like the food is very reasonably priced for the quality and it's nice to have this as an option on campus. It's a great place to go before a fancy event at Krannert for example. Some of our favorites are the special pastas and the raclette.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02987440424903178,
                    "positive_probability": 0.9701255957509736
                },
                "stars": 4
            },
            {
                "review": "Awful, awful, awful. Haven't been in there for a couple of years, when I had an overprices, literally burned awful pizza. Their prices keep going up, the service down below. Not a glass of water even. Lunch this time. (The last try.) Ordered their special - a \"Southwestern burger\". A 45 minutes wait without as much as an apology. Then the \"masterpiece\" comes - frozen Walmart-quality mini-patty on a tasteless small bun. Everything way too salty. Barely edible. Ten bucks without tip for this sub-MacDonald concoction. Overworked, insufficient in numbers student workers who do little in terms of service but hope for a tip nevertheless. Obviously the owners worry more about as big a markup as possible than about their customers. The Bread Company does make big profit - the place caters to food-uneducated, wealthier young undergrads, who mistake this garbage for gourmet food, just because they have to pay four times what it's worth. Awful.",
                "reviewer_id": "dCVNBSMVy1cqpJBw1OJ_6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0029208551860000465,
                    "positive_probability": 0.997079144814005
                },
                "stars": 1
            },
            {
                "review": "I had (and still have) high hopes for the bread company. I loooooooooove bakeries. Love. Bread = happy. I lived in Germany for a while, so european style bakeries are even more happy.The first time I came to TBC, it was around 11am on a Tuesday and I wanted a quiet place to study. I wanted to get a small zupfe roll because they were fresh out of the oven and a cup of coffee, but that didn't cost $5 and I didn't have any cash (there is a $5 card minimum). I wound up getting an americano, a whole zupfe loaf, and a cookie. The zupfe was delicious. Hot from the oven, braided, yeasty, and slightly sweet. I pulled it apart and ate 1/3 of it right there. The cookie was pretty greasy. The americano was fine.The second time I came it was after a big exam and I wanted a glass of wine. At 11:30am. TBC was happy to oblige. My two friends ordered the portabella sandwich, which I had a bite of and I have to say it was delicious! Marinated chopped portabella mushrooms, melted cheese, some kind of sweet fruit spread. I wish I'd ordered it! I had a glass of riesling (which was fairly expensive for the quality) and a bowl of chicken noodle soup. I was hoping for a nice homemade soup with fat noodles and pieces of chicken, but what I got was a crock of bright yellow soup that I know came from a Mrs. Grass box. I will continue to come and try more of TBC's offerings, but definitely not the soups...",
                "reviewer_id": "DJbX0XH6Kn3Nm5uo58lu9A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4194737260796661,
                    "positive_probability": 0.5805262739203406
                },
                "stars": 3
            },
            {
                "review": "This is one of the best restaurants in town for an informal - but high quality meal. I prefer dinner to lunch though.",
                "reviewer_id": "dnnnUEuN_ouU0oKY-g2BjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08641835212057994,
                    "positive_probability": 0.9135816478794205
                },
                "stars": 5
            },
            {
                "review": "The sandwiches are great. The soup is ok, too salty sometimes. Nice atmosphere.  I've been there three times or more during the 5 months I spend in Champaign-Urbana. Most part of the time they were playing Brazilian songs, which made me fall for this place immediately.",
                "reviewer_id": "EHjTG90Kfbek7VczimrpHA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6752570454510731,
                    "positive_probability": 0.32474295454892904
                },
                "stars": 4
            },
            {
                "review": "Good food. Nice atmosphere and good for a date night. Ordered the pepperoni pizza and it was tasty with lovely cheese and herbs on it. My gf ordered a cheese fondue and she liked it. Not too pricey for the up class atmosphere right next to camous",
                "reviewer_id": "EM3qgcLfUzPU2boJIL77eQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06493336936489787,
                    "positive_probability": 0.9350666306350993
                },
                "stars": 4
            },
            {
                "review": "I've eaten here twice for dinner over the last five years and was very pleased on both occasions.  We had pizzas both times.  They are wonderful!   They very much resemble the style we've had in Rome: very thin, crisp crust, light on the creative toppings. The portobello, artichoke, roasted peppers and fontina one was especially memorable.  Service was very good - prompt, friendly and quick.  Our waitresses were very pleasant.  The prices may seem a little high, so if you want a cheap thick crust gloppy stuffed pizza, go elsewhere.",
                "reviewer_id": "eZ6ZJJIX5pi8svkt7cJGWg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.055437067922443725,
                    "positive_probability": 0.9445629320775616
                },
                "stars": 4
            },
            {
                "review": "Restaurant reviewAfter 1 year of living in Champaign, I finally had a chance to come to this restaurant recommended my a previous coworker. The reviews on Yelp are quite mix and it appears that lunch is good, but dinner is so so. Since I have not found another restaurant that has chocolate fondue here in Central IL, we decided to come here for dinner. I will say that I really wanted to like this restaurant, but overall value is a 2 star, the option for fondue brings it up to a 2.5. It is located right on campus and I never even knew about this restaurant when I lived nearby. The ambiance is very eclectic, lots of wall decorations and a European cafe feel. The multiple non-matching chairs throughout the dining room maybe a \"modern\" design, but I felt it was very \"chintzy\". I thought about going with the filet or fish entree, but the other reviews made me a little concern so I went with a safe dish (Shrimp fettuccine) with a light tomato basil cream sauce. It took a bit of time for the dish to come out. Meanwhile, we were given complimentary french bread. Given the name of the restaurant I was a bit disappointed that the bread was not a soft piping hot bread from the oven. Well I digress, back to the entree, it really wasn't anything special. My wife's quote on her salmon salad and the pasta was, \"It taste like food you can make at home\". The portions sizes were also smaller than expected when you order pasta at a restaurant. I was hoping that the chocolate fondue would be the redeeming value of the meal. Unfortunately this was not the case. Typically you would expect strawberries and maybe even a rice crispy treat to dip in the chocolate. Don't get me wrong the dark chocolate was amazing, but they gave a plate of pears, green and red apples, and some sort of cake that crumbled when you poked at it too hard with the fondue fork. Service is hit or miss, our server came by a few times and made sure our cups of water were filled. This maybe a great place for date night on campus or maybe for sandwiches at lunch, but my dinner experience was so so.Pros: Cheese and chocolate fondue, I have yet to find another place that has this option. Great for date night with wine, cheese, bread etc. Cons: Expensive based on what you get, small portion size, no hot fresh bread from the bread company for dinner, where are the strawberries, marshmallow, or rice krispy treats with the chocolate fondue? I think if they tried they could make this a stellar restaurant here in CU.Hidden deals: Daily drink and food specials on the chalk boardHealth code rating: A. http://champaign.il.gegov.com/champaign/estab.cfm?facilityID=2000",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.6465716405687614e-05,
                    "positive_probability": 0.9999835342836059
                },
                "stars": 2
            },
            {
                "review": "The new vegan menu at the Bread Co. is delicious. The linguine is especially hearty and chock full of veggies. The carrot cake was delicious as well.",
                "reviewer_id": "f3rrlHfL_tq83wi3b8cgXA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6091508555173265,
                    "positive_probability": 0.39084914448267466
                },
                "stars": 4
            },
            {
                "review": "The food is excellent and the bread is the best in Urbana. Dinner is delightful with excellent gourmet pizzas, fondu, tapas, etc. On Sunday, they have an excellent and low priced brunch. The dinner prices are reasonable for the quality of the food. Their sangria is also the best I've ever tasted. The only thing keeping me from giving them 5 stars is the service which at times is very slow.",
                "reviewer_id": "f8whKgtvAF6NOExa-D0nuQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01007841581748467,
                    "positive_probability": 0.9899215841825146
                },
                "stars": 4
            },
            {
                "review": "The food here was delicious! I had the shrimp fettuccine and it was made perfectly and tasted great. I was on a date here and the setting was perfect. My only complaint would be the service because we waited over an hour for our food. Everything else was great though and I would definitely go back!",
                "reviewer_id": "FUn3UiMV7OO_tOUAKYcxZA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1243326329990743,
                    "positive_probability": 0.8756673670009301
                },
                "stars": 4
            },
            {
                "review": "I've been here a few times for dinner and have always loved my meal. Great appetizers, fondue, salads, pizza, etc. It is a little pricey but well worth it. I love coming here with my friends or parents for a nice dinner while still being on campus. They also have brunch on Sunday which has a limited menu but still great delicious options.",
                "reviewer_id": "Fz4fcDEnniI1tdrodZJbSQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07125301579260117,
                    "positive_probability": 0.9287469842074021
                },
                "stars": 5
            },
            {
                "review": "Food good, expensive for portions. Tuna good but small potion - thought it was the salad. Lemonade fair at $5 a glass. Fairly small thin pizza $13. Don't think I'll be back soon.",
                "reviewer_id": "fZDbBvBWzVcpzZYwkalymw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.855302479572136,
                    "positive_probability": 0.14469752042786355
                },
                "stars": 2
            },
            {
                "review": "terrible service. the brunch fondue looked intriguing so we asked the waiter about the serving size. the menu claimed it'd accomodate 2 people but we wanted to make sure. the waiter said, 'you can add some vegetables and it should be ok.' so we agreed to that.he rarely came back out to help us the entire time. then when we got the bill, he charged us for *2* fondues. i went in and disputed the charge and he finally credited us for one of them. however, after keeping track of the credit card statement, it appears that he never refunded the fondues.this is still in dispute and i want to make sure you no one makes the mistake of going here.ps - panera's food is better than this and i don't even like panera.",
                "reviewer_id": "gbxWeKTC7vzLA7i-cAPp8w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.968625016032737,
                    "positive_probability": 0.03137498396726611
                },
                "stars": 1
            },
            {
                "review": "Bread Company has a selection of great ingredients that results in good food, but the service is terribly inconsistent. I have a bunch of stories about this, but here's the two that contrast most significantly: (1) When I came for afternoon drinks with my writing group, it was quiet and we received great, not-too-hands-on service: a nice mixture of noticing when we might want more drinks and letting us alone.(2) A few weeks ago, my husband and I went with a party of 6 for dinner 1 1/2 hours before a show, told them our schedule, and were assured that we should have plenty of time. Cool -- except that the whole thing turned out to be kind of a disaster. We all ordered at the same time, and there seemed to be plenty of servers for a full room at dinner, but our meals arrived over the course of a half-hour (the pasta came after the steak, hmm). Fresh and tasty dinners, yes, but it was impossible to wait and eat together, and everyone was antsy due to the delays. In the end, we finished 20 minutes after our preferred time and our waitress did not seem particularly motivated to help the situation along or even really apologize.So: Good food, decent wine, but the service is a gamble. Try it, but go on a quiet weeknight -- definitely not for a Krannert opening or right before another occasion.",
                "reviewer_id": "Gf5qn5rWqU7UV5EH0e0-8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0007147431837627264,
                    "positive_probability": 0.9992852568162307
                },
                "stars": 3
            },
            {
                "review": "Food is very solid. Although many other reviews have had a problem with service. I have been there dozens of times for lunch and dinner and never been disappointed. It's a family type place so don't expect the service to be like that in a chain restaurant.If you want solid food with a continental flair can't go wrong here",
                "reviewer_id": "GjROMxDbFnl3SSt4VAHM7g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5289835182674691,
                    "positive_probability": 0.4710164817325302
                },
                "stars": 5
            },
            {
                "review": "The Bread Company is a restaurant with many different faces. By day they have a varieties of soups and sandwiches, as well as baked goods. Sandwiches are on luscious slices of thick bread and the soups come with crunchy salads. I especially like the grilled sandwiches, which are laced with creamy butter and lightly browned meat. Portions are quite large and one sandwich could probably be shared easily among two adults. Sometimes I forget this and end up making two meals out of one sandwich.During lunch hours this place is quite crowded, but by late afternoon it becomes serene. Soft green light floods in from the skylight and during the winter you can sit the fire with a baguette and a glass of wine.  As regards to the review that mentioned rudeness about adding protein to things, I've heard that happen many times during lunch and now they let you have your meat, but charge a lot for it. They have this bizarre policy because they \"don't want people making their own sandwiches with the bread that comes with the entree.\" Nice one. At night it becomes more formal, with candlelight, fondue, and more upscale entrees. The balsamic potatoes that come with the entrees are perfect. I like the fondue, but it's a little too much for me...even the small pot can be shared by two. Last time I was there I tried the tapas and the yellowfin tuna and the lamb were delicious, but I was less than enthusiastic about the duck mousse, which had a bland sickly sweet flavor. The greens that came with the tapas were also pretty inexcusable. When I go to a good restaurant I expect more than just some shredded romaine, especially when field greens are still in season. The new small desserts are also not so great. The chocolate mousse was good, but the bread pudding was just some bread soaked in eggs and sugar.",
                "reviewer_id": "HqaXK9toBpQdcz-0-rVwKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.643608531643139e-05,
                    "positive_probability": 0.999943563914698
                },
                "stars": 3
            },
            {
                "review": "Wow. I wouldn't be surprised if this became one of my favorite lunch spots on campus. I went today and really liked it. I got one of their grilled sandwiches: turkey pesto, and it came with gruyere cheese and grilled red onions... delicious. It's not extremely cheap: I paid around $7.50 (but the cold sandwiches go for $5.50 or so), so there definitely are cheaper options to eat around there, but the food is good so it's worth it in my opinion. On top of that, I like the place and the atmosphere. They also sell bread (as you might guess!), and have wine by the glass. I can't wait to check it out for dinner.",
                "reviewer_id": "igrgFZl9wDohSem0UyoP6A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9551174161122112,
                    "positive_probability": 0.044882583887797034
                },
                "stars": 5
            },
            {
                "review": "For lunch, I really like this place. Fresh salads, sandwiches are tasty, and the bread is great. I haven't been here for dinner but this is a great place to go if you want to have a nice lunch on campus.",
                "reviewer_id": "IIRBF6_xbWYPbP_mjGI8RA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.525156528148042,
                    "positive_probability": 0.4748434718519603
                },
                "stars": 4
            },
            {
                "review": "The Bread Company was awesome ! Incredible owner, Lindsay, incredible service - we dined there 2x during a short graduation weekend, loved the hospitality, service and food! Ambience is intimate and neatly done, probably one of the best in Urbana, which boasts of a lot of places!! Keep it up! Surely a place to visit for all students and families....",
                "reviewer_id": "IJzKIEPNGNeptxcQ56rLlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001093307320418049,
                    "positive_probability": 0.9989066926795861
                },
                "stars": 5
            },
            {
                "review": "I like this place but sometimes it can be a little too hectic and chaotic in there.  The food is good but doesn't really have much soul to it usually and I tend to find it a bit bland.  The service, depending on when you go can either be really great or absolutely terrible.As an upscale place to bring visitors-- this is great!  As a place for great coffee-- definitely not a bad choice!  As a place to go regularly?  Not so much.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.017928852700515852,
                    "positive_probability": 0.9820711472994889
                },
                "stars": 3
            },
            {
                "review": "Excellent food, nice atmosphere.  They seem to have upped their menu in the last year, which is fine although makes for a higher bill at the end.  I'm usually happy to bring the kids along... the place has a very euro-bistro feeling.A minor gripe, however, is that the last few times we've gone the service has been less than stellar.  It seems they like to hire hip girls who aren't so interested in helping a family have a nice meal.",
                "reviewer_id": "IvBXSiwg1hpS11J6zxu4sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008473877506907009,
                    "positive_probability": 0.9915261224930947
                },
                "stars": 4
            },
            {
                "review": "They have a nice selection of hot and iced teas to choose from. Sandwiches come with a small side salad that is superb. Out of everything I've tried, the paninis are the way to go. I've yet to be disappointed.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20725401871960883,
                    "positive_probability": 0.792745981280389
                },
                "stars": 4
            },
            {
                "review": "I love this place.  I've gone to U of I for four years now and regularly frequent this place.  The sandwiches are always made fresh with great ingredients.  I highly recommend it.  As for dinner, it's a little overpriced, but the bakery/lunch menu is the best you can find in the city.",
                "reviewer_id": "mlxwcI_dMNzdwwYzjADn-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02104179143819037,
                    "positive_probability": 0.9789582085618074
                },
                "stars": 5
            },
            {
                "review": "Every time I stop in, whether it is for brunch, lunch, dinner, or buying bread, I always have a positive experience.The ambiance of the restaurant is very cute, cozy, and romantic. I've been trying something new whenever I go in and I haven't been disappointed since. Definitely a hidden gem in Urbana.",
                "reviewer_id": "nB4_bFkVcmRR0zC_sPrutw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0055830377132134,
                    "positive_probability": 0.9944169622867869
                },
                "stars": 5
            },
            {
                "review": "If all of the profs on campus hide out in a certain place, you know it has to be good.  I always hear mixed reviews about this place from my friends, but I'm going to go ahead and give it a 4.  This is my new favorite lunch place on campus (for when you have time).  The sandwiches may be $1-2 more but are killer compared to other on-campus options.  The grilled sandwiches may be a little buttery on the crust for some, but it's perfect for me.  Last time that I went I got the grilled turkey sandwich which comes with caramelized onions and cheese.Dinner options include fondue and pretty good pizza.  They also have some good bottles of wine on the list, I've ordered a bottle twice and been happy with what I got.  You might have to talk to one of the chefs if you want wine opinions since our server didn't seem to know much.Really good atmosphere and decor, it's casual/fancy enough for pretty much anything, and it's right next to Krannert if you need an after-show dinner.",
                "reviewer_id": "nmh7Z99urzgy2xmh9v_pYA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9992982316247934,
                    "positive_probability": 0.0007017683752057339
                },
                "stars": 4
            },
            {
                "review": "My husband and I, along with two other couples, decided to celebrate the end of the semester tonight by going out.  After *much* debate, we ended up at The Bread Company.  As a former music major, this was one of my usual haunts, but the rest of them hadn' t been there quite as frequently.  (Lunch, by the way, is excellent; they have excellent sandwiches and salads).The specialty, of course, is the fondue, which is magnifique.  My only gripe is that portion sizes tend to vary widely from time to time, as does the selection of vegetables that comes with your meal.  The combination of cheeses, though, is great, and the bread and potatoes are wonderful.Tonight, though, I had one of their specials, which was good, but was actually my *third* choice of menu items.  They were out of the fettucine with salmon AND out of the chicken pizza.  Now, I don't pretend to understand the inner workings of the restaurant business, but it really irritates me when they run out of something.  To me, that just smacks of poor planning.  Do they not have a kitchen?  Can they not make more?  If not, then can they not provide accurate estimates of how much of each food item to make, so they won't run out?  I don't know, but it just seems like when you go someplace, you should be able to look at the menu with confidence.Anyway, the beef fondue I had was very good, and one of my dinner companions adored her trout.  She said it was the most moist fish she had eaten in quite some time, and she is a fish lover.  Her husband, a reasonably picky eater, devoured his pancetta pizza with no complaints, as did another friend with his salmon.  I thought the portion sizes of some of the meals were pretty small, especially given the price.  Still, it's good food, and worth the money, especially when you consider it's not that expensive.  Service was pretty good, although a little slow, particularly since they weren't that busy tonight.  My guess is she just had a hard day.We love the Bread Company and will continue to visit, but probably just for the fondue.  We know they'll have it, and we know it's good.  Thanks for a fun evening!",
                "reviewer_id": "NtmiVAP4zoM8Kx8_8SNgMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.864139177644079e-06,
                    "positive_probability": 0.9999931358608033
                },
                "stars": 4
            },
            {
                "review": "Went here for lunch during the week (while school was in-session). Busy, but not overly so. Seats were a little uncomfortable and not super baby-friendly (no room for strollers, not sure they had highchairs). Food was excellent and great portions. Everything's a la carte, so if you want something on the side, make sure to ask/buy it. Great alternative to other sandwich options around campus and not too expensive. Probably gets busiest around breaks in school day.",
                "reviewer_id": "nuDluohucnGMT2K0Id8jYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4359354328135507,
                    "positive_probability": 0.564064567186452
                },
                "stars": 4
            },
            {
                "review": "Can't get your burger rare...they weren't sure about the meat today.  Staff was so quick to clean our table they took food we weren't finished with twice!  Couldn't get the waitresses attention to pay our bill.  Salmon salad was great..shrimp pasta fab..why no grated cheese or ground pepper?",
                "reviewer_id": "oelr9kFIotxG19Wv63xPyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31726963048729523,
                    "positive_probability": 0.682730369512708
                },
                "stars": 3
            },
            {
                "review": "Our family dined here after my sister's graduation. It was nice of them to move our reservation up on such short notice but after eating here, I understood why this wasn't a problem.If you're called \"The Bread Company\" you probably shouldn't serve burnt bread. The crust of our Italian bread was burnt. Though the bread was good otherwise, leaving a charred taste in your patrons' mouths is not the best way to start a meal.When my sister made the reservation they did not inform her that there wouldn't be a full menu that day. So though we looked at the menu online beforehand, we were only able to order from their limited graduation-day menu.There were seven of us and we ordered vegetarian dishes. Three of us had the grilled portobello sandwich with raspberry aioli and brie ($10), which was served with a side of salad greens and roasted potatoes. The presentation and portion-size were perfect. The mushrooms were fresh and juicy and the raspberry aioli went well with the brie. Those who ordered this plate seemed satsified.The other four of us split two pizzas: the roasted garlic with san marzano tomato sauce and Parmesan ($12), and the pesto with portabella, artichoke hearts and brie ($15). The reason we split them? Our waitress said they were 10 inch pizzas. They were actually smaller, about 6-7 inches in diameter. Now I usually love a cracker-thin crust, but ours was burnt in places. The roasted garlic pizza was at best a decent cheese pizza and the pesto with portabella and artichoke hearts did not benefit from the addition of brie; though it added texture, the brie did little to compliment the flavors of the other ingredients on the pizza. Overall the ingredients seemed fresh, but I've had much better thin crust pizza for less money, and more of it too. Though the restaurant seemed full, the same people were dining the whole time we were there. Only one party arrived while we were dining. It's a small place and there only seemed to be a server or two but seeing as it wasn't really busy, you'd think service would be more attentive. Our waitress was not. She was pleasant. She refilled our waters once and brought another basket of (still burnt) bread upon request. We were not asked if we wanted drinks or dessert. And we waited for our check for about twenty minutes. Turns out she went on lunch and took our check with her. We didn't gyp her on the tip at all--seeing as it's a college-town and they were probably short-staffed on graduation weekend, and we weren't running late for anything--but we certainly won't be dining here again. Side note: they do not accept Discover.Taking everything into consideration, I'd give this place a C+. I'm sure there are better white-cloth restaurants in Champaign-Urbana and you'd be better off eating there.",
                "reviewer_id": "OhcLMQF-jb_Wq2HD91Lv2g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.1961277814907155e-08,
                    "positive_probability": 0.9999999480387047
                },
                "stars": 2
            },
            {
                "review": "The bread company is perfect for lunch. The prices are reasonable, the atmosphere is great, and the food is delicious. I haven't tried it for dinner but I heard good things. Definitely go!",
                "reviewer_id": "Q_sDeVjJvMoQ5vdafAe0jA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06468572712546777,
                    "positive_probability": 0.9353142728745336
                },
                "stars": 4
            },
            {
                "review": "Came here for brunch with my mom and brother... As big water drinkers, we were really appreciative of how on it our waitress was about making sure we had a full pitcher on the table at all times. We ordered 2 omelettes and crepes. The cheese in the crepes wasn't completed melted in a small part that didn't seem to have gotten enough heat. However, the food was still really good and well priced for what it was. The hollandaise sauce was thick and had the tiniest bit of spice in it. So yummy!  I would definitely recommend this place if you're looking for a good on campus brunch. I'll for sure be back!",
                "reviewer_id": "qXiN4Gi9N0FOeQYoeiWU8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2882781843140156,
                    "positive_probability": 0.7117218156859795
                },
                "stars": 4
            },
            {
                "review": "If you get anything besides the fondue you're making a mistake. If you're planning on making a stop do 3 courses of fondue. Your wallet won't be happy, but your taste buds can thank you later. The good: fondue, bread, location, atmosphere The bad: anything besides the fondue is very hit or miss (hence 3 stars), I wish they'd expand on their Swiss heritage",
                "reviewer_id": "rA3yPo9y-nxEMgx58m9vLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015522652800670748,
                    "positive_probability": 0.9844773471993271
                },
                "stars": 3
            },
            {
                "review": "Food is ok, not a big fan but I know my friends like it a ton. Grilled cheese is pretty decent!",
                "reviewer_id": "rgjdVmK5nYVOxrK6YeQJNQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7471656354093285,
                    "positive_probability": 0.2528343645906724
                },
                "stars": 3
            },
            {
                "review": "This is a real gem.  Probably the most consistently good food in CU.  Lunch brings nice grilled or deli-type sandwiches, and there are veg options.  Dinner is much more interesting with pastas, nice fish and meat entree specials, and wonderful thin crust pizzas, baked in hot ovens.  Desserts are also very good.  I am less into fondue (exceot for chocolate dessert fondue), but this is the place to go for that.  The ambiance is eclectic and European.  Families will feel welcome.  Service can be a little ragged, sometimes a student group of 15 or large party will materialize, and that can have a rather deleterious effect on service when there are only 2 servers on the floor, which is often the case at night.  Even so, I have never had a meal here that was less than very good, and many that were excellent.",
                "reviewer_id": "S3dhPGW9PJfK6ZuQoJhKfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011834022523449395,
                    "positive_probability": 0.9881659774765528
                },
                "stars": 5
            },
            {
                "review": "If it's raining, and you're on campus, Bread Co. is the best place ever o eat a pretentious sandwich while watching the precipitation assault the pavement from the safety of your cozy table.The sandwiches are top-notch, and filling.  I've had the turkey pesto, and the portobello.  Both are delicious.  Double frosted brownies make you hate your lack of will power, but are suitably delicious as well.  Service is a bit aloof, but reliable.  Like all other elitist jerks out there, look for me savoring my expensive sandwich while reading a pretentious theorist.  I've got street cred to maintain.",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9658669503377094,
                    "positive_probability": 0.03413304966229941
                },
                "stars": 4
            },
            {
                "review": "I've been to the Bread Company at least 6 times over the past three years all separated by months. The only reason I continue to go back has got to be because I forget about how sub-standard their food is. And today I decided to finally put my disappointment on the internet.This review was spurred by a visit today to get coffee and a pastry. I ordered an americano that was obviously made with poor quality espresso, and perhaps by someone with little knowledge of what an americano should be. It was too watery, but maybe that is my taste. I also had what they dared to call a chocolate croissant. It could have been made days ago. Instead of being light and fluffy, it was dense and doughy and filled with chocolate chips that were never fully melted so they maintained their chip structure. I was less than impressed. But this seems to be the way things go at the Bread Company.As I mentioned earlier, I have been going to the Bread Company for quite a few years (having been at the U of I as a student since 2008), and their menu has yet to change. At all. This sort of stagnancy is worrisome and really speaks to the lack of effort that the chef and/or owner put into this business.On a recent dinner visit I got the chocolate fondue which came with possibly pre-made cinnamon bread slices, strawberries, and a plethora of apples and pears. I suppose the apples and pears were in season (it was November when I went), but I don't see how apples work with chocolate. I've had their pizza many times, and I cannot deny that they do a good crust...but I just don't get the pizza that comes with a mountain of salad on top. It is just too much and overwhelms the pizza that really should be the star of the dish.Overall the Bread Company is uninspired and very tired. This is reflected in their dusty, unchanging interior, their menus, and the often impolite, lackluster performances of the staff.",
                "reviewer_id": "U087oZu9ntsHVS75qOM4xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.024422787759842395,
                    "positive_probability": 0.9755772122401668
                },
                "stars": 1
            },
            {
                "review": "This was our first time eating together at The Bread Company.  The service was good and they seated us immediately even though we did not have a reservation.  The bread was good and the fried goat cheese appetizer was tasty.  Our server was friendly and we received all of our food in a timely manner.  The food was fine;  I ordered the lamb and he ordered the seared tuna.  It was good but I wasn't blown away.",
                "reviewer_id": "Ujrg8-TO4r55Yh8QkC0DEQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49803172283732144,
                    "positive_probability": 0.5019682771626749
                },
                "stars": 3
            },
            {
                "review": "I've been to The Bread Company several times now, and left disappointed most of those times. Their food isn't horrible or anything (except for their gazpacho, which is by far the worst I've had), but it's definitely overpriced and bland. The only item on their menu that's worth mention is the grilled roast beef sandwich ($9.50 after tax) -- fried roast beef cold cuts, sauteed onions, and gruyere cheese. Just about anything else I've had there, including their soups, was just bland and cost waaaaay more than it should. Also, their pesto tastes nothing like basil, more like parsley puree - I definitely don't recommend getting anything that has it. Finally, you'd think that a restaurant named the Bread Company would have good bread on their sandwiches...",
                "reviewer_id": "UO5eCeTNpnUekttaryBCNw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9997813670828528,
                    "positive_probability": 0.00021863291714192357
                },
                "stars": 2
            },
            {
                "review": "This is by far the best pizza place in CU approved by my Italian spouse. They have the nice crust and pretty good quality authetic topics (cheeses and so on). If horrific deep dish American pizza is your thing, don't bother going here.",
                "reviewer_id": "vCh812goLfIoFxtUVoyXJg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.353634177189036,
                    "positive_probability": 0.6463658228109677
                },
                "stars": 4
            },
            {
                "review": "When you are asked if you want mustard or mayo, and respond, \"mustard please, no mayo,\" what do you think you'll get?  Well, I got a large helping of mayo and no mustard to speak of. I think it would have been a good sandwich. It didn't even come with a napkin, so once I realized this error, I couldn't get a lot of the mayo off. Ick.",
                "reviewer_id": "veXxi5rrUt6Vga_4lTHFQA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9546886980932107,
                    "positive_probability": 0.045311301906788407
                },
                "stars": 2
            },
            {
                "review": "Lovely experience here tonight! Service was wonderful and was complimented by getting to meet the owner, Lindsey. She and her husband took it over from his family recently (not exactly sure when) to continue the family tradition. Food was tasty - I had pesto pasta and husband had garlic pizza plus a French onion soup and bruschetta. Atmosphere was quite nice on the patio and we enjoyed a delicious bottle of wine that was reasonably priced. We had the privilege of talking with Lindsay further and learning about their takeover after getting a summary from the menus which include an overview on key individuals in the history of Bread company, including Lindsay and the original owner, her mother in law.",
                "reviewer_id": "vf6bsKOrWNDhxk3uIQHDIg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0003419947096330723,
                    "positive_probability": 0.9996580052903599
                },
                "stars": 5
            },
            {
                "review": "My review was filtered and I guess this one will be, too. This place has terrible, some of the worst - in a town filled with bad service, I've ever had. And the food is not good. Look at all the filtered reviews before eating here.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8176996826543219,
                    "positive_probability": 0.18230031734567914
                },
                "stars": 1
            },
            {
                "review": "Fondue dinner at the Bread Company is probably the top restaurant experience I miss from Urbana, IL (caveat: this review is a bit out of date). At the time you could get a very decent swiss cheese fondue with good bread, some roasted garlic for an appetizer, and two glasses of house red for just over $30--a princely sum for a starving college student, but compared with the trendy $100 fondue restaurants in the SF Bay Area, a steal. The dinnertime atmosphere was also great: quiet, romantic, dimly but warmly lit.They also had fantastic checkerboard shortbread cookies. I've been hard pressed to find better anywhere else.Lunch sandwiches and other baked goods were both decent, but the five stars are for the fondue date memories.",
                "reviewer_id": "VKbKhCCt7lAwxpS0nJLZMQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02828279056548393,
                    "positive_probability": 0.971717209434522
                },
                "stars": 5
            },
            {
                "review": "Went here once, in 2007, on a first date with a hot chick I met while in college. Almost six years later...she's my wife. Yea, guess I'd say that's enough for 5 stars. Thanks Bread Company *brofist*Do I remember much about the food?...No. The only thing I remember was feeling underwhelmed by the bread. I mean, if the place is called \"Bread Company\" I expect the bread to be something special, you know what I mean? Whatever, I guess by now I'm over it.Bottom line: took my crush here on a first date, ended up getting a second date...a third...and yea, eventually I even got laid. Thumbs up, would recommend.",
                "reviewer_id": "W4frBtslWUgoGdjwhKZb2A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31737625037112166,
                    "positive_probability": 0.682623749628882
                },
                "stars": 5
            },
            {
                "review": "The Bread Company had excellent food. The fried goat cheese was delicious. However, the service was very poor. It was, by far, the worst restaurant service I have ever experienced. It was a shame because the restaurant has such great potential because the food was great...but the service was so bad that I never want to come ever again. The waitress I had was unfriendly. It was really weird -- it didn't even seem like she was attempting to be nice. Also, I spent 2x the amount of time I should have been there waiting for my bill and for the waitress to take my order. Basically, if you have a lot of time on your hands and you don't mind awful service, this is a great place to get food. However, if you have any standards for customer service, don't bother.",
                "reviewer_id": "XdlBjKW-leAJ_Ui31sFVHA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.974423906170396,
                    "positive_probability": 0.025576093829596507
                },
                "stars": 2
            },
            {
                "review": "Look, I'm not fussy. I'm not mean.  I'm not demanding.  I just want a glass of wine and some food.  I'm even willing to just order off the board when the waitress can't figure out that four people need more than one menu. I really wish I could discuss the food, but the service is so bad that I can't remember what I had to eat.  In case the staff reads yelp in between listening to the Smiths all day and wondering why they aren't famous artists yet, here are some tips:1.  Bring menus for everyone2.  Do not walk away if only three people have ordered and there are four people at the table.3. Do not roll your eyes, kid. 4. Do not pretend that you are a really good waitress who can remember everything.  You have to write it down because when you don't write it down you will end up bringing me the wrong thing.  5.  Do not forget to take empty plates off the rickety, unclean table because otherwise there is nowhere to put down the food. It's ok the first time you bring it because the order is wrong and you have to take it back.  (See number 3) 6.  Do not let our wine glasses get empty. We live in the midwest too. We hate it here too. We need more wine.",
                "reviewer_id": "YbURfQVvk9cTMR009baOiQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7920183171167323,
                    "positive_probability": 0.20798168288326155
                },
                "stars": 2
            },
            {
                "review": "I've been to The Bread Company several times now; both with my visiting family for dinner and for sandwiches for lunch, and my experiences have been positive. First of all, the atmosphere is incredible. I've spent a lot of my life in Europe, and the way this place looks reminds me of little mom-and-pap restaurants one would find in the Mediterranean. This feeling is especially strong in the terrace in the back; stepping into that room feels like stepping into Spain. It's a bizarre, nostalgic experience for me, and one that hasn't happened quite as strongly anywhere else in the United States. The lunch is incredible. I like to think of myself as a bit of a sandwich connoisseur (hold your laughter), and the grilled sandwiches here are amazing. The dinner, unfortunately, isn't up to par with their lunch service. The only dish fresh enough in my memory to comment on is the shrimp linguine, which was a little bland. I haven't been able to try the fondue yet, which seems to be the go-to dish here, so I'll be trying that next time I go.Service is lovely, and their handmade drinks are very good too. Strongly recommended.",
                "reviewer_id": "YLFqekWEU7vIvs4sdyR3_A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008282897814031116,
                    "positive_probability": 0.9917171021859709
                },
                "stars": 4
            },
            {
                "review": "The bread co is owned by a Swiss family, their children own Cafe Luna in Champaign, also worth a visit. I love coming here to relax and talk with my mom when we make lunch dates. I celebrated special occasions here as well growing up. They sure knew how to accommodate a large group of 14 year old girls on my birthday years ago!Recommendations-Roast beef sandwich-Portabella, brie, and raspberry jam sandwich-Zpfe bread, it's comparable to challah bread.-Cheese fondue - beautiful beautiful gruyere fondue. As good as Switzerland-Meat fondue - the broth is lovely, it's served with three different sauces and fresh baguette.-Chocolate fondue - Melted swiss chocolate, fresh fruit in season, cookies, pound cake.I love this place. It is one of my favorites.",
                "reviewer_id": "YoPW8tMhI5qFogajExJZXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11267191084404053,
                    "positive_probability": 0.8873280891559522
                },
                "stars": 5
            },
            {
                "review": "When I went to school at U of I, I came here all the time during lunch to grab a roast beef or ham sandwich on their freshly baked swiss bread. Sometimes I went for the half soup/half sandwich, or half salad/half sandwich to get more variety in my diet. The food here is like comfort food for me, since I grew up in Urbana and my mother used to buy these sandwiches and their large loaves of freshly baked Zpfe for my brothers and me. The service at The Bread Company has always been fast and efficient, and the employees were always very cool and made no mistakes taking my order and making me a really good sandwich. I've been here a few times for dinner with my friends. The atmosphere totally changes in the evening for dinner, as they lay out white tablecloths, dim the lights and allow the romantic glow of candles set the mood. Their pizza is delicious and filling, and their tapas come in pretty big portions. This is a cute and cozy place for anyone on a date or double date, or out to celebrate a special occasion.I've ordered take out from them a few times when I've had last minute dinner party pot lucks to attend and didn't have time to cook. One time, I picked up a strawberry walnut mixed green salad, which was perfect, and also a french baguette with a side of baked garlic bulbs drizzled with olive oil. It was worth every dollar.I love this place!",
                "reviewer_id": "yPaFdptE57YAwwDBnojJCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.264227834284998e-05,
                    "positive_probability": 0.9999673577216455
                },
                "stars": 5
            },
            {
                "review": "One of my earliest experiences in Cham-bana, the very second night I spent with my boyfriend, now husband, he actually walked across the street from his dorm and brought me a ham and swiss on rye.  Now, I wasn't a huge fan of ham, and I truly hated swiss, and about all he knew was that I liked mustard (so he included it), but... being that we were so new together, I ate that sandwich like it was a long lost favorite.And shocking... instead of having to choke it down... I loved the thing!  Later in life, when I explained to him how much I hated ham and swiss sandwiches, I told him how amazed I was at how much I loved the one he'd been getting me from The Bread Company!!  Their ingredients, I mean!  Talk about fresh (I hate to sound like a commercial, but!  When it's true, it's true!!) The sprouts were genius, and the swiss was like none I'd ever had.  Ever!  Emmentaler. I mean, this place was no joke SMART about how it crafted food!  And there was no denying that rye!  The crown jewel of the whole thing!  Crunchy exterior, soft in all the right places, with a kick-yer-butt mustard... just out of this world spectacular.The whole thing became our ritual.  I'd come into town from Bloomy and we'd head over to Bread Company.  He'd get a loaf, hot out of the oven, of Challa, and I'd get my ham and cheese sandwich and we'd head back to his dorm.  Such bitter sweet memories.  And all over a sandwich!Trust me, this place makes some of the best fresh bread (I mean... HOT FROM THE OVEN GOOD), and some of the greatest food on campus.  They do more than sandwiches... OMG, go one night for the fondu!  It's an amazing experience!!  Whatever it is, find something you love and make it a memory to share.",
                "reviewer_id": "YtbXNQJEJAHZK_2DFXSa6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0018545616259527382,
                    "positive_probability": 0.9981454383740457
                },
                "stars": 5
            },
            {
                "review": "If you love real bread and unique food at great prices this is your place.  Try the prosciutto sandwich - amazing!  Best I've had outside of Italy.  Grab a loaf of bread to go before you head home!",
                "reviewer_id": "Z7hwjlnO-iL6JBNVTlZ_VA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16414742859656656,
                    "positive_probability": 0.8358525714034343
                },
                "stars": 5
            },
            {
                "review": "Stumbled upon this gem for a bite for brunch. It's a quaint Swiss bistro with some pretty spectacular food! Tried the \"Quiche of the Day\"-ham and gruyere quiche- it was DELISH!",
                "reviewer_id": "ZFYbO9oQtbIbkrMys1vw5g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27042051067811906,
                    "positive_probability": 0.7295794893218788
                },
                "stars": 5
            },
            {
                "review": "SO and I came here for our anniversary: The Good:-We arrived 5 minutes before our reservation and were welcomed and seated promptly.-Atmosphere was nice but not stuffy, eclectic collection of chairs gave it a more casual feel-Waitress was extremely friendly and treated us well, happily accommodated us-The Fried Goat Cheese with honey and strawberries was dreamy, so delicious. -Basil Tomato Fondue was delicious, \"it tastes like pizza\".-Chocolate fondue uses dark chocolate, which makes it rich and not too sweet-Portions were generous, especially with the goat cheese appetizer, there was so much goat cheese that we ran out of bread! Our waitress happily accommodated us and brought more warm bread.The Bad:-Nothing!Overall:Fantastic! Food and atmosphere was great! Would love to come again.",
                "reviewer_id": "ZjxfO0xvmxZ7BiNUg7ejjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018961092742541645,
                    "positive_probability": 0.9810389072574517
                },
                "stars": 5
            },
            {
                "review": "Everyone says the Bread Company sucks, but I don't agree.  The food is great, it's just their prices that suck.  I paid $9 for lunch there the other day.  I'd much rather have a $5 potbelly sandwich.  Dinner is good here, but overpriced IMO.",
                "reviewer_id": "zkRH-NOAdIjJjU2ASeXZ1g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5810263512339549,
                    "positive_probability": 0.41897364876604265
                },
                "stars": 4
            },
            {
                "review": "The Bread Company is a MUST whenever I visit Chambana. I discovered this place by accident while attending classes at UIUC and I've been in love with it ever since. For five bucks you get yourself a delicious breakfast sandwich along with a cup of coffee (free refills). Their zopf rolls are also amazing and under a $1. Speaking of the interior, no two chairs are the same, some are comfortable, others not so much, yet that's exactly what I like about this place...It's got character. The fire place is a nice addition in the winter.",
                "reviewer_id": "ZmSvebu673qVqmPbWTNMBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3201194419988491,
                    "positive_probability": 0.6798805580011523
                },
                "stars": 5
            },
            {
                "review": "Had a nice dinner with my wife for our anniversary. Wanted to go someplace off beat and quiet and we were very satisfied with The Brad Company. Our waitress was very well versed on the menu, and was happy to let us sample the wines so we can make a better choice. Serving portions are large and well priced for what you get. A pizza and appetizer is probably enough for two if you're wanting something light. The setting was nice and cafe-like, and the crowd small. There was no waiting at all, although they accepted a reservation for our occasion. I will definitely go back.",
                "reviewer_id": "zNucRve1MO1ka5IEGs9X5A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00939209208965416,
                    "positive_probability": 0.9906079079103497
                },
                "stars": 4
            },
            {
                "review": "I don't understand why the lunch and dinner here are so different.  Is there a different owner for each meal?  Lunch is self-service, no-frills sandwiches and soups.  In a word: plain.  Dinner is table service and can be good.  But they emphasize a gimmicky fondue service and the main dishes can be hit-and-miss.  The pizzas are solid.  Meat can be over or undercooked.  Order seafood... watch out!Why is it called the \"Bread Company\"?  They do appear to make their own bread, but it isn't that good.  Seems misleading.  Kind of like their \"specials\" list.  (It doesn't change.)",
                "reviewer_id": "zq815p7o2OM1kNHG8OdobA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3728630575839782,
                    "positive_probability": 0.6271369424160209
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "SeQv-RJ2rS070NvSRh_siQ",
            "sBw0ZgTVeRgdOA3sfGIcwQ",
            "YkKEsYsSpOkDBbHBGKuWQA",
            "uJczFcnoK8f9uWgtb0hFGw",
            "g5I1qNIGWTU3lizsneXQiw",
            "ey7-ihj-OjM4sEOwWTc06Q",
            "VlWL5QDNc0fFskZeougbhw",
            "uhzZM-WwNsaVuvGRjv3mXw",
            "JlcbIU8V6ohFCwfuMr7tBg",
            "2SycDjGWWpFs1ODL-YBoHA"
        ]
    },
    "g5I1qNIGWTU3lizsneXQiw": {
        "keywords": {
            "bigrams": [
                "pretty_good",
                "ice_cream",
                "good_food",
                "late_night",
                "long_time",
                "french_silk",
                "courier_cafe",
                "food_come",
                "top_eggs",
                "took_long"
            ],
            "unigrams": [
                "food",
                "good",
                "perkins",
                "service",
                "pretty",
                "waitress",
                "time",
                "don",
                "great",
                "place"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "no",
                "Caters": true,
                "Delivery": false,
                "Good For": {
                    "breakfast": true,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wi-Fi": "free"
            },
            "business_id": "g5I1qNIGWTU3lizsneXQiw",
            "categories": [
                "Bakeries",
                "Food",
                "Breakfast & Brunch",
                "American (Traditional)",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "1214 West University\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "00:00"
                }
            },
            "latitude": 40.1166376,
            "longitude": -88.2254343,
            "name": "Perkins Restaurant & Bakery",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/_N5NhnLQjtzIjnA4_NIqqQ/ms.jpg",
            "review_count": 39,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The food isn't great. We were waiting at the table for over 20 minutes before the waitress came to take our order. The food was really good, but the service wasn't great. ",
        "reviews": [
            {
                "review": "Great hangover or late night food. I could eat breakfast for every meal so I love all the omelettes, pancakes, bacon and hash browns. The waitresses that have served us have put up with everyone very well.",
                "reviewer_id": "-dxCgQoiYGroqmVV0b9llw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8833458828816294,
                    "positive_probability": 0.11665411711837173
                },
                "stars": 4
            },
            {
                "review": "We had Lunch there on a Sunday ,pretty busy .I say the food is ok not a wow but ok.The service was good and the place looked pretty clean .They got lots to pick from. We did wait a long time for are food.The prices are not to bad either .I will give them another try maybe for dinner.",
                "reviewer_id": "12oNZyecE29NUv9klQyvBg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9488043695653895,
                    "positive_probability": 0.05119563043460535
                },
                "stars": 3
            },
            {
                "review": "This has been a go-to spot for brunch for my family for years and years. It was also a great spot for us as teenagers when we wanted a late meal after hanging out. But this review is based on more recent visits. :-)It can get busy on Sundays after churches typically get out. But, for the most part, there is not a long wait. One one recent occasion I had brunch with my mom and a family friend. I ordered a salad. It was HUGE. I actually had to take half of it to go! On the second recent trip, we went out as a family for Mother's Day. No wait late in the afternoon. I ordered the banana blueberry pancakes. They were supposed to be multigrain, but learned that they had discontinued the multigrain batter the week before. :-(  But the waitress said that they could make them with regular batter. I was surprosed that the bananas were not baked in the pancake, rather they were sliced on top. Regardless, the pancakes were still good. They have sugar free syrup if that is your preference and it wasn't bad. They let me alter my order no problem. It was supposed to come with turkey sausage and egg whites. But I changed it to fruit and bacon. No extra charge.Speed of service and attentiveness dependent upon who you get and the time of day. But I haven't had a negative experience. Pay your tab at the front register, not at the table.",
                "reviewer_id": "2niwhUC9pAeHH_W29cl9Cg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05072215322214415,
                    "positive_probability": 0.9492778467778564
                },
                "stars": 4
            },
            {
                "review": "The service was pretty good here. The food has always tasted great to me. The place was clean and tidy , and they are open late and in walking distance from my apartment, which is pretty cool.",
                "reviewer_id": "44GzCA_7s9Xq3kzl2xD1TQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1296160281356521,
                    "positive_probability": 0.8703839718643489
                },
                "stars": 4
            },
            {
                "review": "The food was really good, but the service wasn't great. It took a long time to place my order, then I had to wait to eat because I didn't have silverware. I witnessed other tables having similar issues, so maybe it was just an off night.",
                "reviewer_id": "6kgAKfPTbRcseXTCgkG7eQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.43596312714987623,
                    "positive_probability": 0.5640368728501233
                },
                "stars": 3
            },
            {
                "review": "This review is for the banana cream pie we picked up to bring to a picnic today. We were pretty skeptical of going after seeing all the awful reviews but took a chance. My boyfriend and I miss the banana cream pie we used to pick up from Marie calendars in California and hoped this would be a similar substitute. The lady that rung me up was so friendly and reassured me the pie would be great. It turns out we had a hit item at the picnic we went to. Everyone kept talking about the pie as we were making our way through the savory main dishes. And boy did it disappear fast. The pie was just as delicious as Marie's. Still skeptical on dining in though...",
                "reviewer_id": "_EzI8bJVnZesQqsW0zZ5aQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.37512225569873914,
                    "positive_probability": 0.6248777443012545
                },
                "stars": 4
            },
            {
                "review": "I had a giant Raspberry Cream muffin in the morning with a piping hot cup of coffee.  What a great start to a good morning.  They serve \"mammoth muffins\" for around $2.30.  They had the typical kinds like Banana Nut, but also Cranberry Nut and Carrot, which I really wanted to try but I couldn't imagine that cream cheese frosting sitting too well at 8am.  Another time.Their muffins are big... I guess \"mammoth\" sized, but instead of an insanely gigantic muffin all I can picture is an adorable woolly mammoth.  Anyways, I thought the muffin was cream-filled, but it came with a mini scoop of butter on the side.  Not the same, and I didn't slab it on.  It tasted great the way it was.  With a cup of coffee my breakfast was within $5.By the way their pies and cookies are amazing, especially their FRENCH SILK pie.  All I've had here are their desserts and that is fine by me!",
                "reviewer_id": "B9rstUU8CVwZ8c-QlmQcrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.498899411570593,
                    "positive_probability": 0.5011005884294141
                },
                "stars": 3
            },
            {
                "review": "Oh man, I can't really choose between Perkins and IHOP because they are both equally BAD. Perkins was dark and depressing and the food was extremely oily. Ask yourself: Do you want to start your day with breakfast (or lunch or dinner for that matter) at this place?",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3262282262977158,
                    "positive_probability": 0.6737717737022838
                },
                "stars": 2
            },
            {
                "review": "They just don't know how to talk to people, service is absolutely horrible. Food is not great, but expensive. They're rude and don't care about you.",
                "reviewer_id": "DvEuYDvDsVz3zB1K4vh2-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3856169939461565,
                    "positive_probability": 0.6143830060538445
                },
                "stars": 1
            },
            {
                "review": "Nice decor,  good food and fast service, but the waiter was a little on the rough side for personality.",
                "reviewer_id": "enreTB85zV-NVZ30c-3-_A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3555305765954633,
                    "positive_probability": 0.6444694234045365
                },
                "stars": 3
            },
            {
                "review": "Went there again the other night. Looking more and more rundown and the floor was filthy.",
                "reviewer_id": "FFsuViuxEt6rvWPyTMo02Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8402735463112115,
                    "positive_probability": 0.1597264536887884
                },
                "stars": 2
            },
            {
                "review": "Good place to hang out after your evening shift, or bar closings.  Don't bother too much with anything other than breakfast, which is not the greatest, but consistent and filling.  In other words, fill the void and don't expect parsley or anchovies on your ceasar salad.",
                "reviewer_id": "HANb8-8InWnju-XzBQQSBw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7073159785203463,
                    "positive_probability": 0.29268402147965794
                },
                "stars": 3
            },
            {
                "review": "The food isn't great. But the never-ending pot of coffee and 24 hour schedule meant that I spent a ton of time here around finals. Just don't be a jerk: leave a fat tip after you've been sitting in someone's section all night studying. They'll appreciate it.",
                "reviewer_id": "iGC1lFvv6ZLyoNPFExwulg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2960807220843684,
                    "positive_probability": 0.7039192779156291
                },
                "stars": 3
            },
            {
                "review": "Bad service, super slow. Don't come here if you really wanna just get something to eat. 30 mins waiting, can't believe it. The server just drop the plates in my table, so rude!",
                "reviewer_id": "iPQfPjXYZRHTr80WN26EuQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6051638671593181,
                    "positive_probability": 0.39483613284068086
                },
                "stars": 1
            },
            {
                "review": "This place has pretty good food, especially for late at night. They have a $5.99 AYCE pancake option, and half off all appetizers at night. Prices are pretty competitive. Even their cheaper entree options (eggs in a hole) are moderately filling. Service wasn't superb, but not shoddy either. Definitely come here to take advantage of the prices.",
                "reviewer_id": "J8xQk0zNcQAm76XrThbEAQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9606628963234433,
                    "positive_probability": 0.039337103676558884
                },
                "stars": 4
            },
            {
                "review": "Good food and nice waitresses but there was a very rude woman working the register. I just asked about the muffins deal and she was so upset and rude. Never coming here again.",
                "reviewer_id": "KBsh9Y0qz9O9uaZqfkSG9Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05614796985505298,
                    "positive_probability": 0.9438520301449485
                },
                "stars": 1
            },
            {
                "review": "This place was only \"ok\".  Not downright bad, definitely not particularly good.I got an omelet with pepper jack cheese and the \"garden mix\" (green peppers, onions, and celery).  It came with homefries and 3 pancakes.  All for just under $9.  Not a bad price considering the ridiculous amount of food you get, but I don't really NEED that much food, and it wasn't very good food.The pancakes were pretty good; I had them with the wild berry sauce, since I can't stand that fake \"maple\" syrup that restaurants serve--so kudos to them for offering 3 different syrup choices for pancakes (maple syrup, wild berry syrup, and peach syrup).  The hashbrowns were also decent.  My omelet was pretty nasty and I ended up just eating half of it.  The pepper jack cheese tasted cheap and bland and the peppers onions and celery (....still a bit baffled by the inclusion of celery) was just not a great combo.  Kind of annoyed that cheese counts toward one of the \"free\" toppings in the \"create your own omelet\"...shouldn't an omelet just...COME with cheese?I had a few sips of my boyfriend's coffee and it tasted pretty good.Service was average, and we got our food fairly quickly.The bill for the 2 of us came to about $22 (before tip).  We spent a couple bucks less at Courier Cafe last weekend, for better food and a more interesting atmosphere.  Definitely will be going back to Courier Cafe, not so sure about Perkins.",
                "reviewer_id": "kltu5MyodHXondt_qvdAHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21421863652430062,
                    "positive_probability": 0.7857813634756834
                },
                "stars": 2
            },
            {
                "review": "My wife and I went to Perkins tonight around 7:45pm. There were very few customers so I was hoping we would have good service. Our drinks came out fast as did our food. The food was good and hit the spot. The problems came after we got our food. Our waitress disappeared. I'm not sure if she was taking a break or busy doing other tasks but she was nowhere to be found. We were wanting to order dessert which is one of the perks of going to Perkins as they have good pie and other goodies. Unfortunately we have had this type of service in the past. We did inform the manager about our disappearing waitress.Another problem I have with the staff is that if you order a muffin with your meal, don't expect to get dessert. The waiter/waitress will suggest that you 'probably don't want dessert' since you had a muffin. This has happened to us on multiple visits from multiple waitresses. I'm not sure if this is how they train their staff here, but it's really not a good way to run a business. I want to give them my money for more food and tip well, but they make it very difficult to do this.I don't care if you have the best food on the planet. If your service is lousy, then it ruins the whole experience.",
                "reviewer_id": "ON6M5JBSeiXdvZ3_6rsflQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2417228542647257,
                    "positive_probability": 0.758277145735261
                },
                "stars": 2
            },
            {
                "review": "To begin with, I wish Yelp! would change the meaning of the stars.  Two stars is \"Meh. I've experienced better\" and three stars jumps to \"A-OK.\"  Perkins is somewhere in between.  The menu for breakfast seems pretty extensive.  I ordered a platter that included smoked sausage (greasy), sausage (greasy and bland), eggs (done okay), bacon (spot on), breakfast potatoes (pretty good), and pancakes (so-so).  I like that they leave a pot of coffee on the table, rather than having you wait for refills from the wait staff.  It would have been even better if the pot was full and the coffee was good, neither of which was the case.  My waitress was efficient and personable.  Seemed more like a pro waitress rather than some of these student types that serve with the attitude that says, \"I'm only doing this until I graduate and start my money-making career, so don't expect much.\"  Again, not all student wait staff are like that but some are.  The place seemed clean and it wasn't very busy for a Saturday morning breakfast.  I've wanted to try Perkins and must admit i went there today only because Courier Cafe was closed.  I will return to Perkins, as there were some other things on the menu I'd like to try and because the experience wasn't completely a bust.  Although, I am usually a member of the Clean Plate Club, I did leave behind one piece of smoked sausage, a sausage link, some potatoes, and half the pancakes.  That says something.SECOND VISIT: My first reaction holds true the second time.  The coffee wasn't very good.  The eggs were okay and the potatoes decent.  Bacon once again was perfect.  The muffin french toast was awful. and was left unfinished.",
                "reviewer_id": "OZCzq4BvNGdTpBE2iUg0Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0022417902607396734,
                    "positive_probability": 0.997758209739262
                },
                "stars": 2
            },
            {
                "review": "I've eaten here twice now, and neither time was particularly enjoyable.  The food itself is fine; exactly what you'd expect from a Perkins.  I tried one of their newer omelets, and it was surprisingly tasty.  I had that problem where I was too full to eat more but wanted to keep eating...  The service, however, leaves much to be desired.The first time I went was on a Sunday around noon, so it was pretty busy.  My boyfriend and I stood in front of the podium waiting for someone to come to put our names on the list.  When someone finally came, he first took the name of someone who had come in after us, like we weren't even there.  It took a while to be seated, but that's understandable since it was about time for Sunday brunch.The second time was again on a Sunday around noon, but it wasn't near as busy.  Our waitress took our orders promptly, but afterwards, the quality of service plummeted.  My water glass was empty for at least 15 minutes before getting a refill, twice.  The waitress had walked past our table many times, but didn't even look at us to see how we were doing.  Our food took forever to come, and I understand there were five of us so that can take a while, but this was ridiculous.  And the waitress didn't say a thing the whole time.  When the food did come, it was warm, so at least the meal itself was good.  I asked for a box, but it never came.  I ended up asking for one at the counter myself to avoid waiting probably another half hour.  Overall, our waitress stopped at our table maybe five times total, and never apologized for the long wait or even noticed that we were pretty upset with our service.  In addition, several of the other employees were arguing loudly in earshot of customers, which I think is pretty unprofessional.I can't say I'd recommend going here, and if you do, expect to wait.",
                "reviewer_id": "qdL_6QKs8_U74ugjs0MpPg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6508729411747688,
                    "positive_probability": 0.34912705882522843
                },
                "stars": 2
            },
            {
                "review": "I absolutely love this place. My family and I have been coming there for many many years. The food is always consistently perfect and the staff are some of the kindest you will meet. (ESP Micheal) but we love them all.",
                "reviewer_id": "r1FiSHVFIGUoItMGvZ2vZw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10298134675469459,
                    "positive_probability": 0.8970186532453028
                },
                "stars": 5
            },
            {
                "review": "After ihop shut down on campus, Perkins is an alternative for brunch. I ve never been here for lunch and dinner so far.",
                "reviewer_id": "r_qusk0u1v7kAOek0LK7xw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.803531638342988,
                    "positive_probability": 0.19646836165701392
                },
                "stars": 3
            },
            {
                "review": "Since I stayed at the Hampton Inn, I decided to grab a quick lunch next door at Perkins. Boy, was this a mistake. Let me explain:1. This place does not offer vegetarian-friendly lunch options. I ended up getting the tomato basil soup and the wedge salad without the bacon. Both were subpar.2. The service staff showed little effort. After my waitress carelessly placed the water on my table, she just threw my straw in front of me and hurriedly proceeded to serve the neighboring table. Wow. What's more is that my wedge salad was hastily assembled--the iceberg lettuce was stacked in chunks and the bleu cheese was piled on one side. 3. The booth I sat at was not well-cleaned, and the table was sticky. How the heck this happened is beyond me.The only thing holding me back from giving them 1 star is that their pastries at the front counter look well made. Sorry, Perkins. You're never seeing me again.",
                "reviewer_id": "sA484WYUOFVL0QNFCntZ7w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9999826983835104,
                    "positive_probability": 1.7301616507740776e-05
                },
                "stars": 2
            },
            {
                "review": "I would study here late night because they offer the endless coffee pot where they will refill your coffee all night! I've also eaten breakfast here with my parents before a football game!",
                "reviewer_id": "sUrU9l3_f1iWYZdLmop0Rw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1379645831339517,
                    "positive_probability": 0.862035416866044
                },
                "stars": 3
            },
            {
                "review": "The service was horrible. We were waiting at the table for over 20 minutes before the waitress came to take our order. My wife and I walked out and the manager acted surprised when I told her we were very unhappy",
                "reviewer_id": "tpn4B_NrJnjzRsDFiXWXhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21049563318012782,
                    "positive_probability": 0.7895043668198768
                },
                "stars": 1
            },
            {
                "review": "Newly remodeled and it looks great!  The restaurant itself just completed a much needed facelift yesterday. Food is your typical Perkins fare. Not the best food you've ever eaten but not horrible either. The staff is very friendly and fun to interact with, so that and the remodel gets them an extra star.",
                "reviewer_id": "UuWcOMwqYLqF-19cOWEPeA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02113999022282709,
                    "positive_probability": 0.9788600097771695
                },
                "stars": 4
            },
            {
                "review": "Congratulations, Perkins! You've won my award for worst food in CU.The winner is: a 1/4\" chicken patty that spurts grease when bitten into! And said patty was definitely not a normal breast. More like old school McNuggets.YUCK.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.036196947233596816,
                    "positive_probability": 0.9638030527664082
                },
                "stars": 1
            },
            {
                "review": "It was good! I got the chicken fingers with fries, chicken was nice and tender, fries were really good! i would go back",
                "reviewer_id": "vNGbzFZdjZO_LF4IGxaRlA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7123130840029668,
                    "positive_probability": 0.28768691599703083
                },
                "stars": 4
            },
            {
                "review": "This is NOT the place to go for your lunch hour. They are incredibly slow and they really don't care that they are. We were not ready to order when the waitress asked us the first time so she said she would come back in a few minutes. Yeah, more like 20 minutes!! I ordered the new bacon, mushroom and onion skillet and I loved it. It has an Alfredo sauce over potatoes, grilled mushrooms & onion, bacon and cheddar cheese. I know it sounds like a heart attack on a plate but it was so good. I had a blueberry muffin also and it came out hot with butter on the side. Although I was very pleased with the meal the reason I am giving such a low rating is for the service. I ran out of water and was looking for my waitress to ask for more. It took a really long time for her to show up again. It also took more than a half an hour for our food to come out of the kitchen after we ordered. With only an hour for lunch that is unacceptable.",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0094146472788057,
                    "positive_probability": 0.990585352721196
                },
                "stars": 2
            },
            {
                "review": "Years ago this wasn't such a bad place to eat. It has since, gone down the drain! It took way too long for our order to arrive, about 45 minutes. I had family visiting and they wanted to go here.. My child got the mac n cheese and it was terrible. Tasted of cheap store brand mac. It was dry and a weird orange color. I got eggs and hashbrowns which  were bland and overpriced. Not very filling either. My whole family was disappointed with the food. We won't be back.",
                "reviewer_id": "Wetuu218beKm3E_ORqinlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09931693349786003,
                    "positive_probability": 0.9006830665021394
                },
                "stars": 1
            },
            {
                "review": "I've always been OK with eating at Perkins. However, my recent experience was so unpleasant that I have to write about it. My vegetarian friend ordered a Baja Benedict which is basically vegetarian except for a couple of bacon pieces on top of the eggs. She clearly stated that she wanted Baja Benedict without bacon. Simple. When the food come out, there are bacon on top of the eggs and when she pointed out to the server she took my other friend's fork and scooped the bacon out in front of us - her filthy fingers touched the food I'm pretty sure. This is so unprofessional and not sanitary,",
                "reviewer_id": "xUu9gORsM_AEWJjiEN4fHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001256769959019058,
                    "positive_probability": 0.9987432300409764
                },
                "stars": 2
            },
            {
                "review": "My picture was taken here. Four stars just for the mini-chimis and the patty melt.",
                "reviewer_id": "xWk5yxPRN2a83D-c9TAyVg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20476025836418932,
                    "positive_probability": 0.79523974163581
                },
                "stars": 4
            },
            {
                "review": "Cannot list all the times over 20 years we ended up at Perkins!  After a long day at the University, as both students and staff.  In the middle of the night when neither of us could sleep.  When my in-laws had a craving for French Silk (and omg, the number of pies I bought... it's just not quantifiable!).  When the ice had brought down all the electrical, once, and the roads were sheets of ice, a death-defying trek to Perkins, who promptly saved Christmas, one year!Whenever we couldn't make up our mind about anywhere else, the answer was always Perkins, and this location (on University) always met the call.  A warm pancake stack, with an ice cream scoop sized wad of butter melting in!  The aforementioned French Silk pie, a slice of it just as a treat.  Even their hot turkey plate-- a real Butterball turkey, slow cooked, with amazing \"fixin's\".  I mean... food doesn't have to be froo froo for me in order to be _good_, _wholesome_, and made with love.  So many meals I've had here, and I'd say that the vast majority of them have been something special!Perkins is super reasonable on price.  The restaurant is a little dated, now, but you just _can't_ judge this book by its cover.  Because there's love underneath what they do, here, and if you can't find something to enjoy, you just aren't trying hard enough (or you're trying _too_ hard to be a snob! ;D).",
                "reviewer_id": "YtbXNQJEJAHZK_2DFXSa6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3984423024816597,
                    "positive_probability": 0.6015576975183571
                },
                "stars": 4
            },
            {
                "review": "What you are about to read is a true story.\"Welcome to Perkins, what can we get for you?\"\"Hi!  I'd like to order the chicken fingers.\"\"Sorry, we're out of chicken.\"\"You're out of chicken?\"\"Yup.\"\"Okay... how about a bowl of ice cream.\"\"Sorry, we're out of ice cream, too.\"\"You're out of ice cream and chicken?\"\"Yup.\"\"Okay... do you have any French Fries left?\"\"Yes, we do.\"\"Alright, I'll have that.\"(comes back after a while with the fries)\"Great, can I have a fork for this?\"\"Sure.\" (comes back after a few minutes) \"I'm sorry, we're out of forks.\"\"You're out of forks???\"\"Yeah, sorry...\"I don't care what the food tastes like, but if an establishment runs out of forks, there is something wrong.",
                "reviewer_id": "zgD6Esf3DqSod6kFsudrow",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28921874784100876,
                    "positive_probability": 0.7107812521589862
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "SeQv-RJ2rS070NvSRh_siQ",
            "KUpdnQi16DGP54FlDWOJ6g",
            "wO8c-FbduauxCGiEHchGRA",
            "6HKjKhgDLBpuZFNBOCzVQw",
            "Z8EGaOokvK2hoD6tGup0MA",
            "sBw0ZgTVeRgdOA3sfGIcwQ",
            "bkbOmsZ9cOggOnpKsxOyiQ",
            "VI-zVIlK11AUz47mro8nMA",
            "u-y1z3usKenHtOGrH5Vveg",
            "rm2OnyNDnlWkSNUSxETsGg"
        ]
    }
}