{
    "AB5RgQ0ZnMThdqgFS3cPuw": {
        "keywords": {
            "bigrams": [
                "radio_maria",
                "goat_cheese",
                "downtown_champaign",
                "beer_bread",
                "tapas_bar",
                "food_good",
                "tapas_menu",
                "pretty_good",
                "masa_boat",
                "great_service"
            ],
            "unigrams": [
                "food",
                "good",
                "tapas",
                "radio",
                "great",
                "menu",
                "maria",
                "place",
                "service",
                "brunch"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "full_bar",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": true,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "no",
                "Caters": false,
                "Corkage": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": true,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": false,
                "Has TV": false,
                "Noise Level": "average",
                "Order at Counter": false,
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": false,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "AB5RgQ0ZnMThdqgFS3cPuw",
            "categories": [
                "Breakfast & Brunch",
                "Spanish",
                "Cajun/Creole",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "119 N Walnut St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "02:00",
                    "open": "16:00"
                },
                "Monday": {
                    "close": "02:00",
                    "open": "17:00"
                },
                "Saturday": {
                    "close": "02:00",
                    "open": "10:30"
                },
                "Sunday": {
                    "close": "02:00",
                    "open": "10:30"
                },
                "Thursday": {
                    "close": "02:00",
                    "open": "16:00"
                },
                "Tuesday": {
                    "close": "02:00",
                    "open": "16:00"
                },
                "Wednesday": {
                    "close": "02:00",
                    "open": "16:00"
                }
            },
            "latitude": 40.1171251,
            "longitude": -88.2426687,
            "name": "Radio Maria",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/lRyvTBjc5bOvLYAIourW2w/ms.jpg",
            "review_count": 209,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "At the bar, we order two delicious drinks. Foods are good. The food was good. ",
        "reviews": [
            {
                "review": "Made the mistake of coming here for brunch Homecoming weekend. The service was incredibly slow. Took over an hour to get two breakfast dishes. I didn't get drinks but it did seem like people were enjoying their drinks orders. I ordered huevos rancheros with chorizo which is something I thought was hard to mess up. After the wait I was expecting greatness but this restaurant did not deliver. Eggs were over salted and the presentation was not appealing. Don't think I'll be back again.",
                "reviewer_id": "-4iOmDZ3K1l6lSt97BcF-Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5067941435878484,
                    "positive_probability": 0.4932058564121507
                },
                "stars": 2
            },
            {
                "review": "Soooooo, I love Radio Maria. I have loved it for years. I have seriously been frequenting this place for over a decade. And while it has been clear to me for quite sometime that the quality of my experience here has been on the decline, I've been in denial... until today. Sunday brunch is tradition for me and a handful of my girlfriends. We literally do it in some form every weekend. Today we went and well... where should I start? Our waiter was completely aloof. We waited at least 10 minutes, in a moderately busy bar for a whiskey soda (don't judge us for loving whiskey. It's always 5pm on Sunday Funday). No biggie though. My steak and poached eggs were not hot when delivered to my table. No biggie though. But when one of my girlfriends ordered a salad with slide of shrimp and was brought 2 shrimp ... like what?? (Look at the picture!) In what restaurant world is this ok? $3 for 2 shrimp? They should have brought her 3 oz of shrimp (an actual serving) for whatever the cost. But 2 shrimp? Don't be petty. That's so petty, and as much as I love Radio brunch when it is done right, I think I need my space until they get it together. Mind you I'm still annoyed they gave up their late night menu but that's another post for another day...",
                "reviewer_id": "-6l7CsWbTPJeFgflI-V4Fw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19578381737732664,
                    "positive_probability": 0.804216182622673
                },
                "stars": 3
            },
            {
                "review": "It is sometimes a great spot, but it is not as consistent as it was a few years back.",
                "reviewer_id": "-9JGmOgqza0FDkzYLP48Zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16254098175633303,
                    "positive_probability": 0.837459018243667
                },
                "stars": 3
            },
            {
                "review": "I enjoyed the atmosphere and the selection on the menu, as it offers food you cant really find anywhere else in the C-U.  I thought the menu items were decently priced, maybe a bit overpriced for the quantity and quality of the food.  I ordered three tapas dishes - the grilled plantains, the goat cheese, and the beef tacos.  The goat cheese was fried and served with honey and bread and it was absolutely delicious!  The plantains were pretty plain, but still a nice change of pace from what I normally eat day to day.  The beef tacos were tasty, but they were incredibly hard to eat when served in dry corn shelled tortillas.  They cracked and fell apart so it was a bit frustrating to end up having to eat a taco with a fork.  Our service was absolutely terrible, I had to flag down the host at one point to get my water glass refilled, and she brought out all of our food at different times which was a bit strange.  Overall, I was happy with the food I ordered and how it was prepared and how it tasted - were talking about Champaign, Illinois, not Chicago or New York - and unhappy with the service.  I wouldn't tell someone not to go there, because it is a unique restaurant for this area, but I would be warned that the service will likely be disappointing.",
                "reviewer_id": "-f6N6EjTOZGyH4RwPLXxDA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27889243887753884,
                    "positive_probability": 0.7211075611224793
                },
                "stars": 2
            },
            {
                "review": "We usually sit at the bar and order up tapas and drinks.  The bartender never missed a  chance to mix us up a mean cocktail of his own creation.  The food is good and priced right.  The atmosphere is also wonderful, and very unique.  They also serve brunch, which is great!",
                "reviewer_id": "-nJQAq1pF8cvnH9yRcOUvQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5991064238404353,
                    "positive_probability": 0.40089357615956484
                },
                "stars": 4
            },
            {
                "review": "Best bartenders in town! Food is amazing, and if Matt is your waiter it is your lucky day!! Otherwise? Cross your fingers, host thinks he is making you a favor by giving u a table (when they are empty), and our second waiter knew we were hungry but forgot to bring a menu. Matt!!! Can you please train the rest of the staff on how to be wonderful?",
                "reviewer_id": "-UPa2MkstGIy_c5SaKP26w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9361047434015648,
                    "positive_probability": 0.06389525659843934
                },
                "stars": 4
            },
            {
                "review": "Let me start this off by saying I'm a VERY cheap eater. I'm definitely the kind of person that would rather sit on the curb next to a taco truck stuffing myself with a $6 burrito than go to a fancy restaurant (the kind of place where you don't where cargo shorts) where there's more empty space on my plate than food. That being said, of all the more expensive places to eat around town, Radio Maria takes the cake for me. First off, the restaurant has a GREAT atmosphere. The setting/lighting is damn near perfect and they have great outside seating if the weather is nice. There's weird kitschy crap all over the walls and table too, which I mean as compliment. On top of that I've never had anything but a pleasant experience dealing with the staff. All the waiters/waitresses and hosts were extremely friendly and conversational. But really though, how's the food? Well, it's also great. Every time I look at the menu (for tapas especially) it's a lot of fun. For those who don't know there are two menus regularly available here, one that is a more traditional appetizer/entree menu and on that is for tapas dishes. There's good variety in terms of vegetarian and non-veggie dishes and the prices aren't outrageous for a place of this caliber. The paella is a definite must every time I go and on one day of the week (Tuesday?) they have 1/2 off wine bottles! Speaking of booze they have a full bar and a great selection of wines and beers as well as house infused liquors rotating every week or so which is really neat. While cocktails are always the thing to break the bank sometimes I just can't resist! All in all this is a great restaurant and one of my favorite CU establishments. I certainly won't be dining there very often but on a special occasion they're always high up on my list of options.P.S. I've heard from a number of sources that their weekend brunch is both delicious and slightly more affordable than their regular weekday selections. If/when I verify this I'll make sure to update my review.",
                "reviewer_id": "061lsbK4eLnRJe3sZjPn0A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.255203541007621e-06,
                    "positive_probability": 0.9999967447964493
                },
                "stars": 4
            },
            {
                "review": "Great food, not overly pricey, and thoroughly enjoyable. Their menu is unusually limited for a place of this nature, but they rotate items frequently, ensuring that Radio Maria is a place you can come to more than once a month.The best part about Radio Maria is at night; not content with being just a cultured restaurant, it become a bar/latin dance night. For this, it gets at least one more star to land at 4.",
                "reviewer_id": "0hOhP8JcEwBIPDCVFqa0dg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17435933064356451,
                    "positive_probability": 0.8256406693564361
                },
                "stars": 4
            },
            {
                "review": "My friend and I went here for brunch. Everything was delicious! I got the caprese omelet, and my friend got the lobster omelet. The beer bread and potatoes that come with the omelet were so good! We also tried the mexican coffee. It doesn't taste that good with the food. It tastes better on its own. It's something you won't regret trying. It's sweet and has a strong cinnamon flavor. Service was pretty slow, but we were okay with that this time. I highly recommend going to Radio Maria for brunch! I would love to try their lunch and dinner menu as well :)",
                "reviewer_id": "0Q5mWDzsY57mpfz2OqZnMA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04149953017121873,
                    "positive_probability": 0.9585004698287722
                },
                "stars": 4
            },
            {
                "review": "This place is pretty awesome in downtown Champaign.  I had the torta maria out of sheer curiosity for what sweet potatoes, goat cheese, tortillas, and vanilla bean sauce tasted like all together.  Goodness me!  That's some good stuff to put on your fork!",
                "reviewer_id": "0XblLlmCumBzPBYgVqNvBQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6743074439163655,
                    "positive_probability": 0.3256925560836328
                },
                "stars": 4
            },
            {
                "review": "I am straight up in LOVE with the fried goat cheese balls at radio maria. i was super excited to go and enjoy some of the deliciousness that is the food, however, last week i went in with a friend and we were seated and then literally sat there for 7 minutes before someone came over to us. I was just the hostess, who said that a waiter would be over in a minute. That minute was another 7 minutes, and we didn't even have a drink order in, so we got up to leave (as we were super hungry.) The hostess shrugged and was totally unapologetic about the terrible service, so we went to jupiter's and had some delicious pizza and beers for 1/4 the price of what we were going to order.",
                "reviewer_id": "1FIivLuWWxtn-lQFiHeTSg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9629686169201487,
                    "positive_probability": 0.03703138307985437
                },
                "stars": 2
            },
            {
                "review": "This is probably the best place to take your parents/family out for Sunday brunch, especially if your family is full of food snobs who don't believe small college towns have anything worth eating. C-U does a good job of disproving this (and at times, an amazingly disgusting job of proving it correct) but Radio Maria is my number one choice.Their brunch menu features typical brunch/breakfast items; omelettes (lots of options for fillings), other egg creations, sandwiches, etc. My mom is a big fan of their crab cakes, and I believe my dad always gets a sandwich of some kind. I always get an omelette, which I always enjoy. Everything (nearly) comes served with their \"beer bread\" which seems to be some kind of beer/corn bread thing that's fantastic. They sell it separately in loaves, last time we were there my parents bought one to take home.The service can be a bit iffy, last time we went our waiter seemed to have forgotten about us as people who were seated later got their food way before we did. But eventually our food came, and he was very apologetic. I don't think this is indicative of their service typically, but from what others have said it may be. Overall though, Radio Maria is not to be missed.",
                "reviewer_id": "27gcq2AD3VLDXJw9Wukc4A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0044187308207398685,
                    "positive_probability": 0.9955812691792761
                },
                "stars": 5
            },
            {
                "review": "Took my friend and mother here for moms weekend brunch - service was very quick and friendly. Ordered an omelette, eggs Benedict, and egg sandwich. Everything was fresh and delicious, large portions. Beer bread was excellent, as were the mango mimosas! Would absolutely go back",
                "reviewer_id": "2QPQbXx7FM_jTsWlCW1WAw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05590155213902106,
                    "positive_probability": 0.9440984478609747
                },
                "stars": 4
            },
            {
                "review": "What can I say? Having studied abroad in southern Spain for a semester in college, Radio Maria's Spanish flare and tapas menu really pluck at a heartstring with me. I love enjoying late afternoon tapas on a warm summer day with great drinks and better friends. I'm not forgetting the great selection of entrees this restaurant/bar offers, but in typical Spanish fashion, I usually fill up on beer and tapas before I can even contemplate dinner. While they don't serve dinner all night long, they do continue serving their most popular tapas until close. So grab a group of friends and head over to Radio Maria soon; the availability of food at all hours makes it a great place to start or end a night downtown!",
                "reviewer_id": "36Xod9g9fK8O4nkOWtH4Dw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011828165231762481,
                    "positive_probability": 0.9988171834768214
                },
                "stars": 5
            },
            {
                "review": "Delicious food, lovely atmosphere. One of my top 5 restaurants in Champaign-Urbana!The roast chicken, fish tacos, and coffee filet are some of my favorite entre's that I've enjoyed here. The food is good quality, and the flavor always delicious!Tapas menu: the frog's legs (mmm, honey) and roasted asparagus are some of my favorites. A few of the tapas items lack flavor; but in general you won't be disappointed.The desserts I've had are lovely; with good flavor and pretty presentation. The portions of everything are very good - not too much food, but plenty to satisfy you.The wait staff has always been nice and helpful, if a bit distracted sometimes. Friendly people, good service.It's definitely one of my favorite restaurants, I go whenever I get the chance, and recommend it to anyone!Note: Many people have reviewed Radio Maria negatively. I think they need to put it in context of local restaurants. We're in Champaign-Urbana, not New York or Seattle. While we should have high standards, we just don't have the variety (and therefore competition) to create a large foody restaurant culture. I also think they need to stop being so negative. I've had a lovely meal and experience every time I've been to RM; I believe you get out of a place what you put into it (as long as it's moderately good, and this is much better than that). Viva Radio Maria! :)",
                "reviewer_id": "3BMdzX6ttDPFVWwHz0_9rw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006355571378429516,
                    "positive_probability": 0.9936444286215627
                },
                "stars": 4
            },
            {
                "review": "By far our favorite spot we've eaten at so far in Champaign. Our server was a little strange - definitely new to the job - but the food was excellent and the service was completely reasonable. Very large beer selection as well. Highly recommend - we'll be back!!",
                "reviewer_id": "3eAGN8qtve9QD0B4l__Suw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023919943796496583,
                    "positive_probability": 0.9760800562035014
                },
                "stars": 5
            },
            {
                "review": "Unique place.  You won't find anything like it.  Has a full resturant and a apas bar.  Great food, and truly excellent service.  Easily the most interesting place in central Illinois.  Really.",
                "reviewer_id": "3eXmgv6XbAlnFrNF7MXWoQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10169798071891674,
                    "positive_probability": 0.8983020192810828
                },
                "stars": 5
            },
            {
                "review": "The food here is good but the portions are miniscule, and I don't mean the tapas, and the prices are outrageous for what they are serving. I actually left here hungry after getting a monkey bread appetizer, a tuna dinner dish, a drink and a dessert. The check arrived and I felt disheartened by the total which was 70$+ for two still very hungry people with the worst part being that I rarely complain about the smallness of food portions, the are usually too big in fact, but this was not the case here.",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1841067009207362,
                    "positive_probability": 0.8158932990792562
                },
                "stars": 2
            },
            {
                "review": "Great Tapas. I want to go back for more. Wish they had better hours though. The parking lot attendant was rude. Couldn't wait in my car to wait for my friend to arrive. Made me not want to go into the restaurant, so I didn't. They're so worried someone might park there that isn't going to Radio Marias.",
                "reviewer_id": "3qFI4GeLEDUtWNRpLBY68Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7337640472420759,
                    "positive_probability": 0.26623595275792483
                },
                "stars": 3
            },
            {
                "review": "Brunch might be the best in Champaign-Urbana area. 5-stars. Beer-bread toast is thick and incredible. Omelets are over-stuffed and innovative and completely satisfying. Regular specials make some variation on the menu.  Coffee is aromatic and high quality. Wait-staff at Radio rarely makes mistakes: they're natural and easy and very good.As for other things, their beer selection is as good as any of the craft beer bars in downtown Champaign (Blind Pig, Quality, Big Grove, etc) but I often forget about it as a choice.4-stars overall only because the tapas menu, while tasty, can get really pricy for the portion sizes. This is what tapas is about I suppose, but also means I don't choose to head here in the evening as often.",
                "reviewer_id": "3zxHXzxP6D6K6kvDImzMAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007372167715407761,
                    "positive_probability": 0.9926278322845945
                },
                "stars": 4
            },
            {
                "review": "I'm starting to think these guys spread themselves a bit too thin.At brunch yesterday we were overwhelmed by how many options there were, with 14 regular offerings or so, about eight different omelettes, and then a dozen specials.  Yikes! Unfortunately, most of us were underwhelmed with the food.  My wife's Italian omelette lacked a kick--add some fresh garlic, perhaps?  The two of us whose dishes included the \"house made\" chorizo were disappointed at the sausage's lack of flavor--either spice it up or use store-bought, folks!The mediocre food was made up for by the wonderful decor and overall experience.  As a Chicagoan with family in Champaign I'm jealous that a place like this exists, so inexpensive, with so much variety on the menu and 37 beers on tap (next door at the Tapas Bar)!  If they spent some time tweaking the dishes they have and adding that extra something many of them miss, they could become a truly top-notch restaurant for brunch.UPDATE: Went to the tapas-bar portion of RM the other night and was really pleased with the dishes.  A few traditional tapas but mostly inventive twists using spanish ingredients, like lightly battered asparagus with serrano ham and manchego cheese and seared avocado  stuffed with quinoa.  Really tasty stuff, and goes great with one of the 25 draft beers (most of which cost four bucks).",
                "reviewer_id": "4UpCBfRXULqQ0GaZTnG9Mg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.410698359790298e-06,
                    "positive_probability": 0.9999985893016293
                },
                "stars": 4
            },
            {
                "review": "Falling Fast.  I've been going to Radio Maria since it opened and have likely gone for dinner for the last time.  The menu, once a delightful mix of cultures and influences, and the sort of place where there was nothing bad on the menu, has been getting progressively smaller and less capable as the years have gone on.  Drinks are good, Tapas is \"meh\" and pricey, dinner...no...and pricey.  We went last week and I ordered salmon which arrived with sweet potato chips - and a huge fried egg on top.  The fish was okay at best and the odd attempts at nouvelle cuisine were amusing - but tasteless in every sense of the word.In a market as competitive as C-U, I don't see how they can continue this based on anything but location and alcohol.  Pity to see an old favorite fall this far.",
                "reviewer_id": "5dLpZsEuKVlyoTUnVHTU7g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007871822250031071,
                    "positive_probability": 0.9921281777499596
                },
                "stars": 2
            },
            {
                "review": "This place is a paradox. I was there over Memorial Day weekend, on Saturday night, and had none of the issues with staff \"coolness\" that others reported. We were treated well and served professionally as we stayed all evening (7-11 PM). The drinks were good, though I'd say the beer was a bit small for the otherwise fair price. The odd thing is that the food is irrationally high priced - at least for the entrees. Our group of 4 ordered 3 of the specials and 1 menu item. The specials (which are not priced on the board) were simple plates of an entree & a \"decorative\" side. I ordered the Paella from the menu. The Paella was a 6 inch skillet of rice and seafood - 3 or so pieces each of shrimp and scallops, with some hard cooked sausage slices throughout. Good, but not special. Two of the specials were a fillet with a garlic crust - 4 oz of good meat. So what's the issue? Well $30 for the fillet and $24 for the Paella is an outrage for a remodeled VFW in a College town. This pricing is just too much like Soho/Manhattan - but it is Central Illinois! So go for the drinks and the Salsa Dancing after 10:30, but skip the food - it just is not worth it.",
                "reviewer_id": "64i6dDMPoz0U56X0FHSjUQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11395872744429676,
                    "positive_probability": 0.8860412725557181
                },
                "stars": 3
            },
            {
                "review": "Radio Maria has nice decor and an interesting menu.  We came for tapas and I got the aparagus topped with eggs and the vegetarian crostini trio.  Both were very good.  My boyfriend got the eggplant fries.  They were so-so.  A little too greasy and the sauce was too sweet for me.My only complaint is that the service was painfully slow.  There seemed to be one server for the entire place.  We sat there forever just waiting to order our food.  Not the type of place to go to if you are in the rush, that's for sure.",
                "reviewer_id": "6GA0alvHz3llmFVpyS3iug",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.46887820632854205,
                    "positive_probability": 0.5311217936714572
                },
                "stars": 4
            },
            {
                "review": "The food was overpriced, the service was disappointing, and the portions were small. I feel like that summarizes this restaurant adequately. Better places out there. ESPECIALLY for mexican food.",
                "reviewer_id": "6h6yYkyOWnv19WjnpwbGJA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5750123672090299,
                    "positive_probability": 0.4249876327909685
                },
                "stars": 2
            },
            {
                "review": "did lunch in their new tapas bar today.  had to sit at a bar table with those dreadful high chairs because there were no booths available. i'm not a big fan of being uncomfortable...ever.our waiter was great, in fact he added to my experience.  the interior is very well done for that particular genre.the food, eh, nothing to write home about.  had a small salad with the standard blue cheese, grapes, apples, walnuts=better than average.  then shared a few tapas with my friend.  we had the pita triangles with hummus and the tuna salad sandwich.  the portions were acurately small.  flavor was good but again, nothing special.  it was extremely cheap though...in addition to the food above we had the blackberry iced tea and 2 coffees and each spent $12 including tip.",
                "reviewer_id": "6pC5j-hfP4xLZB2W0Wi1vg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.670186981324645,
                    "positive_probability": 0.32981301867534957
                },
                "stars": 3
            },
            {
                "review": "Radio Maria is good. Not great, but good. Their brunches are much better than their dinners, and I'd probably give them a 4 for brunch. There are some good things to be found for dinner, but you have to search. The menus are a bit unwieldy.No complaints on the cocktails at all, and they always have a really good beer selection. I'd be more inclined to come here for drinks or brunch than I would for dinner.And, one bizarre thing that I can't get past - their cheese plates. Who puts feta on a cheese plate? There are lots of good cheeses around this area, so it seems crazy to have a below-average cheese plate.",
                "reviewer_id": "7cU03OKZgmjNLLLGpbBiOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16587578372386655,
                    "positive_probability": 0.8341242162761383
                },
                "stars": 3
            },
            {
                "review": "If you want good cocktails that are overpriced this is your place! Seriously, they had some interesting concoctions on the menu and I tried two of them. They were both fine. Very heavy on mixer. I am one of those weirdos who actually likes to taste the alcohol, the ratio was a bit off. The food is decent as well. I feel as though there have been some odd thing going on with honey on their menu right now, though. Fried eggplant with balsamic vinegar and honey... what? Why? My friend loved it. I tried it. Yuck! Waaaay too sweet. Lots of dishes with honey when i was there last.They clearly know a thing or two about food in the way they pair ingredients most of the time but sometimes it's a miss. To some degree, I appreciate that their menu changes based on what is available, however, I don't appreciate it when I look on the menu and there is only one thing I would consider eating.",
                "reviewer_id": "7QKY43Uq_nZUNRhWInVLPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08835427620713661,
                    "positive_probability": 0.9116457237928651
                },
                "stars": 3
            },
            {
                "review": "Always a good place to go with friends/family from out of town for it's vegetarian friendly menu.",
                "reviewer_id": "7wO2d14M5YBcBgscWilQfg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12073882230714794,
                    "positive_probability": 0.8792611776928518
                },
                "stars": 3
            },
            {
                "review": "Been there many times over the years, and the restaurant went down the hill. Service is awful and very slow, portions small, ingredients often inferior, and food overpriced for its quality and portion size. Seared tuna was not even chewable, lamb balls dry, potato tapas prepared ma-a-any days before we visited. They used to have tasty ox tail as tapas; now it disappeared, though remains on the menu, and the waiters lie that \"we ran out of it today.\" The only reason to go is a huge list of draft beers.",
                "reviewer_id": "8A8wyMRO82vSxLlzoRwA1w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6727764040703,
                    "positive_probability": 0.3272235959296901
                },
                "stars": 2
            },
            {
                "review": "Enjoy the brunch here on Sundays but that is usually the only time we eat here. The Lloyds omelet is great and you can sub grits or a biscuit for beer bread if you ask. Good draft beer selection.",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33301887310352957,
                    "positive_probability": 0.666981126896469
                },
                "stars": 4
            },
            {
                "review": "Went for brunch and would definitely recommend it.  My boyfriend and i tried the masa boat surprise, smoked pork pozole, and 2 mexican coffees.  The mexican coffee was delicious, like a spiced coffee with nutmeg, cinnamon, and clove.  My boyfriend said it had a little too much spice for him, but it reminded me of a spiced latte.  The masa boat surprise was tasty, although I recommend getting a little bit of everything in each bite.  Eating just the egg and chorizo can be a little bland, but eating it with the veggies, cheese, salsa, black beans and some of the corn \"boat\" is sooo good.  The smoked pork pozole was really good, although it could have been a dinner item if not for the poached eggs.  It was kind of like a mexican stew with a couple poached eggs, and some beer bread.  The beer bread was very tasty.  We'll definitely be going back and try some other things.  Radio Maria's has a pretty extensive breakfast and lunch menu.",
                "reviewer_id": "9epEUZ6VFX800EwrbXhdQQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7734261481056347,
                    "positive_probability": 0.22657385189436557
                },
                "stars": 4
            },
            {
                "review": "A great lunch and brunch place, but I'm less impressed by their dinner fare.I mostly go here for brunch and the food rarely disappoints. The torta Maria and smoked port torta are unusual and always good. Each week the brunch specials usually include a special omelette, scrambler, and a sandwich. The omelettes are only OK; somehow they seem a bit dry and overcooked.My main complaint with brunch is the coffee. For my past several visits it's been quite weak and it's hard to get a refill. At a weekend brunch, I do expect good, hot coffee and not to go 20 minutes with my cup empty.For dinner, I think Radio is trying to present itself as more upscale and trendy than it is. A few years ago, the menu had a much more pronounced Carribean/Cuban/South American flair to it, and I miss that. I'm sure everything on the menu is very well-prepared, but it all seems like dishes I can get at any number of places.For my last dinner experienced there, I had a tenderloin special. It consisted of two pieces of tenderloin, one correctly medium, one well-done; six gnocchi (I counted); and a scattering of green peas. I believe the sauce mentioned in the description was absent. We did have a large party, but we were sitting at an empty table for nearly an hour before our food was ready; no salads, no bread. I guess we were expected to order cocktails and appetizers. Everything was tasty and was artistically arranged on an appropriately-trendy rectangular plate, but the portions were quite small. I shouldn't leave a restaurant after a $30 entree feeling a bit peckish.I feel like Radio can't decide what it is. A fancy drink bar? A tapas bar? A haute cuisine restaurant? It does all those things fairly well, but none of them exceptionally.",
                "reviewer_id": "9FXeMN2MgFdrzEQUG-r8kQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.000486700601774144,
                    "positive_probability": 0.9995132993982266
                },
                "stars": 3
            },
            {
                "review": "Brunch is awesome",
                "reviewer_id": "9wgA-ExyfuqA_r_pDrcONg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25025041736227055,
                    "positive_probability": 0.7497495826377296
                },
                "stars": 4
            },
            {
                "review": "Brunch!OK, first, we have to discuss the breakfast potatoes.  As a daughter of Irish stock, I thought I was pretty much over any potato-creation.  Wrong.  These were baked to perfection (crispy skin, soft middles) and impeccably seasoned.  I ate every last morsel.  Seriously, I love when things look so simple (they are just cut-up potatoes!) are so unreasonably delicious.Secondly, just about any option could be made vegetarian.  Bonus points for that, Maria!Portions were enormous... but we all cleaned our plates... so yeah, it was all very good (or we are all brunch-piggies, your pick).Our lovely brunch was reasonably priced as well.  I treated my two friends (yeah, I'm a high roller) without cringing at the check.",
                "reviewer_id": "9YXeaBBjAxlo1LC0u3DGRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002774354664529203,
                    "positive_probability": 0.9972256453354797
                },
                "stars": 4
            },
            {
                "review": "Love their sides!!! Corn bread..cinnamon cake..fried banana...French toast!!! We almost ordered all the sides!!!! I love the cream cheese on the cinnamon cake!! God!!!it was fabulous!!!! And for the drinks..Turkish coffee tastes just like unmelted sugared Americano.....lol...My cousin and I shared salmon omelette, it was great!!especially love the cheese inside the omelette!!! It tasted so good that I finished it all!!! And the waitress is friendly!!",
                "reviewer_id": "_1s8jUq3P7RMFgloAKrYkQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13847513137459028,
                    "positive_probability": 0.8615248686254131
                },
                "stars": 5
            },
            {
                "review": "Two words. Grilled plaintains. HO MY GOD.No, but really, the couple times I've been here have been good. Normally, I've only come for drinks but today was the second time I've come for food. The tapas are a little on the expensive side (they are tapas after all I guess) but I think they're very tasty. In a perfect world, I'd like to have maybe 4 arancini for 5 bucks, but it is what it is. Unless you're ballin' out of control, you're not going to eat here everyday. Living on grad assistant paychecks, it's a nice treat to come here.I really can't speak to any of the problems that folks have had with service, etc. My group today came in and the servers set up a nice big table for us. They also brought out some carafes for water which is something restaurants tend not to do.Anyway, 4 stars. Take your date here. He/she will thank you.",
                "reviewer_id": "_9uvL80xzBxDjWzFM7Da5g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04458090170535182,
                    "positive_probability": 0.9554190982946423
                },
                "stars": 4
            },
            {
                "review": "The food seems extremely simple for their prices. I have eaten brunch and dinner here and the food is really not that amazing.   The drinks are always good and I never go downtown without having a little white lie!",
                "reviewer_id": "_EB2O2GjkTkUdGLi01O5hw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3235935796675462,
                    "positive_probability": 0.6764064203324522
                },
                "stars": 3
            },
            {
                "review": "We visited on a Monday at around 5:30.  The place was nearly empty, which was quite pleasant.One of the things that had drawn us to the spot was the advertisement of their 27 taps.  We were not disappointed; the selection was quite nice.We got the arancini and the torta maria. Both were quite tasty, though I'm not sure tr hat the vanilla in the tortilla worked as well as it might.  The result was a bit too sweet for a dinner entree.For dessert we got the bread pudding.  It was a solid if unexciting example of the form. The cherries were quite nice, but the bread itself could have used a bit more flavor.",
                "reviewer_id": "_ebU0aaYk2Zb-Hi3LXCycw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1718156460527175,
                    "positive_probability": 0.8281843539472777
                },
                "stars": 4
            },
            {
                "review": "Visited this restaurant for the first time with my girlfriend due to friend recommendation. And I have to say, it does live up to the hype. Since it was early in the morning on a weekend, we liked to start out our meal with some nice coffee. Not gonna lie, if you are looking to some authentic Mexican coffee, save it. Their coffee was not their highlight. They offered two specials that day: an omelette and a stuffed chili pepper. We listened to our friendly waiter's recommendation and ordered one of each. Their baked potatoes that accompanied the core of the meals were phenomenal! The temperature was perfectly controlled and all the pieces of the potatoes were cooked evenly, and just right. Crispy on the outside, soft on the inside, with just the right amount of salt to make it appeal to the tongues. It is very hard for me to describe the main courses in details, since there was a lot going on, but just know that food is served in a timely fashion, and the impact of the flavors truly made the visit an overall enjoyable experience. Definitely keep a lookout on the specials if you want something more memorable.  The restaurant itself is very clean, and was decorated with interesting Hispanic things that created an unique atmosphere that made it ideal for 1 on 1 dining. Definitely would return to this place next time I am in town.",
                "reviewer_id": "acbR6V3UTAsxe05lQiWWcQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.115522820281938e-05,
                    "positive_probability": 0.9999788447717917
                },
                "stars": 4
            },
            {
                "review": "A very interesting spot in downtown Champaign.  A tapas bar, beer bar, brunch spot on the weekends, cocktail bar, and what else?  I am probably missing something...Tables spread out up front.  A blue lit bar, and a spinning wheel of taps.  Strange lighting, and can get very loud later at night.  Artsy and hip without being completely pretentious.  Just a little though.Service can be a bit slow, but always friendly and knowledgeable.  Beer list is always rotating.  Founders, Dark Horse, Ballast Point, plenty of other US micros and a good selection of imports.  I think the wheel has about 30 taps.  Then a creative cocktail menu, which I have yet to try.  Outside of Blind Pig, this was one of the first true beer bars in the area.Food is interesting.  A mix of tapas, other small plates, and brunch.  Hanger Steak is good, as is the duck.  Not everything is a hit, but there is enough good stuff to keep you coming back.  Like bone marrow, pork shoulder, and ricotta.  This is definitely a place to check out downtown.  An interesting mix of different bar and restaurant concepts.  Good beer, interesting and often very good food.  Good spot.",
                "reviewer_id": "aF4FWUbU0Tq6jH0FZKSQlw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13241560704919206,
                    "positive_probability": 0.867584392950815
                },
                "stars": 4
            },
            {
                "review": "Shockingly I came here without checking Yelp, but I was really happy with the meal I shared with a friend. They have two menus, one for traditional dinner and one with tapas items. Since I like trying different things, we decided to share 5 small plates.Patatas (bravas): Great crispy potato chunks with some fancy mayonnaise (aioli)  Charcuterie plate: Slightly untraditional plate of four types of meat. Spicy salami-ish meat, serrano ham, duck breast, and bbq crispy pork. The crispy pork was my favorite, but everything was really tasty, especially mixed with the pickled onions. Mussels: Really complex flavorful broth with well cooked and meaty mussels. The toast they came with was top notch, also.Lamb meatballs: Tasty, especially with hidden gems of pine nuts. If you really like meatballs, I definitely recommend these. Garlic shrimp: Four plump and juicy shrimp hanging out on a large piece of toast with a mayo based sauce. I loved these.The decor is slightly art deco, but a little more colorful and whimsical than that. Service was excellent, and I think overall it's a pretty good value for Champaign. I can't think of anything I didn't like at Radio Maria and would strongly recommend it!",
                "reviewer_id": "aIT9dfJ681z0wxXEtQJmiQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009998556973613681,
                    "positive_probability": 0.9900014430263724
                },
                "stars": 5
            },
            {
                "review": "The pace of service is nothing to write home about, but the food is delicious. Such a fun place to have tapas. The paella is a MUST.",
                "reviewer_id": "amxtfaoqV0JEwbJUFeCyLg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5168616532611263,
                    "positive_probability": 0.4831383467388729
                },
                "stars": 4
            },
            {
                "review": "Awesome atmosphere, creative and very well prepared food, excellent wines and beers, and great service. The space is very well done in a mix of old Champaign with some more subtle modern features. Ate here on a visit from Seattle and was very impressed. My steak was one of the tastiest, most tender cuts I've had anywhere (including any upscale steak house). The gnocchi was outstanding. The prawns with the bacon, amazing.I didn't think Champaign had cool restaurants with awesome food...was I ever wrong!",
                "reviewer_id": "AQ4pew9LFwC3eUlZSFRZsA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00012923723319053072,
                    "positive_probability": 0.9998707627668048
                },
                "stars": 4
            },
            {
                "review": "Their hanger steak was served to me nearly cold. Shepherd's pie isnt real; they use ground beef- making it a cottage pie.Their desserts are expensive for the size you get, and quality. The brunches are a bit better, which merits two stars. They have a large selection of omelettes which are rather (surprisingly) generously filled.",
                "reviewer_id": "aX8hmnedCsrLJ7HmD8hwvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04121938628407994,
                    "positive_probability": 0.9587806137159214
                },
                "stars": 2
            },
            {
                "review": "Came in on a Sunday with my brother and his wife and young son.  Restaurant was very frendly and understanding of nephew wanting to walk around.  There was a little bit of a wait (about 20 minutes) which seemed reasonable to me based on how busy it was. However, after being seated, the wait for service was pretty bad.  The waiter tried to convince me to order the Bloody Mar bar service (where you make your own).  I didn't feel like messing with that and elected against it.  Probably a good thing since I overheard the table next to me complain about how bad the bar service options were.  Sadly, I had to remind the waiter 15 minutes later about my drink.  He apologized, and to his credit admitted that he had forgotten to put the order in.  Sadly, the bloody Mary was very weak and uninspiring when it arrived (tasted like straight up tomato juice with very little to it).  Eventually we were able to place our food order (I got the Migas).  Eventually that food came out.  The food was good. The Migas were crispy because of the cooked in tortilla strips.  It was a good amount of food and very tasty.  I would definitely be willing to try Radio Maria again if I was in the area.  Hopefully the slow service was just a fluke (I got the feeling the waiter was new as he couldn't tell us anything about their waffles as he hadn't seen them yet...).",
                "reviewer_id": "ayyC3EJRKIoa6p3W3qisNA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8980895832397674,
                    "positive_probability": 0.1019104167602406
                },
                "stars": 3
            },
            {
                "review": "Had the chance to visit this restaurant on a Sunday night.  Despite having seated most of the tables in the bar side of the restaurant, they seemed to have only one person actively waiting the tables.  It took 10-15 minutes to get our drinks...not cocktails, but diet coke and iced tea.  The waitress was friendly enough when she showed up to the table, but seemed relatively uninterested in doing so.We ordered several items from the tapas menu (no entrees) and other tables that were seated after us received their food before we did.  I agree with the reviewer below that says that tapas should be brought out as they are prepared, not all at once.  But sure enough, 45 minutes later all our food arrives at once.The food itself was all very good to excellent, but in hindsight it's the too cool for school attitude of the waitstaff that stands out in my mind, not the food.  That's a shame.",
                "reviewer_id": "B0_ToavrQMU3BvuQtxUW3w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3911392100951931,
                    "positive_probability": 0.6088607899048014
                },
                "stars": 2
            },
            {
                "review": "Cheese balls with mushroom, goat cheese. This place was out of this world with the creativeness of the appetizers. I'd definitely go back there and continue to explore their menu. The drinks were very good and from what I can remember there's more I need to explore on that front also!",
                "reviewer_id": "B1kIvY3NhgO4oYiLGwRoHA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22885628889936396,
                    "positive_probability": 0.7711437111006354
                },
                "stars": 4
            },
            {
                "review": "One of the best restaurants in town. Eggplant Frites-yum! Great date spot. You can choose from the casual \"lounge\" area or they have a more formal dining room for seating! Service can be \"meh\" at times but the bartenders are always on point. They'll mix up anything for you, it doesn't have to be on the menu.",
                "reviewer_id": "b8b_ljnLjmKUqYpsyGGeaA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08756794926913816,
                    "positive_probability": 0.9124320507308601
                },
                "stars": 5
            },
            {
                "review": "*hearts-in-eyes emoji goes here*I absolutely LOVE Radio Maria. I have only had tapas one time previous to this place, and that was in Barcelona. The atmosphere, decor, and food is downright enchanting. If you want to wow your first date - don't come here. They will fall in love with this restaurant and probably forget all about you. Ok but enough cheesiness, the food is great, even for a vegetarian like myself. I can't get enough of this place. I will say that the service was nothing to rave about - but it wasn't horrible. It also can be difficult to get a reservation/table on many nights - but that's a testament to how great it is.",
                "reviewer_id": "Bd1YoUtW4Hk68pW3J4hXYQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0036633783671028083,
                    "positive_probability": 0.9963366216328973
                },
                "stars": 5
            },
            {
                "review": "This place keeps getting better and better. I have to admit, it had been 3 years since I went back to Champaign but I am glad we were able to visit one of the restaurants I used to frequent. The tapas bar wasn't there when I used to come, but it is an excellent addition to this fusion style restaurant. My favorites were the egg plant frittes and the seared scallops. Hopefully it won't be another 3 years until I am back!",
                "reviewer_id": "Bg3FBXzPViMowB_mJcUnbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.022153607627543776,
                    "positive_probability": 0.977846392372455
                },
                "stars": 5
            },
            {
                "review": "This place is honestly a world class Spanish food/Tapas place.  The service is always awesome and they have a constantly changing menu that always includes things like cheese plates, steaks, fish, frog legs, with their goat cheese boursin stuff in lots of things.  Another reason going there is their great bar that has a beer selection which will please anyone who is as geeky about american craft beer as I am :-)",
                "reviewer_id": "BHq_bwUa1lw-6tD2O0c9Pw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6816943015660514,
                    "positive_probability": 0.3183056984339394
                },
                "stars": 5
            },
            {
                "review": "Stunning!Astounding interior!Amazing Bar!Look at the bar - the rail is a retired escalator handrail.  Look above the bar, and you can see the shroud from a vane axial fan - a big one, from the former University of Illinois wind tunnel.  Even the host station is a re-purposed tube radio.  The center of the bar is a drink dispenser, made from a re-purposed laser.  Gad - there was so much eye-candy, I had a blast!The tapas is simply amazing - every dish we ordered was good.  The prices were on par for what you pay in downtown Champaign, and my daughter was smart enough to get us reservations.  If you're bold enough to try a walk in, all I can say is good luck.  They are reserved to the hilt usually.All in all, a good meal.  We have eaten here twice, and love the place.",
                "reviewer_id": "bQJ6WFYAtBeKBG-GDvqv-Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2164776657810907,
                    "positive_probability": 0.7835223342189137
                },
                "stars": 5
            },
            {
                "review": "Awesome beer and wine selection, probably one of the best in the city. I mean, they serve absinthe! The atmosphere is great, very nicely lit inside, the bar its awesome, and they always have some crazy art on the walls.I also really love their tapas, it's a great spot to go on a date. Everything I've had there was suuuuper delicious. I also love their specials and they seem to have new ones all the time.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26283672973438416,
                    "positive_probability": 0.737163270265619
                },
                "stars": 4
            },
            {
                "review": "I went off of most of the reviews below saying that the food was a \"can't miss,\" but I was not quite as impressed. Got the vegetarian paella and fried chickpeas. Neither were as flavorful as I would have expected. The chickpeas were dry and bland and I normally love chickpeas! Would get the paella again, not the chickpeas.",
                "reviewer_id": "bVSEp_hGaGO5q0KympqkCA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8628890143337529,
                    "positive_probability": 0.13711098566624405
                },
                "stars": 4
            },
            {
                "review": "Oh Radio Maria, how I wish we could be in love.Radio Maria is like the girl your friends try to set you up with.  You hear how beautiful, how wonderful she is.  Then you meet her, only to find out she bites her fingernails during dinner.This restaurant has all the makings of a high class experience.  It has a pretty bar with house-infused liquor.  (I especially love the ginger vodka.)  There is a large tapas menu, a full service restaurant, and even a hostess!However, that's where the magical journy ends.  You enter the restaurant only to be told to wait.  You may, if you're like me, point out all of the empty tables and ask \"why can't I sit there?\"  \"Well,\" says the snooty hostess, \"those are reserved.\"  Really?  You have half of your restaurant empty and those are all reserved?  Ok, I'll bite.  Yes, we'll be happy to sit at the bar and have a drink and wait for \"about 15 minutes.\"At the bar, we order two delicious drinks.  They're made well, even though it took a little longer than it should considering there were three people behind the bar.  We decided to ask for the tapas menu so we'd be ready to order.  Sure, I don't mind that this one has food spilled on it.  After about 20 minutes of staring at the menu, not having any contact with the bartenders and certainly not seeing our promised table, we left, paying only for the expensive, but tasty, drinks.Will we go back?  Well....no.",
                "reviewer_id": "BZjl6W41tc5E2wWyvJ23gQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9136864639574871,
                    "positive_probability": 0.08631353604251132
                },
                "stars": 1
            },
            {
                "review": "Seems like the only Spanish restaurant in C-U area? Foods are good. But the price is a little bit high since it locates at downtown Champaign.",
                "reviewer_id": "C74BJGf0RuKdYKxjm7SDuQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6531496133081355,
                    "positive_probability": 0.34685038669186297
                },
                "stars": 4
            },
            {
                "review": "Best unique and fancy restaurant I've been to in downtown champaign. -service: amazing!-interior decor: definitely vintage/very dark (the more difficult it is to see your food, the more expensive the restaurant lol)-food: their cuisine was called \"new American\" so not belonging to any type of food, but more like a fusion. Ex. They serve a variety of things from paella, duck roast, ahi tuna, etc. very fancy plating. You're probably going to spend average $25+ per entree. Overall, I'd go there again but only if the occasion calls for something very special.",
                "reviewer_id": "cE6U049J8YXshwNNHQK6aw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2899931883103956,
                    "positive_probability": 0.7100068116896087
                },
                "stars": 5
            },
            {
                "review": "This is one of those restaurants that makes me wish I lived in Champaign/Urbana again. Even though it's been open for years, I didn't go until recently. We went for a brunch, and the food was amazing!My wife had the french toast and something eggy. Probably an omelet. The french toast was fabulous. I don't know what kind of bread they use, but it's perfect. She was able to taste some of the egg used, but I just tasted lovely golden syrup and cinnamon.The cuban was served on a fresh baguette. The meat was terrific, and so was the bread. The american fries ( I think) that we each got with the meal were perfectly cooked and seasoned.The decor is very cool, nice artwork hangs on the walls, and because it's downtown, it's close to Cowboy Monkey, The Art Theatre, and The Virginia theatre. VERY highly recommended!",
                "reviewer_id": "cExMtU0dgo06kLWAz3p4CQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0333329984965657,
                    "positive_probability": 0.9666670015034364
                },
                "stars": 5
            },
            {
                "review": "Hostess was delightful and I look forward to having her as a waitress soon. Food was good but chorizo lacked flavor and heat in my special omelette. Bloody Mary served in a wine glass? Really?Waitress was defensive and unprofessional to my friend who hosted me for brunch today to celebrate my birthday early. Not my first time here and not a best either.",
                "reviewer_id": "cxs2JbMOqwdZTz1cZcdcCg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2589840140248734,
                    "positive_probability": 0.7410159859751293
                },
                "stars": 3
            },
            {
                "review": "Radio Maria is a great off campus place to go because it has a different atmosphere than other places on campus. The food is pretty good, but the tapas I was not impressed by.  They were missing alot of key tapas meals, and the waitress we had the last time we went was very ditzy. None of our drinks were refilled, and it took forever to order.  Will prolly go back and hope that it's a little better. I really did like the atmosphere, and the food has potential.",
                "reviewer_id": "cyfi34ou4WMUqk4AiH_glw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011269416322975552,
                    "positive_probability": 0.9887305836770255
                },
                "stars": 3
            },
            {
                "review": "Nice restaurant in downtown Champaign.  Has a really nice atmosphere.  Good selection of wines.  I really wanted to like this place but in the end, their food is just forgettable.  I had the lamb once and that was a bit rough, not tender.  Also tried the salmon (or some other fish) once, also a bit overcooked.  Dessert menu was very standard.",
                "reviewer_id": "D38hx2ppvPq0ipo5e7JYnw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8164032779700162,
                    "positive_probability": 0.183596722029985
                },
                "stars": 3
            },
            {
                "review": "This is our favorite brunch spot. They always have rotating specials for me, the adventurous one and biscuits and gravy for my boyfriend. The Flaming Frida is delicious. Don't waste your time on the bloody mary bar. They never have any garnishes that are worth the money - no meats and cheeses here. Thats my main complaint, the bloody marys don't have enough garnishes. You're lucky to get an olive. I will also say that, depending on the day, the service can be really slow.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9803889065612134,
                    "positive_probability": 0.019611093438787933
                },
                "stars": 4
            },
            {
                "review": "Nothing at this restaurant warrants the cost. The tapas servings are tiny (for tapas); brunch is inventive but disappoints. The staff always act like you're wasting their time. This place sells an image of Euro-trendiness, but it's nothing more than that image. Go to Escobar if you want expensive food WORTH the cost.",
                "reviewer_id": "dXZaFzVVXVPK8Ih08ce-9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26932513343237413,
                    "positive_probability": 0.7306748665676295
                },
                "stars": 2
            },
            {
                "review": "Had group of 8 and all had terrific meals.  Good mix of fixed menu, tapas and entrees represented...all were excellent.  Seems like this is a never miss option for a great time in a cool atmosphere with tasty food and drinks!",
                "reviewer_id": "E75ghmbZSExPwGNR1puQyg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01548142349039466,
                    "positive_probability": 0.984518576509607
                },
                "stars": 5
            },
            {
                "review": "Radio Maria has a lovely interior and I love the idea of tapas. I was traveling with a colleague and after some research, we decided to give Radio Maria a try. For wine, we ordered a Pinot Gris from Oregon, but they didn't have it. So we selected a Pinot Grigio, which was good. For tapas, we ordered fried artichokes with lemon and feta, eggplant frites, seared tuna and the mixed paella. The artichoke hearts and the eggplant were great. The eggplant was drizzled with honey, which really enhanced the dish. The tuna tasted like it was on the verge of going bad. The seasoning was really good. The paella tasted lovely but was lacking the crispy bottom. It's clear they make the paella ahead. The portion was small but just the right amount.",
                "reviewer_id": "e_EwkkAQZIYumXtLkEqDlQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02769177308715691,
                    "positive_probability": 0.9723082269128525
                },
                "stars": 3
            },
            {
                "review": "Went here for brunch with my sisters.  The atmosphere was great!  I loved the massive beer list, build your own bloody mary bar and atypical menu.  I got an omelet with shrimp, avocado and corn salsa in it which was pretty freaking delicious!  Sampled every meal at the table which were all oustandingly good...but next time I'm definitely getting the fish tacos!Restaurant seems to run pretty smoothly...service was decent as well.",
                "reviewer_id": "EhlVg8ePwmRpB0C6OmE9QQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04059098958064928,
                    "positive_probability": 0.9594090104193523
                },
                "stars": 4
            },
            {
                "review": "I feel blessed whenever I eat here. The vibe is cool, and the food is great. All of it. Brunch especially--I got the pulled pork sandwich with sauted kale, cheese, and bacon and I basically cried of happiness twice. Would repeat.",
                "reviewer_id": "eIQwlepZ2qgvv3ZnCPfucA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20271065379219277,
                    "positive_probability": 0.7972893462078099
                },
                "stars": 5
            },
            {
                "review": "After being a loyal patron for seven years, I am done with this place. While they still have some great drink selections, the service has gotten so bad. On a Friday afternoon, I was one of six sitting at the bar. Two bartenders and 1-2 servers were working and it still took them 20 minutes to take my order. With the downtown Champaign scene evolving, this kind of situation is unacceptable.",
                "reviewer_id": "Evca5usoGT-QFX3YcFBIOQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7054906281479001,
                    "positive_probability": 0.2945093718521037
                },
                "stars": 2
            },
            {
                "review": "There are so many good things to say about Radio Maria. Their style is a marriage between old world 50's and the 21st century. The tables are decorated underneath and they are unique to every table. There are about 10 tables outside if you like sitting outdoors. The brunch menu may seem overwhelming at first, but you can narrow it down to your dish pretty easily. They have a wide selection of omelets. They also have egg dishes with rice and beans. It includes vegetarian options. I had the guava juice, churros, and smoked pork posole. It hit the spot. Try getting a slice of beer bread! It's hearty and is flavorful. The churros are fluffy and not too sweet. I am not familiar with real churros, but this one tasted good! The service for a Sunday brunch is slow. I had to flag the waiter down to take our order after 15 minutes of sitting and waiting. The tapas menu is extensive. Hands down, my favorite dish to order are the lamb meatballs. They are made with pinenuts and tender lamb and then are stewed in a seasoned tomato sauce. You have to try them! I also love the Paella. There are several different kinds, but I like the mixed because you get to try all the different seafood and meats. It is big, so plan on sharing or gorging yourself in awesomeness. It is on the pricey side, so I would make this the place to go when you want to treat yourself.",
                "reviewer_id": "eWjqh5F-2tHtWhZODsJAyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.047095193835414e-05,
                    "positive_probability": 0.999939529048076
                },
                "stars": 5
            },
            {
                "review": "Food and atmosphere was excellent. Wife and I went with another couple and the food was great, drinks and service were on point. Cool place in downtown",
                "reviewer_id": "EZ6UB9mX59z-RRy8TVkitQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6310834494591341,
                    "positive_probability": 0.3689165505408662
                },
                "stars": 5
            },
            {
                "review": "My husband and I recently ate at Radio Maria for dinner.  We'd had Sunday brunch and loved it at that time.  In all fairness, it started out wrong.  The employee seating us went to get us a table and was sidetracked by another employee at the entrance to the dining room and let us wait for at least 7 min. while he carried on an obvious flirtation/personal conversation with the other employee.  He finally looked away and saw us standing at the front door and that reminded him that we were still waiting.  I'm a relatively patient person but I was considering walking out at eating next door at Bacaro at that point - not because the wait was so long, but because we were so easily forgotten from the get go.  It was rude.The best I can say is that the dinner service left a lot to be desired (our waitress was tired and stressed) and the accoustics of the restaurant are such that larger tables are extremely loud, making it difficult to carry on a conversation in a normal voice.  The food was marginal at best although you have to give them points for creativity.  Wasn't a pleasant experience and my husband became very ill later that evening and lost his meal.  I wouldn't recommend it for dinnertime but may try again for brunch.",
                "reviewer_id": "f-zAy7aF6P3KGxmGjdSPXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.212712778054264e-05,
                    "positive_probability": 0.9999378728722317
                },
                "stars": 2
            },
            {
                "review": "Food is solidly good but not brilliant compared to tapas places I've been in other towns.  That being said I enjoyed the food and definitely will come back - it's creative, fresh, and varied.Kind of weird to have two kitchens/two menus that aren't coordinated - they start with an apology for it.Wine and beer list is plenty long and varied - flavors for everyone.  Plus, Tuesday is 1/2 off wine by the glass night - how can you beat that?Specials were very tasty - Mahi-mahi in parchment, and a local organic heirloom tomato salad w/orange zest and balsamic - yummy!Outside tables are great on a warm summer evening.Service at times a bit slow although great service attitude and personality by our server - as with any restaurant it depends on the person you get and the night you go...Agree with 3+ stars.",
                "reviewer_id": "fCWTp-snHN5YE54K0ElD1w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.584833576115778e-05,
                    "positive_probability": 0.9999341516642322
                },
                "stars": 3
            },
            {
                "review": "We went there for dinner and heard that the tapas plates weren't worth the money so we went with full sized entrees. Every dish was delicious and the flavors are surprisingly good for being in a small town. They have an array of holiday drinks that weren't bad. Pricey for being on a college student budget but delicious nonetheless",
                "reviewer_id": "fgaQKuljQcO9xTVzqL-81Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15593211406587745,
                    "positive_probability": 0.8440678859341202
                },
                "stars": 4
            },
            {
                "review": "I came here for brunch on a Sunday morning. The wait wasn't too bad for two people close to noon. There are tons of delicious sounding options on their breakfast menu, especially the benedicts, but I finally settled on the radio scrambler because it seemed to be a little of everything. No complaints here--the scrambler was loaded with eggs, cheese, potatoes, bacon, and gravy, all piled on some beer bread. By the way, the beer bread is fantastic! Overall, it was a great meal and I hope to be back again for brunch or tapas.",
                "reviewer_id": "fjQAOHSkRj-zbPvLJfvu3A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08940505138164306,
                    "positive_probability": 0.9105949486183537
                },
                "stars": 4
            },
            {
                "review": "LOVE this place, always have.  One of the few restaurants that is consistently different.  Having lived in and round C-U for waaay too long its easy to see that many places are often derivative, dull, and lack character (a good example is the bar across from RM).  I make a point of going any time i pass through town and find myself craving Radio food when I'm away for too long.",
                "reviewer_id": "G8eT2Tw8qas9v9GIusdRRw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08184178590358383,
                    "positive_probability": 0.918158214096414
                },
                "stars": 5
            },
            {
                "review": "Radio Maria is at the top of the restaurant heap in Chambana for dinner.  Top 5 at least.  Haven't been for lunch and I haven't experienced the tapas yet.  I LOVE the atmosphere because it is understated and eclectic at the same time.  I love it when a restarant has the confidence to quietly state its intent rather than screaming \"look at my personality!!!!!!!\"  The radio hostess stand is lovely.  And I'm a sucker for their Crass-esque vintage graphic design.Excellent wine selection.  The Reisling and Gewuiztraminer are my favorites.The service has always been friendly without being intrusive.My food has always been cooked perfectly.I can't say I agree with the claims that the menu is uninspired.  The coffee crusted filet with espresso drizzle and savory vanilla sauce is not exactly something you can get anywhere.  I think there is a fine line in a place like Champaign between daring and scary.  You can tell by the popularity of places like Olive Garden in this town does not have the most adventurous pallate.  Fennel, Saffron, hearts of palm, plantain, poblano chilis, mole... these ingredients are all \"hot\" in celebrity cuisine scene and at the same time pallatable items for most people.  It might not be truffles and quail eggs, but it is modern and accessible.  Oh yeah, and delicious.",
                "reviewer_id": "h_aCvGeKvptFw5MnfCuK-Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0017477388049476155,
                    "positive_probability": 0.9982522611950487
                },
                "stars": 5
            },
            {
                "review": "Good food from a wide selection of ethnicities - cajun, indian, latin american, but not fusion.  Just all on the same menu.  Kind of hard to explain.  They have just about everything - seafood, duck, lamb, plus the standards.  They try to be inventive but usually are not too adventurous - still, the meal satisfies.  I think they could let their hair down a little more by putting some riskier things on the menu.  Good selection of wines and beers, plus margarias and sangria.",
                "reviewer_id": "HANb8-8InWnju-XzBQQSBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.24248383104406057,
                    "positive_probability": 0.7575161689559425
                },
                "stars": 3
            },
            {
                "review": "I went here twice for dinner and once just for drinks.This is the perfect place for a date night- it has a really chill, artsy vibe once.I went here for dinner once and it was very crowded but we were able to eat at the bar. I had a hot pot, which was delicious but my mother ordered something that didn't take as long and her food was cold. They were very nice about it though and reheated her food for her.When I came for drinks, the server was very accompanying when our group wanted to move from inside to outside and had confusing orders.The tapas are delicious- especially the eggplant frites and the goat cheese. You could come here a million times and never order the same item.Next on my list is to come here for brunch because I've heard amazing things.",
                "reviewer_id": "hpaHRiqdYcDNlLJxo5C9JQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00010877413214784693,
                    "positive_probability": 0.9998912258678501
                },
                "stars": 4
            },
            {
                "review": "I went here for Valentine's Day and was slightly disappointed. While the soft lighting and tiled ceiling lends a lovely ambiance, the food and service did not stand up. It was a very busy night, but our waitress was obviously assigned to too many tables. It too a long time for her to take our order and she forgot to bring the basket of chips initially. We were also seated by the window and the heating was poor. I was lucky I was wearing a warm dress, because I saw people near us having to wear their jackets while dining. I enjoyed my appetizer of figs with honey and gouda and the chips had a tasty aioli dip, but the main courses were less impressive. I had the Torta Maria, which sounded fascinating, but it ended up being a heap of flavors that really didn't stand out. My date's chicken breast was teeny tiny and he did not enjoy the accompanying slaw. The dessert menu was a bit boring, but the pot de creme was good. I also tried the tapas bar recently, which was a slightly better experience. The salmon skewers with cucumber were perfectly spiced and delectable. The balsamic fruit with manchego on bread was good as well. However, the lamb skewers...they were like meatloaf on a stick. The tapas are a good way to try several dishes, but they are overpriced considering how little you get and that I could probably grill salmon and put it on a stick myself. The exception would have been if the little dishes displayed exceptional artistry, such as Cafe Luna's.",
                "reviewer_id": "HqaXK9toBpQdcz-0-rVwKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00031116265895389105,
                    "positive_probability": 0.9996888373410542
                },
                "stars": 3
            },
            {
                "review": "When we first moved here everyone kept recommending Radio Maria and I have no idea why. We went there a few times. The service was fine, the atmosphere was okay. The food was awful.  Everything contained way too much garlic. You could smell and taste the garlic in everything. I think it's an okay place to grab drinks and sit outside on a nice evening, but I wouldn't try the tapas everyone raves about.",
                "reviewer_id": "Hue_g9ZzrNWX65R0O8ifVg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29946942614692235,
                    "positive_probability": 0.7005305738530765
                },
                "stars": 2
            },
            {
                "review": "Radio Maria is definitely one of the nicest dining options in downtown Champaign. I remember going almost two years ago when I first visited Champaign, and really enjoying it. I've gone again a couple times after moving here, and I was never disappointed.The restaurant is divided into two different dining rooms: one that serves more traditional entrees, and another (the larger one, where the bar is located) that serves predominantly tapas. I don't really understand why they can't serve both types of food in both rooms seems it looks like they share the same kitchen, but that's a detail. I would recommend going for the tapas (the other room is a little more *stuffy*). I've now tried a bunch of dishes, and everything has been good if not very good. A few highlights among the tapas that I tried: the spicy shrimp in chile-lime sauce are delicious, as are the anchovies (if you like anchovies, that is), and the scallops. They also usually have a bunch specials, which I would recommend trying. Not to forget, they have an extensive wine list (including a pretty good selection of wine by the glass), and a full bar. The drinks are particularly cheap (at least compared to NYC prices that I am used to), and I'm always amazed at how low the bill is in the end: you can have a really nice meal with alcohol for $40 to $50, which is a pretty good deal considering the quality of the food. The service has also always been good.  4-1/2 stars.",
                "reviewer_id": "igrgFZl9wDohSem0UyoP6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00042855675764314323,
                    "positive_probability": 0.999571443242357
                },
                "stars": 5
            },
            {
                "review": "I just finished dinner here about an hour ago, and I'm still wondering how Radio Maria managed to get all of this attention.  I guess their HUGE wine/beer/drink list was pretty impressive, but the food...was not.  My first disappointment was in the size of the menu.  I looked it up online and they seemed to have a wide array of choices, when I saw the actual menu, I think there were 5 entree choices, in addition to a wide variety of tapas.  On top of that, the one dish I wanted, was sold out, so I went with the Smoked Duck and Brie Pizza.  I mean, it was OK, there was a good amount of duck on the pizza but the whole time I was craving more brie!!  They could have seriously doubled the amount of brie on the pizza and it still might not have been enough, I could hardly taste it.  Also, it wasn't really a pizza at all, more like a cold flatbread, so be forewarned.  I also ordered a small side salad.  It was a delicious spinach salad, but lived up to the \"small\" definition....AND it was $6--give me a break.  If I'm looking to drink, maybe I'll stop by next time I'm in town, but I'll hit up K.O. Fusion or Jim Gould over this place ANY day!",
                "reviewer_id": "iHKeJXDXavh5bIfc2l6ofA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.48713632416510805,
                    "positive_probability": 0.5128636758348917
                },
                "stars": 2
            },
            {
                "review": "The food was solid but the service, the last couple of times I was there, was a little lacking.  The servers were not all that attentive to our needs and our drinks were never refilled through the meal.  This place is a local favorite and definitely somewhere to visit.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02038450905509089,
                    "positive_probability": 0.9796154909449064
                },
                "stars": 3
            },
            {
                "review": "I'm a huge fan of Radio Maria, but their Valentine's Day Dinner left a very bad taste in my mouth and it wasn't the food.  Radio Maria is my favorite restaurant in Champaign.  The food is top-notch and the atmosphere is one of a kind.  But my wife and I had their Valentine's day menu this past weekend.  The food was great, but not for the outrageous cost.  It was $50/person plus drinks for a \"tasting\" menu that wouldn't have filled up a mouse.  Normally the value/price ratio is excellent.  I always felt like the food was worth the cost, but not the valentine's day fixed menu.  The high price combined with lack luster service took the sizzle out of what could have been a hot night.",
                "reviewer_id": "in-aaYjscUEeM195BiAYDQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08329054316713766,
                    "positive_probability": 0.9167094568328696
                },
                "stars": 2
            },
            {
                "review": "We used to love the place because it is one of the few places that you can get paella in Champaign. However, last night when we were there, the rice of the paella we ordered is not fully cooked. It was stiff and hard to chew. Although they sent it back to re-cook, the rice still comes back partially done. We ended up canceling the order. This is unbelievable. It seems that they cannot manage to get the rice cooked and the chef failed to solve the problem! We were very disappointed at the paella and will definitely not come back to the restaurant again!",
                "reviewer_id": "InA4RRedJ_sjl-mcVNGOCA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04099861182200123,
                    "positive_probability": 0.959001388178004
                },
                "stars": 2
            },
            {
                "review": "Please, Radio Maria owners, read these reviews and take corrective action! Do not rest on your laurels because that way failure lies...I don't get to go to Radio Maria as often as I used to. It has a fond place in my heart, which is probably good for them as I'm not dinging them as much as I could in this review. RM was one of the first hip businesses that launched the downtown revival (along with The Blind Pig, v 1.0) and for that I have much love.The last few times we've gone, we've sat outside and had tapas. Now I'm no tapas expert, but I believe you usually order a bunch of tapas and they come out one-at-a-time to your table so you can experience each dish on its own merits.  RM, however, always sends out all the tapas all at the same time. Everything becomes a mish-mash and it's overwhelming and nothing stands out.  You also immediately get abandoned by the waitstaff so you have to wait forever to order another drink or get/pay your check. Also, the pretty pretty people who work there don't like kids. That would be fair if we were dragging the kids inside and interrupting the restaurant. But even if your kids are well-behaved and you're sitting outside, you catch a real snotty attitude. I am happy to report, however, that they do have a real highchair. When my eldest was a baby they had a beautiful vintage deathtrap highchair. They now have one that is still aesthetically pleasing, but without all the metal.The restaurant itself is still lovely. I just wish they'd shape up their staff so it wasn't so depressing to interact with them.",
                "reviewer_id": "IvBXSiwg1hpS11J6zxu4sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0218877382789633,
                    "positive_probability": 0.9781122617210232
                },
                "stars": 3
            },
            {
                "review": "As I waited over 15 minutes for the waitress to return with my initial drink order on a slow night, I hoped the tonic wasn't as flat and flavorless as the last time. It was. I ordered a Bell's HopSlam the next moment I saw the waitress, and it came only 5 minutes after I pained through the flat gin and tonic. When the tapas came 45 after my wife and I arrived, we enjoyed the mussel in miso broth special and bacon-wrapped rainbow trout with aoili. The Spanish tortilla was burnt. Luckily, the harissa helped cover up the carcinogens. Now, I wait for the waitress to return so I can ask for the bill and go to a bar with responsive service. At least it's beautiful outside.",
                "reviewer_id": "ivE2Qe4kYjYaX_l5qbWUrg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13782221297815955,
                    "positive_probability": 0.8621777870218422
                },
                "stars": 2
            },
            {
                "review": "We really enjoy this place.  Service is great.  The Sunday bartender makes the best bloody Mary's and the food is not bad as well.  We have tried several different things on the Sunday breakfast menu and have not been disappointed.  We usually sit at the bar so we see all the servers.  All are very nice and friendly.  Things appear to move quickly and efficiently from the kitchen",
                "reviewer_id": "JcUNnWIzXZFPu_qHcSO4xg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7933701731523634,
                    "positive_probability": 0.20662982684763903
                },
                "stars": 4
            },
            {
                "review": "Radio Maria really is a bright spot in downtown Champaign. It's sort of criminal that its average rating isn't higher (particularly compared to duller visits like the unremarkable Esquire's and Applebeesian Destihl).While there may be little in Champaign to compare to bigger-city fine dining, Radio Maria (and Bacaro, to a more intimate extent) shoot pretty satisfyingly close to the mark. Radio's selection of beer and spirits is dizzying and its bartenders have been, in my experience, charming and skilled. Their tapas menu is a little uneven, but with that topography come some nice peaks.For sit-down dinners, there's a dining area and outside seating, both of which are quite nice. The dinner menu is small but far more evenly excellent. Their desserts are also wonderful. Other restaurants in the area with comparable pricing can't deliver meals this nice.And finally, go to Radio Maria for brunch. You'll spend about as much as you might at, say, \"Le Peep,\" but your meal will be ten times as good. Getting there at 10:30 on a weekend morning and sitting outside off North Walnut Street is a pleasure unique to Champaign, and it's one I'll miss when I'm gone.",
                "reviewer_id": "jKsHUKhPseOIL3vY8WaxNQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.5532836574521765e-06,
                    "positive_probability": 0.9999964467163595
                },
                "stars": 4
            },
            {
                "review": "I like Radio Maria. The ambience is nice, the waiters/owners are friendly, and I like their drinks and food. I recently went this past week, and snacked on hummus with roasted veggies and pita, patatas, and cheescake. The hummus is sooo good- and they serve it with toasted pita. The patatas were just okay, but I'm pretty sure I burnt off all of my tastebuds when I tried them, so that may be why I can't give them a decent description. The cheesecake was delicious. I drank orange frescas, and did a lemon drop shot. It was very good- I was w. a group of about 10 people, and the service was speedy and friendly. Please please go here over Boltini- much less pretentious.",
                "reviewer_id": "jNvOk1erftOebAU_EqHszA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9662857170368433,
                    "positive_probability": 0.0337142829631614
                },
                "stars": 4
            },
            {
                "review": "If you are looking for frisbee-sized plates full of food, look somewhere else. However, if you are looking a quality experience with an amazing staff, then Radio Maria's should be at the top of your list. Great and unique food sets them apart from the crowd. Their tapas are creative and delicious. You won't be disappointed unless you you expect or demand a ton of food. Radio is all about the flavor and passion. To me, that's much more important.",
                "reviewer_id": "JUFox9PN8wi-b5FRW1zMaA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8948588722879607,
                    "positive_probability": 0.10514112771204102
                },
                "stars": 5
            },
            {
                "review": "My first visit to Radio Maria and I love it. Kelly, our server, was quick, patient and polite. I had the lobster omelette and my daughter had the lobster eggs Benedict. I would only suggest that they increase the lobster to other meats ratio in their omelettes. The greatest discovery was their Mexican coffee which reminded me of a blend I drank before in my home country of Guatemala. Thanks Radio Maria, we will be back.",
                "reviewer_id": "K2KJj1KIasyrrVD2jMJRXQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0012591797069808409,
                    "positive_probability": 0.998740820293021
                },
                "stars": 5
            },
            {
                "review": "Service was a little slow but great food and an interesting atmosphere.",
                "reviewer_id": "kd3yd-ZxoZ4q2-8eMD43Qw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4218670382622663,
                    "positive_probability": 0.5781329617377338
                },
                "stars": 4
            },
            {
                "review": "This is our go-to date night dinner out. I have never had a problem getting a gluten free meal here.  I'd give it a 4.5 star rating if I could!I haven't been disappointed with a meal- we've tried the coffee crusted fillet, scallops, hanger steak, duck breast, ahi tuna and a few other specials! Always just the perfect amount and gluten free! One complaint is that the menu is rarely updated. The last time we went they added an acorn squash risotto to the appetizer list and it was fabulous but new items are super rare.",
                "reviewer_id": "kONJ1qX4PboVMGUJssD02g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025420284754125316,
                    "positive_probability": 0.9745797152458664
                },
                "stars": 4
            },
            {
                "review": "Food was creative but a bit off the mark: 4/5. Service was super slow and less than stellar: 2/5We arrived around 11:30 on a Sunday morning and were told we would have to wait 20-30 minutes since we hadn't made a reservation. Ok, fine that seemed reasonable enough and maybe would be a testament to the quality of the restaurant, I figured. Time easily killed by a walk around downtown. The hostess said that we could leave our phone number with them, and they would call us when it was our turn to be seated. A nice touch, I thought.We never received that phone call, but wandered back of our own accord some 15-20 minutes later, and our table was ready. We received menus promptly, and then spent the next fifteen minutes waiting for our waiter. When he finally showed up he did apologize for not coming by sooner, asked us if it was our first time there (yes, for myself and one other in my party), and then proceeded to describe Radio Maria's menu: the uniqueness of the Mexican inspired breakfast items, the deliciousness of the omelettes, etc. I think I would have really appreciated that primer if I had not already had the opportunity to read over the menu several times while we had been waiting for him to show up. He seemed really startled when we informed him we were actually ready to order, because clearly he was not ready to take them, citing the drinks he had to bring to another table. So cue another wait...All in all, we saw two tables that had been seated after us order food, receive their food, finish eating, and pay in the before we had gotten ours. Which points to less of a systemic problem (because, clearly, some patrons DO get their food in a timely manner), and maybe more of an individual issue. Our waiter did seem very harried, and I would venture to say even distressed, so maybe there is an issue with the division of work. I did notice that another employee stepped to help with water refills, but during only the last quarter of our meal.FOOD : We ordered: two veggie masa boats, vegetarian Eggs Benedict, Mexican coffees,and a side of beer bread.Rated from best to worst:Veggie masa boats (4.5/5): perfectly cooked eggs, and the masa black bean and tomato combo worked for me. What did not work: the goat cheese. I actually would have liked something a wee bit less salty and more melty, but I was in the minority at my table on this one.Vegetarian eggs Benedict (4/5): I guess I am used to versions with meat, but I could have done with a little more salt or other sort of seasoning. The slice of tomato/avocado combination didn't do anything for me.Beer bread (2/5): really dry and cakeyMexican coffee (1/5): Came with a half-inch of spice grounds at the bottom, and was cloyingly sweet (The upside to this is that a refill of regular coffee, added to the grounds, makes for an actually drinkable beverage).Overall... meh. I could overlook the service issues if the food were truly crave-worthy, but I did not find that to be the case.",
                "reviewer_id": "KP6tU6COYVQju8ti27DNrg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005580579760974722,
                    "positive_probability": 0.9994419420238921
                },
                "stars": 3
            },
            {
                "review": "I went with a friend and sat outside. It was a beautiful night and our server was very personable and helpful. She helped us order some things that she thought we would like based on savory and sweet and she didn't mind repeating specials and such for us.We got three tapas and an entree and it was all great.A bunch of people told us to try the plantains. They were our least favorite. They weren't bad... just plain.We also got the fried goat cheese, which was served with a honey sauce and bread, and arancini, mozzarella-stuffed risotto. They were both excellent. We had their gnocchi special which was absolutely delicious. It was definitely worth the trip.It is definitely a more casual place. The servers weren't around every minute, but I really didn't mind. It is pricier, but worth the money. I think that it is a great place to relax and spend some time with some great food.",
                "reviewer_id": "kQzlxWnKwIwJkkgtrZisvg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5421916808729114,
                    "positive_probability": 0.4578083191270864
                },
                "stars": 5
            },
            {
                "review": "Nice upscale-casual place in the heart of downtown Champaign. Their menu varies, but just tonight I tried a couple of tapas (fried mozzarella and calamari) and the mushroom ravioli. All were delicious and well presented.My warm chocolate cake dessert, however, tasted soggy and generally unpleasant. It came with a scoop of some oddly flavored ice cream---I think it was meant to be mint, but it tasted more like horseradish. Not the best way to end a dinner; fortunately the rest of the meal was good enough to make up for it.Our server tonight did a thoroughly wonderful job. But overall service in the restaurant felt slightly slow, even on this quiet Monday night when my party was one of only two or three in the entire restaurant for a whole two hours. Halfway through our meal I noticed a middle-aged woman abruptly exit the restaurant despite pleas from her waiter. There was no commotion: it appeared the customer left, after settling down but before ordering, simply to protest the service speed.If I had to nitpick, I'd add that the men's restroom was a little worn and unkempt in the details for a restaurant of this caliber. The lock was also broken. Holistically, though, I had a great dining experience here.Quick tip to first-time diners: Free parking is kitty-corner to the restaurant in a third-party lot. Spaces numbered 1 through 30 are reserved for this restaurant's patrons.",
                "reviewer_id": "LBvI6vU-vTrfjH0IQQVsMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0033141620031143146,
                    "positive_probability": 0.9966858379968687
                },
                "stars": 4
            },
            {
                "review": "Friendly, quick. We were in before dinner norm hours.  Small portion on garlic shrimp , pork tacos stale shell. Salsa was tasty, pork bland.  Nice looking place.",
                "reviewer_id": "lDg_yaShiGMT6K7fWFVAaQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7713743583756061,
                    "positive_probability": 0.22862564162439394
                },
                "stars": 3
            },
            {
                "review": "Only had a couple tapas here one time, but they were good. Brunch was awesome though. Small menu but so delicious. In summer you can sit outside and it is something I will definitely repeat.",
                "reviewer_id": "leIgp16pp6_1feLNEtL_JA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2738073731552635,
                    "positive_probability": 0.7261926268447355
                },
                "stars": 4
            },
            {
                "review": "Tapas Bar! Sat at the bar with a friend and the bar tender was AWESOME! He was so nice and let us try a bunch of wines until we liked one. The ambiance was great because it was dark with cool lighting. It was open late which worked because it's a quiet town. Highly recommend this place!",
                "reviewer_id": "LfBmJlEEkrEUAgAE8NMFjA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01217224297494758,
                    "positive_probability": 0.9878277570250493
                },
                "stars": 5
            },
            {
                "review": "Excellent! Great service - very knowledgable, friendly, funny, and efficient wait staff. The food is always amazing and the drinks are delicious. Brunch is especially delectable.",
                "reviewer_id": "lJDHOydz55akAkxNGvdXCw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1320992424078006,
                    "positive_probability": 0.867900757592199
                },
                "stars": 5
            },
            {
                "review": "I've been here for both brunch and dinner. Dinner was mediocre at best, but I enjoy their brunch. It is likely the best brunch in Champaign-Urbana. The french toast is a huge serving and delicious. The omelettes are nice as well. To avoid a long wait on the weekends, I would recommend getting there at around 10:30 a.m.",
                "reviewer_id": "LQA6_s-oGR8BMZw0ojTL-Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6263478462110318,
                    "positive_probability": 0.37365215378896777
                },
                "stars": 4
            },
            {
                "review": "I am giving this restaurant 0 stars.  I don't want anyone else wasting their money at this establishment. Here goes:My fellow students and I had organized a fundraiser to be held at R.M. We were raffling off some of our artwork and had ordered a substantial amount of food because we were expecting 50+ guests. Around 8:30pm, there was an AWFUL stench that filled the bar area, followed by a watery mist that began to fall from the ceiling along the west wall of tables. There were a number of people sitting in this area (myself included), who were covered in this putrid water (I had to go home and shower!!!). The food we ordered which was on a nearby table, was also covered. I alerted the manager who said to me \"It must be our pipes again.\" Again? This has happened to other customers? The manager then called the fire department in to inspect the pipes running along the ceiling, while our guests (those who were left) crowded awkwardly around the bar.  The manager took no action in remedying the situation. Our food was NOT replaced, and the water on the tables and chairs was NOT wiped up, so that the guests could resume sitting. The artwork that was hanging on the wall was also damaged by the water, and was NOT compensated for. Radio Maria had quoted us for the cost of food prior to the event, but when we received our bill, it was over twice what they had quoted. Worse yet, the manager only refunded us the cost of one cheese plate. Thanks. You're swell.  This matter is still not resolved as the owners of Radio Maria seem to think they owe us nothing. I disagree, and until we receive just compensation, I will not be returning and hope you don't either.",
                "reviewer_id": "LRxfgI_6vgJpBpP_W_pmyQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7248576298045394,
                    "positive_probability": 0.2751423701954719
                },
                "stars": 1
            },
            {
                "review": "On a return trip from the mid west, we were lucky to walk into Radio Maria.  From the outside it wasn't very impressive.  Once inside, we took a seat a the bar.  The bartender was really knowledgeable and there was a great selection of beer, wine and spirits.  The menu runs from an inventive tapas list to unique entrees.  We were blown away by both the house smoked pork tacos and the duck breast salad.  Between the wonderful bar and the outstanding food, we will be stopping back next time we are able to come through Champaign!",
                "reviewer_id": "LSQx7Ima6U3ohtX_pbJ9cA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10090450826848646,
                    "positive_probability": 0.8990954917315074
                },
                "stars": 4
            },
            {
                "review": "I have been to Radio Maria before and had good experiences, but it has been a few years.  I took my family there for dinner during graduation weekend since I had just graduated from law school.I understand that graduation weekend in Chambana can be really crazy.  However, the service we got was unacceptable.  We ate dinner at a different restaurant in downtown Champaign the night earlier and did not have anywhere near the problems we had at Radio Maria.  Our water glasses were constantly empty, the waiter would go a half hour or more without stopping by our table, he would forget to do things we requested (i.e. fill our water glasses), etc.  The restaurant is also EXTREMELY noisy.Given the prices at the restaurant, we really expected better.  Further, although most of our food was pretty good, my grandparents could not eat the hanger steak they ordered to share.  My grandparents cannot do spicy food and the steak ended up being totally caked in a pepper crust.  The bottom of the menu says items on the menu contain ingredients that are not listed, but that is in very small letters and I didn't even notice it.  Apparently, my 90+ year old grandparents didn't notice it either.  My boyfriend tried the steak and said it was pretty spicy, so it seems strange that the fact that the meal is spicy isn't on the menu.My grandpa also got meat that was not good quality.  It was very tough and he said it was inedible.  The restaurant handled the problem graciously, however, and took the steak off the bill which we appreciated.Nevertheless, it is unlikely I would go back to Radio Maria or even recommend it to other people.  I will be here for several more months while I study for the bar and even though I always thought of this place as one of the nicer restaurants in town, I was really disappointed.  There are restaurants in Chambana that have great food for better prices.",
                "reviewer_id": "m8_0b2VSVu0eiqSG08hnHA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0046831020182386334,
                    "positive_probability": 0.995316897981755
                },
                "stars": 2
            },
            {
                "review": "Great service, steaks were rare, but they fixed them immediately & were very nice. Very pricey, but a great night out.",
                "reviewer_id": "marVQzJi1GZKlbt5qLWuZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07793733142207522,
                    "positive_probability": 0.9220626685779268
                },
                "stars": 4
            },
            {
                "review": "A great salsa dancing club in the evening hours!  I've never been here for lunch, but the atmosphere is great in the evening.  $5 to get in and then salsa dancing all night!  There's a full bar if you get thirsty and two dance floors. Salsa music is played and danced to--a welcome alternative to college kids bumping and grinding while sloshing cheap beer over the rims of cans.  Even if you don't know how to salsa come on by; you might meet someone who will teach you!I will certainly try out lunch here at some point.  In the meantime, check it out on a Friday or a Saturday night!",
                "reviewer_id": "MNec5hNFpv3GwQNXnO6NSA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8710948611877618,
                    "positive_probability": 0.12890513881224538
                },
                "stars": 4
            },
            {
                "review": "I have always enjoyed myself here. I've dined and drank and drank and drank.A few highlights of Radio are: 1) their Absinthe service, which is quite a production. I don't feel like I can really do it justice by describing it, but you will not be disappointed if you order up a couple Absinthe drinks. 2) They offer \"The Wheel\", which is a 3.5 oz shot of each of their beers on tap. They have about 28 beers on tap, and many are the darker craft ales, which in addition to being really tasty, are higher in proof. You need a couple of people to do this right, and there are some \"rules\", but if you are already planning on cabbing it home, this is a great way to learn about beer and get drunked. 3) Their kitchen stays open all night. 'nuff said. 4) Radio is one of the very best places to sit outside on a nice summer night. Get a table at dusk, put your back to the window and watch the night unfold.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.2055273197120266e-05,
                    "positive_probability": 0.9999879447268067
                },
                "stars": 5
            },
            {
                "review": "The ambience at the bar is really exceptional.  We always sit at the bar for tapas.. You must be in an experimental mood, this food is nowhere near \"normal bar food\".  The sea scallops and the seared tuna will make you crave more.  The bartender can accomodate any request, with a passion.  We have him making key lime pie martinis, and they rock.   Fun place. Ultra Cool. Super Hip.",
                "reviewer_id": "NXZNi9v4lS2GOwkxPuGf5g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9638221250341997,
                    "positive_probability": 0.036177874965805185
                },
                "stars": 4
            },
            {
                "review": "Delicious, loved the tapas and the paella. Very good food, a little pricey but worth it for a nice dinner out",
                "reviewer_id": "o_xI4gJDuJmN6wT_8DED7g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5951535091856599,
                    "positive_probability": 0.40484649081434043
                },
                "stars": 4
            },
            {
                "review": "I had Saturday brunch here this week and was terribly disappointed.  In the past its Radio Maria has been nothing but fantastic, but all they had for the lunch menu was a set of sandwiches.  Really nothing exciting at all.  Make sure you check to see what they're serving that particular day before you go for lunch.",
                "reviewer_id": "oAKmFrtTEoRY5VpNg9oQvA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8023796668954135,
                    "positive_probability": 0.19762033310458232
                },
                "stars": 3
            },
            {
                "review": "i'm from los angeles, the land of many-a-radio maria - so really, i like radio maria because it feels like a slice of home.  i've been three times so far, and frankly i have to say that nothing has blown me away, but everything i've had has been pretty damn solid.first time i came for lunch, and had a portobella/goatcheese/pesto sandwich thing, and it was delicious.  not very unique but good eats.  i came for dinner the same night and enjoyed the pan seared peppercorn crusted tuna which again was not a unique dish by any means but solidly executed.  i recently went back for the tapas - their piquillos rellenos were flavorful and the portobello entree was perfect.  what i admire about the food here is that they aren't scared of flavor, which is something ive noticed happening in fusion-type restaurants.  ALSO, their drinks are marvelous. pricey but innovative!",
                "reviewer_id": "OdL7XAqENNpR7A1Z5yMPpg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.806988612790788,
                    "positive_probability": 0.19301138720921374
                },
                "stars": 4
            },
            {
                "review": "Came here for my birthday. Was greeted at the door by the host and led into the dining room that was dimly lit by candlelight. We ordered a couple glasses of pinot noir and were happy with their selection. Our appetizer, the broiled goat cheese, was amazing. The grilled bread provided great texture to the meaty pumpkin seed and spice spread and the divine creaminess of the goat cheese. Our entrees were the two dinner specials for the evening, seared diver scallops and a filet. Our scallops were perfectly cooked and seasoned. The accompanying puree had pieces of bacon which perfectly complemented the entire dish. Our filet was a beautiful medium-rare piece of meat that just melted in my mouth. The bourbon demi glace and gratin brought the dish together into a very enjoyable experience. We tried two desserts, the molten chocolate cake and the green tea white chocolate mousse. I absolutely loved the mousse while my partner preferred the chocolate cake. The best part of the rich chocolate cake was the fresh mint ice cream that came with it. Overall it was an amazing dinner. Go to Radio Maria and order their dinner specials. You will not be disappointed.",
                "reviewer_id": "oxNlnH4g7lBh3Iuzv6jdNA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.016037955410337274,
                    "positive_probability": 0.9839620445896773
                },
                "stars": 5
            },
            {
                "review": "The sangria here is awful. I think it was a tequila sunrise. The food is greasy and not in a good way. The only thing good was the goat cheese. But it is goat cheese. How can you mess that up?",
                "reviewer_id": "PD2PYKPH772yu6V9w_eGKA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6398195092610461,
                    "positive_probability": 0.36018049073895403
                },
                "stars": 2
            },
            {
                "review": "Order the coffee rubbed filet - you will not be disappointed. I have had it 3 times in the past 5 years and it continues to be outstanding. 3 of our 4 diners ordered it - all had spotless plates.",
                "reviewer_id": "Pdxs1vvHF0PSxHyF9U6uYg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1504666901708794,
                    "positive_probability": 0.8495333098291215
                },
                "stars": 5
            },
            {
                "review": "I can't speak for the bar and restaurant itself. We went to a wedding party where the party closed the place for the evening.As a party venue, Radio Maria was really great. I love the old architecture and the period decorations. Yet, they have a modern touch also, so I guess you would call it eclectic. When you walk in, the bar is is front of you. It is large, and I would guess that it is very well attended. (Lots of people tried to get in but were turned away due to the party.) They had one of the largest liquor selections I've seen, and they even have infused liquors. I tried the maple-bacon burbon - good, but a little too sweet for my tastes. Their infused liquors are all made on premises. The bartender told me he did it himself - and for the party, he wore a kilt.The dining room is large. We had a limited menu with four choices and we all pre-ordered our meals. I have to say that the salad served before the dinner was really excellent, fresh, simple and just the right amount of dressing. I can't say as much for the meal - I had smoked ribs. They were pretty tough, but did have a good taste.They also have tables on the sidewalk which we took advantage of. Topping the night off by sitting outside, drinking bourbon, eating dessert, smoking a cigar and watching the people walk by ended the night with a flair.If I make it back to Champaign, Radio Maria is definitely on my go-to list.",
                "reviewer_id": "pI0gVtXAMosxePzLoCwMvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006751324190554693,
                    "positive_probability": 0.9932486758094436
                },
                "stars": 4
            },
            {
                "review": "Love this place! Amazing food, I would recommend the pesto omelette!! If you go there at night you've got to try a beer that you have never had. Love the selection and proves are reasonable.",
                "reviewer_id": "piZI7D8fa-iV68zj2ZzN4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3435744335189003,
                    "positive_probability": 0.6564255664811012
                },
                "stars": 5
            },
            {
                "review": "I use to go to Radio much more often, but lately it seems to have fallen off the wagon. Ok so half off wine night is nice, but other than that I try to steer clear of RM and either go to Carmons for food or Quality to drink. The food seems uninspired and the quality of ingredients is average. I do like the decor of the bar. What happened to this place?",
                "reviewer_id": "pJV6MeQbcrwUvwTZNDpHDA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8878583689505184,
                    "positive_probability": 0.11214163104948134
                },
                "stars": 2
            },
            {
                "review": "Huge wine list. Great service.  Brunch menu is fantastic.  Love the Masa boat and the Mexican Cofee!",
                "reviewer_id": "pTTw_Z9U_RxNZxtDkkgSyQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9074075569742613,
                    "positive_probability": 0.09259244302573753
                },
                "stars": 4
            },
            {
                "review": "Every time the convo about restaurants in Champaign starts, the mom-in-law mentions Radio Maria. Her praise hits often and reaches far. Tonight, we finally had dinner at the infamous Champaign culinary sensation.The food offering was a mish-mash of cuisines - South American, Asian, Mediterranean, Spanish - and seemed to lack a consistent and unifying theme/thread/philosophy. These types of menus are generally red flags for me because they say: I can do a breadth of styles good, but not one style great.We started off sharing the mezze plate. Pita was pizza dough-y, but buttery too...strange, in my opinion. Also, I found the couscous bland. Best part was the hummus, which I was wishing they served more of.For dinner I ordered the crabcakes, which were more like crabballs. Goat cheese potato pancakes were crisp, but lacked seasoning. Radio Maria's Haitian slaw was flavorless and served merely as decoration on my plate - I hate to say it, but KFC's got better slaw! Positives about the crabballs - they weren't THAT bad and you get three in an order. If you order this, ask for extra garlic aioli (probably best to ask for it on the side). I probably would've enjoyed my balls (but, really...who doesn't?!) more if I had extra aioli.Beau ordered the adobo pork. Generous hunk of pig, the orange-bourbon BBQ sauce starts sweet on the tongue, then finishes with a kick...flavor was decent, but I wasn't expecting or enjoying this sweet sweet meat (SHOCK, I know!). Jalapeno-cheddar cornbread was interesting in concept, but lacking in execution...I would've never known there was jalapeno unless the menu told me! Like the roughage on my plate, the honey left his chayote-cilantro salad be.Call me crazy, but I AM willing to try their brunch and/or tapas, but lemme check-in with not-my-bio-mama first...",
                "reviewer_id": "Pvnmv9Shbr2bPLg4pfZM8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.7942930856528617e-06,
                    "positive_probability": 0.9999962057069003
                },
                "stars": 2
            },
            {
                "review": "What a unique, wonderful place!  This place has 2 sides, each with their own menu: a tapas side and a restaurant side, I ate in the tapas side.  Must have = eggplant frites.  Their drink menu was extensive, but pricey.  The service was a little slow, but granted, it was a Saturday night.  The server was personable and ready to provide recommendations though.  The place itself is beautiful and modern, and they decorate with art from local artists.  I'd definitely go back when I visit Champaign.",
                "reviewer_id": "pwPukNieN8ooWN83eGMN7g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004649335318245461,
                    "positive_probability": 0.9953506646817548
                },
                "stars": 5
            },
            {
                "review": "Had brunch here and was recommended lobster eggs benedict. Their Hollander sauce was pretty good but the dish wasn't anything exceptional and the portion was really small. For a $13 brunch dish, I would expect more portion and a better taste. I also tried their caprese omelet and it was too garlicky. I wouldn't go there for their brunch.",
                "reviewer_id": "qN_P8BUn9R1FCTTwgtWGig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00602431551664788,
                    "positive_probability": 0.9939756844833474
                },
                "stars": 2
            },
            {
                "review": "first drink: arcadia porter.  pretty good.  decent price.second drink: kilt lifter. menu advertises: \"tastes like a cookie\".  ok i'm in the mood for sweet.  when i got it and tasted it:  EWWUCK.  completely flat.  and tasted like syrup.  not the you-put-on-your-pancakes-good-kind, but the high-fructose-corn-syrup-kind.  EWWUCK.me: can i trade this for something else?  it's really not good.bartender 1: what do you mean?bartender 2: what is going on here.me: this tastes like corn syrup.bartender 2: the menu says \"tastes like a cookie\"me: it tastes like ROBITUSSIN. have you tried it.bartender 2 walks away never to returnbartender 1: we can't _trade_ it. it's not like we can serve it to someone else.  it would be different if there was something wrong with it.this beer tastes like ROBITUSSIN; how wrong do you have to get?  your beer tastes like ROBITUSSIN = WRONG.  your cookie tastes like ROBITUSSIN = WRONG.  anything besides ROBITUSSIN tasting like ROBITUSSIN = WRONG.if i wanted to treat my nasal congestion, cough, runny nose, stuffy nose, sneezing, itchy watery eyes, i would have gone to my local pharmacy.  but hey, at least i got a better deal at radio maria's.it's not entirely their fault; it's my fault for being born as a _non-priviledged_, seeing that i'm not a WHITE MAN donning a business suit.  if you want differential treatment, go here.",
                "reviewer_id": "QnYxUzOYLceVr7cEH1c8NQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9717291009751531,
                    "positive_probability": 0.028270899024861133
                },
                "stars": 2
            },
            {
                "review": "Radio Maria has the best Cubans in Champaign. The bad news is that you can't get it unless you go during brunch on the weekend. The tapas, however, are pretty good. I generally get the roasted garlic and one of the various meat dishes, though sometimes I add in or replace it with the cheese and jelly plate.Radio Maria can get expensive, and often crowded, but the decor is great and service has generally been strong.",
                "reviewer_id": "qR6jQSCWN94STCjsnTU8vQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03745091304897606,
                    "positive_probability": 0.9625490869510224
                },
                "stars": 4
            },
            {
                "review": "I had a great experience. The food and drinks were great. The ambience was great. The waitress was very attentive to the party. Very eclectic and interesting food and drink choices. Especially the Tapas.",
                "reviewer_id": "qvZ8IGmwOTGB1-iXYxiRDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1720560833664564,
                    "positive_probability": 0.8279439166335428
                },
                "stars": 5
            },
            {
                "review": "Came here for tapas with my mom and brother on a Sunday night. We ordered 7 tapas to split between us. The service was slow and a bit... ditsy... A couple items we ordered didn't exactly match the description on the menu... For example: the Eggplant Frites had no balsamic vinegar... Our artisanal cheeses were served with tiny hard pieces of pita bread, weird.When we received the \"warm bread it with butter\" tapa, we got the some boring and COLD pita bread that was served with the cheese. Beyond that, they gave us about 15x the amount of butter that could fit on the pita they served us. The waitress who served the tapas explained the types of butter, but after trying them we realized she didn't actually know what she was serving because she clearly described the wrong flavors. Back to the cold pita that was served... When the waitress finally returned, I asked if she could have the pita warmed, after all, the tapa is called \"warm\" bread and butter, right? When she brought the pita back, it had been deep fried.. WHAT? When we talked to the waitress about our disappointment she seemed flustered and then admit to us that she agreed it was weird to serve pita with the cheese but they were out of the crackers (we weren't even referring to the how weird it was to get pita with the cheese plate at this point) and then she continued to ask us if we wanted her to serve the bread that was supposed to come with the bread and butter... She then brought us out some cold, but real bread. Still not sure why this wasn't served in the first place...In summary:Service: Terrible Food: Pretty good, despite the fee makes that chef made Atmosphere: Very nice! You can choose to sit in a casual area or a dining roomPrices: Pretty expensive for the amount of food you're getting",
                "reviewer_id": "qXiN4Gi9N0FOeQYoeiWU8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0210781636490983,
                    "positive_probability": 0.9789218363509097
                },
                "stars": 2
            },
            {
                "review": "Radio Maria is trying a little too hard to be trendy, dcor-wise--it's the kind of place you walk into and expect to be treated with a bit of a condescending attitude by the staff. But thankfully this was not the case! We made our way to the bar where we were greeted by a friendly barman who presented us with a very nice cocktail list while we waited for a table. I chose the Dark and Stormy, which was ridiculously delicious with fresh ginger grated into it! (I ended up having another that I really didn't need, just because it was so refreshingly awesome.) Unfortunately Radio Maria's website seems to be down currently and it was about two weeks ago that I went here on a trip out to Des Moines so my memory has faded as to the specifics of what we had, but we ordered off the tapas menu and everything was above average. I'd definitely return here on a trip to the Twin City area.",
                "reviewer_id": "r7D0pHMJC_tsh3lsF-q_SQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0007760960537302412,
                    "positive_probability": 0.9992239039462747
                },
                "stars": 4
            },
            {
                "review": "Simply put, this is one of the best \"date places\" in Champaign.  The food is amazing and priced very well.  The bar is a blast and the staff is very friendly.",
                "reviewer_id": "rB8esOwygzuuCKCwfIeS-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03697898337582635,
                    "positive_probability": 0.9630210166241748
                },
                "stars": 4
            },
            {
                "review": "The first time my husband and I came to check out Champaign before moving here, we stopped into Radio Maria's for brunch, it was GREAT! Our server who I wish I remembered his name was fantastic! Now that we live here we decided to go out for a really nice dinner, and thought this place would be a great choice. I am sorry to say I was a bit disappointed, in the food and the service.  I love the atmosphere there, however that can only entertain you so long, our food took at least and hour before it came out. We did have the baked brie for and appetizer which came out straight away, but then we waited, and waited, and waited for our main entree. Finally I think our server who at this point I was sure had vanished, came to our table and explained the delay. That was 45 minutes later mind you.  If he had told us initially that our meals would be slower coming out I would have been more understanding, however when you are starving and you see people who sat after you being served and getting their bill and you don't see your server anywhere, you start to wonder what's up.I would likely go back for the brunch, but may try dinner somewhere else, hence the 3 stars.",
                "reviewer_id": "rCFdlokTDU6NeD97-r1bzg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6245909383092053,
                    "positive_probability": 0.375409061690778
                },
                "stars": 3
            },
            {
                "review": "Love this place!  Went there for a late dinner.  Love the bar, love the atmosphere.  Ate off the Tapas Menu....Food was the best!!! The Scallops melted in your mouth! Wine was great...service was great!  Can't wait to go back!",
                "reviewer_id": "RgU9DXE_989GVO9B_xs5qw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8596998969842731,
                    "positive_probability": 0.1403001030157276
                },
                "stars": 5
            },
            {
                "review": "My wife and I returned to Radio after not having been for several years. The service was fantastic and the wine list was excellent. For the most part, the food was good, but there were a couple clunkers. We ordered the a number of tapas, including arancini, pork belly arepa, diver scallops, crab tart, pork tacos, and beignets. The arancini were nicely done, if slightly overpowered by the breading. The pork belly arepa, however, was not made with pork belly and the diver scallops were not diver scallops. I believe the arepa was made with pork shoulder, and was good, but no one ever said anything about the change. Similarly, the scallops were very well done, but were not diver scallops. The crab tart, on the other hand, was a clunker, as were the beignets. The tart was made of corn bread and I don't know that I've ever had a more dried out piece of corn bread in my life. It totally overshadowed the crab. The beignets were huge, which meant they weren't cooked through. They were like eating a heavy cake doughnut, not the light crunchy wonder they should be. The best dish of the night was the tacos. Smoky, spicy, delicious. We will probably go back, but will be much more careful in selecting our dishes.",
                "reviewer_id": "rKVTCeXpaGcmOrNBjOarfw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7834190436640095,
                    "positive_probability": 0.21658095633598984
                },
                "stars": 3
            },
            {
                "review": "This is probably my go-to restaurant in Champaign.  Honestly, I don't really like most tapas restaurants, as I usually walk away from an expensive meal that leaves me hungry.  Not  the case at Radio.  They have a diverse menu, and pretty much everything is very good.  They technically have two kitchens, one traditional and one tapas (you can order from either or both).  Prices can be high for the prime dishes, but if that is not your thing, there are plenty of other options (tacos, tortas, etc.).The place itself is very cool.  I like downtown Champaign, and this is one of the nicer spaces.  The bar side has a modernist feel to it (blue lights under the bar, abstract art), while the dining area is a little more classic.  The bar is truly outstanding.  They probably have the best beer tap rotation in town (yes, that's right) and it's constantly changing.  Probably 25+ beers on tap, and good nightly drink specials.  This is usually one of my top late-night options for that reason, along with DJ Belly on the tables (old school hip-hop is usually on rotation after 10 pm). The food always pleases. My favorite is the paella, but they will put out a good beef tenderloin or other special on occasion that has always impressed.  The chef there is very talented, and the staff in general is very courteous.  If it gets crowded, you might be in for a long meal, but that doesn't really bother me much for this type of place.  We have done birthdays, graduation dinners, or stopped by at 1 am drunk as a night-cap.  It's a very versatile place that can appeal to a variety of tastes.  Definitely the most unique place in town, and should be at the top of anyone's Champaign restaurant lists.",
                "reviewer_id": "RLVm0hNd80ZJYXRgcdFhig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004081979987076723,
                    "positive_probability": 0.995918020012916
                },
                "stars": 5
            },
            {
                "review": "I used to go [almost] every Sunday for brunch. Phenomenal. I still crave the beer bread. and the Masa boatThe interior is so artfully done. I always found myself staring at the sculptural objects on the walls. And the tables made with old doors. Very cool. (Sadly, I could never afford a real dinner experience here on my student budget.)",
                "reviewer_id": "rMf_QIAUHMIr3OJybv5Ylw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08702597988999843,
                    "positive_probability": 0.9129740201100051
                },
                "stars": 4
            },
            {
                "review": "Great, unique food. Awesome atmosphere. The hummus is fantastic, as is the goat cheese with honey.",
                "reviewer_id": "rpj046fGO4cJjXfiRPW_BQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6328798153375583,
                    "positive_probability": 0.36712018466244106
                },
                "stars": 5
            },
            {
                "review": "Good atmosphere but the food is overpriced and midiocre.  I had a collection of appetizers at the bar that were not large enough portions.  We were ignored by the bartender for quite a long time as well; and the place was almost empty.",
                "reviewer_id": "rS8zK3NwQBUZSEUlPt7TKg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3778570187643162,
                    "positive_probability": 0.6221429812356829
                },
                "stars": 2
            },
            {
                "review": "This place was great! a little on the expensive side but a great place to go with a large group. The portions are smaller but allows you to try a variety of things at once.",
                "reviewer_id": "RsmArdUjZ130IN0aa30iDQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.022433770740365424,
                    "positive_probability": 0.9775662292596323
                },
                "stars": 4
            },
            {
                "review": "On a recent trip to Chambana my family stopped here to celebrate my sister's graduation from UIUC and were quite pleased.  To start, the wine list was decent with selections from the west coast to Burgundy and Bordeaux, though they were slightly more marked up that I've been used to in Chicago.  However, the kitchen was very clearly overextended on the graduation Saturday.  While I don't fault them for that I must comment that it didn't seem like they had tried to shove extra tables into the restaurant so it shouldn't have taken 3 hours for dinner, especially since we ordered quite quickly after we were seated.As for the food, we started with the arancini and garlic shrimp skewers.  The arancini was satisfying though plain, and the shrimp skewers were well done.  The entrees were bold options that suffered only slightly from less than perfect execution and definitely warrant a return trip.  I enjoyed the pan roasted duck with goat cheese polenta and roasted beets, while my family selected their daily special (a salmon dish) or the hangar steak topped with bacon and a fried egg.  As I mentioned, the entrees were good enough to warrant a return trip.  Hopefully on my next trip to Chambana the kitchen will be less burdened and I'll be able to enjoy my meal at a slightly less leisurely pace.",
                "reviewer_id": "rW-oPOasC8cV4nUXeppdtA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.032874410891436556,
                    "positive_probability": 0.9671255891085541
                },
                "stars": 4
            },
            {
                "review": "Definitely a fan of Radio Maria. It's always a safe bet for a great meal. I always have tapas but they have a full dinner menu as well. I recommend the hanger steak, plantains, and pork tacos. They also have charcuterie and cheese plate type tapas dishes that work very well as starters. The wine and beer selections are also substantially larger than the average restaurant. Anyone visiting Champaign or locals that have never been to Radio Maria should definitely give it a shot.",
                "reviewer_id": "rw2MOx_mmqK1WNlKwL5nVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002197959682110423,
                    "positive_probability": 0.9978020403178836
                },
                "stars": 4
            },
            {
                "review": "",
                "reviewer_id": "s2XtSlslD9c-e59_IVC0tA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 4
            },
            {
                "review": "Radio Maria was one of the first restaurants in the current resurgence of downtown.  When it opened around 1996, two upscale restaurants had come and gone in the Mike n' Molly's space, and other than Great Impasta, in its old location, there was nary a place to eat downtown except in bars/ short-order cafes.  RM made quite a splash, and I thought it pretty good the first several years.  Nice space, creative menu (for CU),  and some good servers.  Then things starting going south as more and more better-quality eating places opened downtown and elsewhere.  I feel they often try too hard with their entrees...too many conflicting influences and tastes.  I am all for fusion cuisine done well, but I think they lose the forest for the trees here a lot.  Now, the new tapas bar I like quite a bit.  Very reasonable, GREAT beer list, better service, and b/c of the nature of tapas, a more focused concept and execution of cuisine.  Both spaces are nice - they are adjacent to each other.",
                "reviewer_id": "S3dhPGW9PJfK6ZuQoJhKfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00032149082373854565,
                    "positive_probability": 0.9996785091762641
                },
                "stars": 4
            },
            {
                "review": "I loved the decor in the new Radio Maria Tapas bar, but I was NOT crazy about the tapas.  The olives in our manchego baked olive dish had a bizarre citrus note that was rather offputting, and were way short on manchego.  Our apple blue cheese spread appeared to be apple-free, and the blue cheese spread itself was runny.  My bloody mary was top notch; I'll have to do some serious research to figure out whether it surpasses guido's for best bloody mary down town.",
                "reviewer_id": "sleEMt44E1StWrjz3mcujQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.033210550339253554,
                    "positive_probability": 0.9667894496607397
                },
                "stars": 3
            },
            {
                "review": "I recently met a friend for brunch at Radio Maria, and I have to say that I was impressed with their wide selection. Their brunch menu has options that can appeal to everyone from vegetarians to children. I went with the vegetarian masa boat surprise and found it to be very flavorful and well-prepared. The goat cheese in the dish was delicious!I would highly recommend making a reservation to shorten the wait time, as they always seem to be busy. Unfortunately, the service was still very slow after we were seated. No one came to take our order until we flagged down a waiter ourselves.  Overall, I'd say Radio Maria has a lovely atmosphere and great food. Even if it is crowded and the service is slow, I doubt you will leave disappointed.",
                "reviewer_id": "sRoFGJ6Avpl21hMDwQPViw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001833609696867955,
                    "positive_probability": 0.9981663903031248
                },
                "stars": 4
            },
            {
                "review": "Radio Maria has great and unique food! I went on a date here and absolutely loved it! Every dish is most likely something you would never think of creating but it will be soo good!  The selection of wines is excellent as well!",
                "reviewer_id": "sUrU9l3_f1iWYZdLmop0Rw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02424975312213836,
                    "positive_probability": 0.9757502468778628
                },
                "stars": 5
            },
            {
                "review": "Addicting Brunch. MANY veggie options",
                "reviewer_id": "szeyvf-9IJYrStx-REUSLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 4
            },
            {
                "review": "My meal here was phenomenal. I got the Masa Boat Surprise. My wife got the fish tacos. The masa boat was nothing short of amazing. It looks beautiful before you start eating, at which time it turns into chaos. You eat your way down to the little masa boat that is stuffed with Mexican cheeses. A really thin omelet tops the boat, and it was so loaded with veggies and chorizo that you hardly notice that the eggs are there. That is perfect omelet in my opinion. The dish also included black beans, yummy potatoes, and salsa. All for only $8. My wife's fish tacos were great too, but not as good as we've had in other locales.",
                "reviewer_id": "T6aIRIJzlhpSJ264BQQcvA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22733783386692685,
                    "positive_probability": 0.7726621661330738
                },
                "stars": 5
            },
            {
                "review": "I don't even know what I'm supposed to review here.  Is it a restaurant?  A tapas bar?  And what's with this sunday comfort food menu?  Do they even know anymore?I almost feel bad giving this jack of all trades only three stars.  It's not that there's anything outright bad here:  the dining rooms are nicely decorated, the service is okay, the food is well-prepared, the wine and beer selection is thorough but not amazing.  You probably won't be disappointed.But then there's nothing about this place that's outright great, either.Radio Maria was the first restaurant downtown, and they did a fabulous job.  But now the dinner menu hasn't changed in years, they got rid of a lot of their good lunch menu (in favor of tapas), and they've got this strange \"upscale comfort food\" menu on Sundays that doesn't seem to fit in very well.Even the service - which used to be their highest point - has been slipping.  As the old guard moves on, they're being replaced with awkward servers who don't know (and don't seem to care) about the food and drinks they're serving.I will, inevitably, go back.  But since I can go just a few doors down, spend a few more dollars and get an exceptional meal, why wouldn't I?",
                "reviewer_id": "TF2IQSAmV6bVU_mo-GiX3g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27024561930611013,
                    "positive_probability": 0.7297543806939072
                },
                "stars": 3
            },
            {
                "review": "I had the brunch and enjoyed it thoroughly. My friend took his gf here and said he blew 30 bucks each on a small portioned steak dinner and sides. Moral of the story: Come here for Brunch and not dinner.",
                "reviewer_id": "TpGTyk-NuepCXxsda8iXUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06756754823140997,
                    "positive_probability": 0.9324324517685906
                },
                "stars": 3
            },
            {
                "review": "Went for Sunday brunch. Shared some scones, got the \"special\" omelette with Chorizo and vegetables. Two stars for the service. Pros: -The scones rocked. -The house potatoes were perfect--crispy and flavorful. Cons: -It took 20 minutes for the waiter to come over, another 15 minutes for our drinks (coffee, tea, and water) to appear, and a full hour for our food to come out. I'm all for a leisurely meal, but I was staring longingly towards the kitchen entrance by the end. Then when the food came out, two of our table's entrees were wrong. SO MUCH SADNESS (and hunger).-My omelette was far too salty.",
                "reviewer_id": "TpLA3XSBxKXIfvE4ZCcQcw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07068725783580536,
                    "positive_probability": 0.9293127421641979
                },
                "stars": 2
            },
            {
                "review": "Came here for dinner and would probably go back now that I've picked a few items that I like. We did tapas, so here' s rundown.LikesFried artichoke heartsArancini (favorite!)CharcuterieSo-soGrilled hanger steakSalmonRaw and roasted apple saladIt was very cold where we were sitting (not near the main door) and we kept feeling a draft. The staff was friendly but not memorable. Some of the items I felt were well-priced ($5-8). Yet, I felt others were very overpriced ($13 for basically four bites of salmon).",
                "reviewer_id": "tTGZBU9tFnZMoKqVum8_Xg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18445868737074889,
                    "positive_probability": 0.8155413126292486
                },
                "stars": 3
            },
            {
                "review": "I've moved back to Champaign-Urbana after living here briefly 8 years ago and sooo much has changed. I feel like either the town finally realized that it would be wise to start spiffing its image up a bit to attract more students' $$  by spending some $$ or else maybe in the last 8 years, CU's been adopted by a millionaire benefactor with desire to see a small town emulate a big bad city in its gastric offerings. The restaurant scene here has improved phenomenally. My boyfriend and I popped into Radio Maria after being turned away from Bacaro for not having a reservation on a Saturday night. We both had to giggle a little as that's never happened to either of us before in Chicago but it's good to get rejected every now and then. The waitress was apologetic and nice enough about it. So next door to Radio it was and I'm so glad we gave it a chance. We hadn't been in the mood for tapas until we opened the menu. Surprisingly innovative, interesting and very hip. We tried the smoked red potatoes with aioli, the fire roasted pears with manchego shavings and fennel, spanish fusilli pasta salad with olives (which I didn't want to fuss with at first b/c I hate spitting out seeds in public but they were pitted, nice touch) and spanish olive oil. I'm not a big dessert person but since I'd been enjoying the meal so much, I splurged and ordered the pumpkin cheesecake with cinnamon cream sauce. Still thinking about it a day later...the restaurant's decor was again surprisingly hip for Champaign. The bar is lit in blue from beneath and the artwork was very urban/Japanese. There was this cool light box banner thing running the length of the artfully splash-painted brick walls that I'd love to have in our house back in Chicago. Check it out if you're in town. The waitstaff and service was also very friendly, young and attentive.",
                "reviewer_id": "TUfNdE5spR42G7DlUtwEkg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 9.458496212238669e-06,
                    "positive_probability": 0.999990541503804
                },
                "stars": 5
            },
            {
                "review": "We came here for Sunday brunch, and ordered 3 things.Leroy's buttermilk skillet cornbread @ $4 - just one slice.  [Chicago downtown's Bandera Restaurant used to have a whole mini skillet for this price 5x the portion of this, the price has since gone up.]  With the word \"skillet\", we assumed it would came in a full skillet (even a small one, but nope!)  Taste-wise nothing to write home about, the bread is just so-so.  Marmalade added a nice kick to it though.Migas & Pulled Pork Eggs benedict - both were not too bad each came with a small side of their house potatoes.  The deep fried house potatoes were delish. Portions of the main entree were enough, but the side potatoes was on the lighter side, almost too little.  Service at 1:30 pm on a Sunday was a little slow - the place was fairly filled up, still, it seemed like they had a good number of servers, so this was a little disappointing.  Nice ambient, but can get very noisy.  Our overall rating of the restaurant is 2-star.",
                "reviewer_id": "u9fiaqE-b1cPkfq5Itc16A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.035717532203642405,
                    "positive_probability": 0.9642824677963593
                },
                "stars": 2
            },
            {
                "review": "Food was not so good, scallops very good, the sauce ok, calamaris were spicy, mushroom was spicy too, overall pricey and small portions, the place is ok the server was GREAT!",
                "reviewer_id": "UaIAPwweBI8Mg15HlbMaEw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19638098046272032,
                    "positive_probability": 0.803619019537281
                },
                "stars": 2
            },
            {
                "review": "Food was good, not excellent. Prices seem high for the quantity and quality you get. The bar and wait staff could all really use a lesson on wine - I believe I overheard 4 staff persons who could not respond on their own to questions about wine. Fun atmosphere and decor.",
                "reviewer_id": "udGPMvw6Zp3DGkPPnAWAnA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7588284839278367,
                    "positive_probability": 0.24117151607216067
                },
                "stars": 3
            },
            {
                "review": "My first visit to champaign and our host took us here.  I order Sangria and it is so good, not too sweet not too bitter, just right for me. Their seafood is nice and fresh and the chocolate molten is a good finish for the meal.  I like the vibe in the restaurant and the outdoor seating is a plus to the the restaurant",
                "reviewer_id": "uIbYL9bilEf2GJ7kE0FtkA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0031661343691042074,
                    "positive_probability": 0.996833865630898
                },
                "stars": 4
            },
            {
                "review": "I dearly loved this place when I lived in C-U. Never had a bad meal, although sometimes it was marred with indifferent service of the \"I am a hipster working in the hippest restaurant in town! What, you want me to DO WORK?\" type. Brunch was awesome; a lot cheaper than dinner so my impoverished self could get a fix when mom and dad weren't paying. The beer bread, yes, and the masa boat, yes! And at the time they opened, renovating a decrepit downtown location to expose the brick walls and original tin ceilings was a new idea. They kickstarted a great trend. Downtown Champaign wouldn't be what it is today without Radio Maria. I remember going to that space to pick out wallpaper with my mom and dad back in the 80's. Radio Maria is a vast improvement.",
                "reviewer_id": "uKgbjPhcrS2pi9hS39Az6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.531883367394018e-05,
                    "positive_probability": 0.9999346811663238
                },
                "stars": 5
            },
            {
                "review": "Great tapas bar, great drinks, great ambiance, great service, just great overall.  You can come here anytime at all and find something that suits your palette.  An upscale restaurant in downtown Champaign, Radio Maria has both a well developed tapas bar with a metro, modern dcor as well as your classic restaurant dining area which is decorated in such a way that gives it a more rustic feel.My first experience here was a very pleasant one as we were promptly seated, the waitress was very attentive, and the food was done very well.  We started off with the broiled goat cheese as an appetizer which was very tasty, and then I got the grilled salmon as an entre.  Like everything else in Radio Maria, it was cooked well, plated beautifully, and served relatively promptly.I came here again several weeks later for brunch with some friends and had a craving for some spicy sausage so I got the house-made chorizo omelet.  To sum it all up: *drooool*.  My friend's said the same thing about their orders (Greek, Italian, and Pinta's omelet, and the egg sandwich).  Everything tasted fresh and light - just like breakfast should.Whether you're looking for a place to loosen your tie and grab a drink after work, out on a romantic date, or just hanging out with friends, Radio Maria is a sure bet for good food and a good time.",
                "reviewer_id": "urDog6OhPoNKPJFUDob7AA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004297398057010149,
                    "positive_probability": 0.9957026019430021
                },
                "stars": 5
            },
            {
                "review": "I wish I could give the wait staff 1 star and the food a 4. I've been here 5 times, mostly for brunch.  The waiters are my least favorite part of Radio Maria. That said, the prices are reasonable at brunch, so go on the weekends if you decide to check the restaurant out.  There are never enough people working at brunch.  We always have to flag someone down to order, to figure out where our drinks are, to get refills on our coffee, the list goes on and on.  The food has been quite good; I loved the Torta Maria, the blackened salmon, and their soups, while overpriced, have been excellent.  The masa boat was a little dry, but the flavors were well-balanced.  I went once for dinner.  The food was good, but unremarkable.  I had the Korean hot pot.  It was good, but I wasn't expecting it to be sweet.  The portion sizes were also tiny.  For half the cost, I could have gotten twice as much food at B-Won.I don't drink alcohol, so I can't say anything about their drinks, but my friends say they have one of the best-stocked bars in town and the weeknight bartender is excellent.",
                "reviewer_id": "USkmMVTh2omYmajDSRGUSQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2595234332263663,
                    "positive_probability": 0.7404765667736396
                },
                "stars": 3
            },
            {
                "review": "What a gem! This is our new fav spot when we come to town. Thanks to all for wonderful food and service!",
                "reviewer_id": "uUyDpyvW_lBLSMLiktoOsQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19848872491972464,
                    "positive_probability": 0.8015112750802765
                },
                "stars": 5
            },
            {
                "review": "I came here for tapas after reading the reviews on yelp.  I love to eat tapas in my hometown and was a little skeptical whether or not this place could live up to my LA expectations.  Radio Maria did not disappoint!First off, I loved the atmosphere.  The architecture and style of the place is so artistic and unique.  It's beautiful.  I love the artwork all over the walls and the bar area especially.  The dim lighting and the small bites menu definitely makes it a great place to go out with friends or to go on a date.  The drinks are reasonably priced and tasty too.I had the lamb meatballs, the bread with fig jam,  and the bread with serrano pork and orange marmalade and the potatoes.  I'm forgetting the name of each dish but they are on the tapas menu. Everything I ordered was great, but the potatoes were AMAZING!  They were crispy and had a delicious flavor because they were hickory smoked.  They also came with a delicate drizzle of the most delicious sauce, I wish I knew the ingredients so I could re-create this dish.  I can't wait to come back to have them again!",
                "reviewer_id": "uZ86FJDCqn-FGyzTAMDhxQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.0785680319783433e-05,
                    "positive_probability": 0.9999892143196719
                },
                "stars": 5
            },
            {
                "review": "I believe they got a new chef semi recently... Didn't think much of this place a few years ago but now think it's one of the best spots for a good dinner in c-u",
                "reviewer_id": "Vcg87EqE0gDMlNIxQe9L7w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.39562663988297064,
                    "positive_probability": 0.6043733601170288
                },
                "stars": 5
            },
            {
                "review": "First time here...and I've heard great things about this place. First impressions were pretty good....the ambiance was good and the restaurant had a good amount of people. We started off ordering a tapas as our appetizer...the apple salad. It was very disappointing. The apples were not cut to order and were not crisp even though it was stored in a container of lemon juice. The bacon was not reheated...I mean who likes cold bacon? For pur entrees we ordered the scallops and duck meatloaf. The scallops were good however I personally didnt appreciate the jam that went with it...could have done with a spicy savory sauce. The duck was unknowingly served with the same exact jam. It was a tad too sweet for our tastes, but regardless of that...the meatloaf was absolutely amazing. The egg that topped it however was a bit overcooked so the sunnyside up yolk could not be used as a sauce. Our final conclusion is that the main part of the entreeswere cooked to order, as they should be, but all the garnish was precooked and we got the feeling that it was just thrown on...not worth the price.",
                "reviewer_id": "vE5J5zkcL29uEcp83La6xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04008821168822783,
                    "positive_probability": 0.9599117883117704
                },
                "stars": 3
            },
            {
                "review": "Overpriced. I ordered steak. Nothing to write home about. Better, cheaper choices abound.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2961169678973226,
                    "positive_probability": 0.7038830321026787
                },
                "stars": 2
            },
            {
                "review": "Went there for brunch , hot cinnamon rolls were fantastic  all three in our party had the same thing which was the radio Maria stack. Which had everything you want In a big breakfast   By the way it was delicious. Waiter was very friendly alsoForgot to mention  the interior design of this place was very attractive and comfortable",
                "reviewer_id": "Vgyg1J7OLdbVKQHP_p1vAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.030254105889212613,
                    "positive_probability": 0.9697458941107844
                },
                "stars": 4
            },
            {
                "review": "Wow, this place has really changed, now they occupy two spaces instead of one. One space is for formal dining, while the other is more casual and laid back. We sat across a huge purple bar. The menu was much different than I remembered.  Instead of entrees like half chickens with grilled plantains, etc. they offered Tapas, which we didn't mind at all. In fact, we love Tapas. The best Tapas we ordered was the vegetarian paella. I wished the paella was served on a big platter like in Spain, but it was just in a tiny side dish, which I understand is part of the whole Tapas mentality, but still I wished they'd offer it on the menu as a main dish. The margarita I ordered was spot on. Not to strong, not to watered down. And their prices are extremely reasonable. We spent $47.00 without tip for six tapas, two margaritas, and one dessert, which we shared. I still love Radio Maria's, but I like the decor on the older side better.",
                "reviewer_id": "vPzS0S6WZaa8lvaPYO0hzg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.0140100529300044e-06,
                    "positive_probability": 0.9999969859899412
                },
                "stars": 3
            },
            {
                "review": "The food has always been top-notch. I go there regularly for tapas and on the weekends for brunch. The service and staff are all very friendly and accommodating. I've noticed some other reviews noting the service was a bit slow, but I've never had any complaint about the speed. The environment there is also quite enjoyable; albeit a bit hispter-ish. But I wouldn't let that deter you. Overall, I don't think you'll be disappointed here. Solid 4/5",
                "reviewer_id": "w10LUprt6hIp9WbYn9t0Cg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0004049645433827185,
                    "positive_probability": 0.9995950354566177
                },
                "stars": 4
            },
            {
                "review": "We came here and had the sauted mushrooms, stewed oxtail, lamb meatballs, steamed mussels, sauted calamari, patatas, roasted tomato and shrimp crostini, and crispy bone marrow. The mushrooms were bland -- the broth needs to be more flavorful. The bone marrow was also disappointing, the sauces on the plate did not complement the bone marrow at all. The crostini was very average, too much bread and oversized tomatoes for the amount of shrimp rendered.On the other hand, the stewed oxtail was absolutely delicious -- the meat was tender and the broth full of umami flavor. I was also a big fan of the lamb meatballs, perfectly done with a creative sauce to match. The potatoes were well seasoned and the dressing paired nicely. The mussels were served in generous proportion.Overall, 50/50 good bad. This was my second visit and I definitely trust Radio Maria for a night out dining.",
                "reviewer_id": "WGZ1Z2KVmuUOYhg41IC9EQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12829272733925623,
                    "positive_probability": 0.8717072726607433
                },
                "stars": 4
            },
            {
                "review": "Their paella is amazing. Lord....those big, beautiful scallops. Also had the on their brunch menu. The eggs Benedict with mahi mahi. The former, beautifully prepared. The fish, meh...lost its moisture somewhere, and I'm a snob when it comes to overly dried/cooked meats. But everything else on that plate, including the cornbread slice were lovely.I really need to try their tapas and meats. I have a feeling I'm gonna bump this up to four stars when I do that!",
                "reviewer_id": "WIMjZojWHQgZTjpTSfJ7BA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11551695099648111,
                    "positive_probability": 0.884483049003517
                },
                "stars": 3
            },
            {
                "review": "Radio Maria makes me feel good. There, I said it. Any restaurant has its flaws, but RM is about as close as it comes to perfect in Chambana. RM is situated in the bustling Downtown, and sports an eclectic modern decor with latin touches. The Tapas Lounge is all-modern, with changing exhibitions for wall-art, and a Euro-chic cleanliness, not typically found in the mid-west. I will talk of the awesome Tapas 'experience' at a later date, but this blog is devoted to our last night in The Dining Room.With an exceptional wine-list, dinner at RM always begins and ends well in terms of drinking options. One of the best things for me is that no matter what mood I am in financially, (from big-night-out, to my typical tuesday-night-budget) there are so many choices of great tasting vino. Although RM changes its menu about once a year, they (thankfully) keep many of their favorites available, such as the Coffee Filet, Peppercorn Tuna steak, New York Strip and appetizers Seared Avocado with Quinoa salad and Grilled Goats Cheese Medallions in pesto. All dishes have latin-fusion inspired flavors, plenty of warm chile, spicy cream, mole and guacamole sauces.Service at RM is impeccable. Quick, but tastefully so, timing is almost always perfect, polite and sophisticated. Their knowledgeable sommelier staff are very helpful for beginners and experienced wine-drinkers alike. Dinner is not cheap for the average mid-west dining clientele, but compared to similar dining rooms in larger cities, I think Radio Maria is worth double whatever the bill is.ALWAYS order the special, their young, fashionable chefs always deliver. Expect to spend $60-$80 on food for 3 courses for 2 people in the restaurant, or $40-$60 in the tapas lounge.",
                "reviewer_id": "wtsl05RJj5f6YBDQPEwP2w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.5104271577218455e-12,
                    "positive_probability": 0.9999999999974784
                },
                "stars": 4
            },
            {
                "review": "I visited Radio Maria nearly 4 years ago with some friends after a Salsa dance lesson, and I  could not remember the name of this place for the life of me. I am from Danville/Champaign  area, and I drove by this place all the time in the daylight, and I never even noticed it. It's definitely for \"friends\" after hours.I remember I had the Arancini....holy crap was it DELICIOUS!!! The vibe was chill and trendy. A bit upscale for my liking...but eh, to each his/her own. I personally believe the restaurant needs to do more food advertisement, because I think the only thing that either my friends, acquaintances, or myself believe the reason that this place gets any business is because their bar service on the patio after dark.",
                "reviewer_id": "WwsJZEwwTSf0g_3qlBjUIA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.017420937615649303,
                    "positive_probability": 0.9825790623843564
                },
                "stars": 3
            },
            {
                "review": "Eh.  I have some issues with this place.  It has really good potential but I definitely have mood swings about it.  The main restaurant is decent.  The food isn't necessarily anything I couldn't make myself but it is good, especially for me-- a vegetarian, who has had trouble finding interesting vegetarian food at many of the places in CU.  Also, the wine selection is pretty decent.  BUT, I think the tapas side is just terrible.  We've only eaten in that part one time and I believe it was a Tuesday night, but essentially every dish we got had something wrong with it.  The biggest issue was that we were served the Spanish tortilla omelet refrigerator cold.  It is supposed to be GRILLED.  Not grilled then put in the fridge over the weekend!  We told our server and she told us that was how it was supposed to be.  Alrighty then!  Actually, every tapas we ordered was COLD, but this was the one that stood out the most (who wants cold eggs?  Not me!!).Maybe I need to experience the brunch to give a fair assessment, but for now I'm giving 2 stars (4 for the restaurant + 1 for tapas)/2 = 2 when rounding down).",
                "reviewer_id": "WYFd2Wv2u6HWtmFA9aRF-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09234429198292217,
                    "positive_probability": 0.907655708017079
                },
                "stars": 2
            },
            {
                "review": "Food was decent - the Radio Maria torta was the best thing we tried. The tacos didn't hold a candle to L.A. or Portland taco trucks (the arepa was good but not the best I've had). We also had the tapas special which was steak with bacon-wrapped avocado - the steak was quite good, and the idea of the avocado was interesting. Desserts here were quite tasty.The drinks were okay - enough alcohol to know there was some in the drink, but they were mixed towards the bitter side rather than sweet.The service was incredibly slow. It took at least an hour to get our food. Biggest complaint of the night, and makes me not inclined to return.",
                "reviewer_id": "X7KQbbMqxsMkwSRQ6Eltow",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8473485483712229,
                    "positive_probability": 0.1526514516287796
                },
                "stars": 3
            },
            {
                "review": "Had brunch on Saturday, and it was so good we had to come back for more on Sunday. I had the vegetarian masa boat on Saturday, and it was absolutely delicious. The eggs were a wonderful texture, and it comes with a really great helping of goat cheese - always a plus IMO. Also had to order a side of beer bread and fried plantains, both good. The mexican coffee had a really nice flavor - I would recommend it over their regular coffee.I had the omelet special on Sunday - blue crab, corn, celery, red pepper, with hollandaise on top. Amazing flavors, really great crab. Ordered a side of corn bread (drizzled with honey and orange marmalade), and that was pretty nice as well. Had a guava mimosa - not as much guava flavor as I had hoped, but can't argue too much with a nice helping of champagne!I want to come back soon, especially because we saw these beakers mounted to the wall in the bar area, and our waiter told us it was their own strawberry rum.",
                "reviewer_id": "x7Qec9s8yGSqh1E2wLDwMQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011613179592686488,
                    "positive_probability": 0.9883868204073136
                },
                "stars": 5
            },
            {
                "review": "A grad school fav... This place has stood the test of time, which is the best indication of restaurant quality.",
                "reviewer_id": "XAAs2Y77fUqV26C2ec5-7g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.32350085913431714,
                    "positive_probability": 0.6764991408656842
                },
                "stars": 4
            },
            {
                "review": "The brunch was very tasty and a good value.  The dinner, however, was nothing special.  They had a lot of great choices on the menu, but everything just sort of tasted average.  The service was good.  I would suggest going here for brunch.  Dinner is also good, but not amazing.",
                "reviewer_id": "XdlBjKW-leAJ_Ui31sFVHA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13618168568247677,
                    "positive_probability": 0.8638183143175209
                },
                "stars": 3
            },
            {
                "review": "Excellent choice. Great and tasty tapas menu with a wide beer selection. Good service that isn't in your face.Highly recommend the pita chips and hummus. The chips were thick, crispy on the outside, but preserving the soft tender pita texture on the inside, complimenting the exceptionally smooth hummus.",
                "reviewer_id": "xJrEPz81yEFxnFw0BPCmNw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025595195921049203,
                    "positive_probability": 0.9744048040789498
                },
                "stars": 4
            },
            {
                "review": "I had a boss who was obsessed with this place.  They have good hummus and I like the fried plantains.  Otherwise, it's fine.  Brunch is the best time to go.",
                "reviewer_id": "XOKy3A0DCZuzeglHZw76XQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.666023745922187,
                    "positive_probability": 0.3339762540778123
                },
                "stars": 3
            },
            {
                "review": "Had brunch there on Sunday with 8 people.  1 vegetarian and 1 very picky eater.  We loved it.  Everything was spectacular.  Only downfall - not enough of the potatoes which were incredible!  Had the smoked trout omelette which was soooo good.",
                "reviewer_id": "yRA_2X1FHgMW7_LV3OGw2w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.044700296461121156,
                    "positive_probability": 0.9552997035388817
                },
                "stars": 5
            },
            {
                "review": "I am not impressed with this place.  My friend and I walk into the bar side for tapas.  I had read the reviews on yelp before I went, but my friend really wanted to check this place out.  My first impression:  There are at least 7 empty tables and a totally empty bar.  The hostess asks us how many, and are we here for drinks, tapas, or full meal?  I tell her tapas, and she tells us it's going to be 5-10 minutes, would we like to have a drink at the bar?  Sure, we walk past several empty tables and sit at the empty bar.  We are impressed with the blue light coming out from the bar top, when a \"bartender\" walks past and LITERALLY THROWS a drink menu onto the bar near us.  And keeps walking by.  I wasn't shocked because I had read the reviews, but I thought that was totally rude.I asked another guy walking by for a glass of water.  He was able to ablige, and by the time we got our water, amazingly the empty table behind us was available.  We sat, checked out a menu, ordered 3 tapas, and my friend ordered a beer and I ordered a glass of wine.  It took quite awhile for just the drinks to get delivered.  I was disappointed in the amount that they called a \"glass\" was about half of a glass I've gotten at other restaurants.  And when I was looking at the wine list, I asked for a recommendation, and said I didn't like fruity reds, I preferred more on the dry side.  I took a sip of an incredibly fruity red wine.  Sigh...When the food arrived, it was alright.  Maybe I just expect more.  It was okay food, just not as tasty as I've had elsewhere.  There were no outstanding flavors, or a bite of food that made me sit back and go \"wow.\"  Just ...average.The waitress asked if we wanted to see the dessert menu.  Sure, why not.  We went with the dark chocolate cake.  About 20 minutes later, we finally got the cake.  What took so long?  Who knows.  Maybe they had to bake the cake after we ordered it...  Anyway, I have NEVER left a piece of chocolate cake on a plate at a restaurant before.  My friend said the cake tasted like deli meat to her.  How does one make cake taste like deli meat?  I have no idea.  It tasted out right burnt to me.  Burnt cake peeled out of a pan, with some hersey's syrup on top to cover the taste.I ask for the check.  She came by with the check, I gave her my credit card, and away she went.  Another 15 minutes passed, and she had walked by our table about 5 times.  The next time she walked by, I asked her for the credit card receipt.  She was totally suprised, and hadn't realized she had never given it back to us.  She was sincere, it was just annoying.  I wasn't impressed with the food, and somewhat unhappy with the service.  There was dancing (salsa or something) starting as we were leaving, but I wasn't in the mood for it.  I don't know if I would recommend this place.  Maybe once just to go...  but I think once is enough.",
                "reviewer_id": "YW_iT5vBAFJUepWGQCo62Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0206263344063929,
                    "positive_probability": 0.979373665593638
                },
                "stars": 2
            },
            {
                "review": "Our whole family loves Spanish food and since we were all in Champaign for the football game we decided to check out a \"new to us\" Tapas restaurant.When we arrived at 2:45, the kitchen was not open but would reopen in 15 minutes.  We decided we could easily wait so we snagged two tables outside and ordered drinks.  The waiter delivered the drinks and took our tapas order so he could put in the order as soon as the kitchen opened which was a marvelous idea!  Before you knew it we were sipping on Sangria and our food began to arrive.We tried the cheese plate which was outstanding.  I could have just eaten that and been happy.  The mussels were grilled which had a pleasant taste but the grilling did dry them out.  The biggest disappointment was the Spanish tortilla, the traditional egg and potato omelet of Spain.  This had been prepared like more of a quiche and no one at the table liked or ate it.  I adored the fantastic lamb meatballs, we even ate the sauce with some of the bread which came with the cheese plate.  The other tapa I tried were the marinated olives which were not nearly as good as I had expected.  The marinade was so vinegary, not a smooth flavor at all.  I would not order that again.  We shared everything but there were some dishes I didn't try as I had ordered paella for my entree.The paella was really really good.  It had a spicy chorizo but it did not overpower the overall rich saffron/olive oil taste of the dish.  The rice part was outstanding and the chicken and seafood were generous and tender. What a treat!  I had partaken of too many tapas so my husband had to finish mine, now that is a generous portion.We had a great meal, my sangria mellowed me out after like 4 sips, the Illini had won and the weather was beautiful.  When the sizable check arrived I might have blanched at bit under normal circumstances but my husband and I just laughed and put it on a credit card.It was a great meal with the family but very expensive.   Next game, those kids are getting pizza or burgers!   Ol!",
                "reviewer_id": "zfuJwHFip_KoJlb9SR-g4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.7257458661419293e-10,
                    "positive_probability": 0.9999999998274243
                },
                "stars": 4
            },
            {
                "review": "My SO and I made our Valentine's Reservations here, and were extremely happy.The Good:-The goat cheese, the goat cheese, the goat cheese!! We had several tapas and one appetizer, and the fried goat cheese was our favorite, so delicious and creamy, and it is served with a light jam that makes a wonderful combination.-The pork tacos were also delicious, and obviously slow cooked, very delicious.-The service was excellent, especially for how busy everything was (they were tripled booked for Valentine's).-The homemade ricotta gnudi were also delicious, especially with the sauteed mushrooms that accompanied it. -We also ordered a flight of ice cream that featured a mint chocolate cake flavor which was extremely aromatic, and smelled like I was walking through an herb garden, delicious. The Meh:-Personally, I was not a fan of the arancini, to me all I could taste was a fried greasy taste.Overall:-Would definitely return! Especially for date night, it's a fantastic place.",
                "reviewer_id": "ZjxfO0xvmxZ7BiNUg7ejjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0023768747434764503,
                    "positive_probability": 0.9976231252565269
                },
                "stars": 4
            },
            {
                "review": "I'd love to say Radio Maria is my favorite restaurant and give it 5 stars.  After all, they have awesome sangria and great sunday brunch.  The fig appetizers on their dinner menu are fantastic, but their dinner entres are  hit or miss.  The tapas also taste great, but they always make me terribly sick afterward.  I'll keep coming back for dinner, though I think I've given up on the tapas for good.",
                "reviewer_id": "zkRH-NOAdIjJjU2ASeXZ1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45820525950602137,
                    "positive_probability": 0.5417947404939739
                },
                "stars": 3
            },
            {
                "review": "Great vegetarian options and large beer selection! Highly recommend! Heard there was salsa dancing in the evening on Saturdays as well, but left before it started.",
                "reviewer_id": "ZLg_2-p-DNSbSbQsxUcChw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0520964805676202,
                    "positive_probability": 0.9479035194323779
                },
                "stars": 5
            },
            {
                "review": "Some restaurants in this area have Chicago-envy.  That must be the problem with Radio Maria.  The fusion menu doesn't work because the chef has not mastered the basic cuisines that they are trying to blend.  Dishes are overly complex and are either bland or actively taste bad.  The staff used to describe it as a Caribbean-Polish Fusion.  (Really.)  I have no idea what's going on now.  Spanish-Korean?  Soul Food Middle Eastern Style?  Masa boats. Frog legs. Ground coffee rubs. Pad Thai. Torta.   The motto seems to be:  when in doubt, add more things that don't go together, none of it done well.This could only be mistaken for sophistication by people who have never been anywhere sophisticated.  Stay away!",
                "reviewer_id": "zq815p7o2OM1kNHG8OdobA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5673724274167419,
                    "positive_probability": 0.4326275725832584
                },
                "stars": 1
            },
            {
                "review": "Came here one evening for tapas with friends. I was the only one that ordered for the four of us and our waiter just starred at us for awhile asking if we were sure that's all we wanted. You could tell he hadn't been working there long as he had to ask the kitchen twice about what was in some of the different sauces and I had to repeat my order twice so that he could remember it. I ordered the Wild Mushroom Crostini, Smoked Pork Tacos and Sauteed Calamari. My favorite was the Wild Mushroom Crostini. The mixture of the cheese, fried egg and mushrooms with the crunch of the bread made it delicious. The Sauteed Calamari was an interesting dish with a lot of flavor. It came out in a soup dish so it was great to dip just some of the bread in the sauce. The Pork Tacos were my least favorite as there was too much green onion for my liking.The food was good but each dish was made for two people rather than four. As we were finishing our plates, a waitress cleaned our table without asking if we were done, which peeved me because I wasn't done with the calamari.",
                "reviewer_id": "ZvxB_8qUClYq6BoEmix9zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2890837228431642,
                    "positive_probability": 0.7109162771568431
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "sBw0ZgTVeRgdOA3sfGIcwQ",
            "6HKjKhgDLBpuZFNBOCzVQw",
            "u-y1z3usKenHtOGrH5Vveg",
            "SeQv-RJ2rS070NvSRh_siQ",
            "JCqFWCn31OMSk-vqF5aYNQ",
            "iUuHgmsuCPstwJlr5jH02w",
            "vY3jiyABOyFOaGBujou8Vg",
            "Cu4WjKd2EZ-b5PxPXyH9EA",
            "2cW9LyHHChCSmcI4lBs5sw",
            "2SycDjGWWpFs1ODL-YBoHA"
        ]
    },
    "Cu4WjKd2EZ-b5PxPXyH9EA": {
        "keywords": {
            "bigrams": [
                "soy_sauce",
                "orange_chicken",
                "bourbon_chicken",
                "chicken_bourbon",
                "food_court",
                "drank_water",
                "fried_rice",
                "entree_meal",
                "gave_two",
                "chicken_did"
            ],
            "unigrams": [
                "chicken",
                "food",
                "msg",
                "mall",
                "did",
                "gave",
                "rice",
                "soy",
                "meal",
                "sauce"
            ]
        },
        "metadata": {
            "attributes": {
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good for Kids": true,
                "Noise Level": "average",
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false
            },
            "business_id": "Cu4WjKd2EZ-b5PxPXyH9EA",
            "categories": [
                "Cajun/Creole",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "Champaign, IL 61820",
            "hours": {},
            "latitude": 40.1166102,
            "longitude": -88.2412504,
            "name": "Kato's Cajun",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/EYnPmdPKYG7DFxZcO5dRqA/ms.jpg",
            "review_count": 5,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "It did not taste like chicken nor did it look like chicken. Somehow all of the chicken tasted the same and I would say the best would be the orange chicken which did not have soy sauce on it. Health code rating: D, I kind of guess this would not be a very clean restaurant. ",
        "reviews": [
            {
                "review": "I never had any kind of Asian or chines kind of food .One Saturday we walked around in the mall and they gave out samples and I fell in love with Kato's chicken and they gave you two big sides ,lots of food .The food is reasonably priced.",
                "reviewer_id": "12oNZyecE29NUv9klQyvBg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12007707297604943,
                    "positive_probability": 0.8799229270239545
                },
                "stars": 4
            },
            {
                "review": "Restaurant reviewHow can there be 3 similar restaurants in the mall food court? I was faced with this dilemma while wanting to make a meal while at the mall. This is the first of the asian restaurants including Panda express and Sarku. I ended up with this choice to vary up the selection and because they had a 3 entree meal with 12 oz soda for 8 bucks. There was no line at this location. Unlike the other review, they have a home made sign indicating no MSG. I was foolish enough to get 3 different chicken dishes. The kato chicken, bourbon chicken, and some sort of orange chicken. My side was noodles, but you can go with fried rice as well. First of all there is no MSG in the meal, but it is lathered in soy sauce. Somehow all of the chicken tasted the same and I would say the best would be the orange chicken which did not have soy sauce on it. I was surprised to find a sliver of bone in the chicken piece as well. The drink itself is also super dinky at 12 oz and a lot less once you subtract out the ice. This is neither healthy nor tasty, but if you like large portions than you won't go wrong.Pros: large portion, 3 course combo + side (rice or noodle) + drink for 8 dollarCons: Drenched in soy sauce, salty, all of it tasted about the sameHidden deals: The above combo will get you enough food really for 2 peopleHealth code rating: D, I kind of guess this would not be a very clean restaurant. Just check out the health reviews for violations http://champaign.il.gegov.com/champaign/estab.cfm?facilityID=1162",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11157170541838807,
                    "positive_probability": 0.8884282945816144
                },
                "stars": 2
            },
            {
                "review": "Summarizing my experience in one word:Deception.Today, I walked into the food court hungry after finishing some errands at the mall. I met a manager waiting outside handing out samples of great tasting samples. The lady at the counter also gave me some samples. They were seducing. I'll admit that I did get the three entre meal, pepper chicken and the types they let me try. The staff was attentive and filled me a side of soy sauce when I forgot to grab some since the bottles were not labeled.The food tasted great and filled me up. It was great... at first.After I was half way through, I noticed that I had an unbearable salty taste in my mouth. I was wondering if there was simply too much salt on my food. I did not even finish the food completely. I was feeling full when there was still rice.I actually got measured and tried on suits at the clothes store nearby afterwards. I felt  like my belly was sticking out the whole time. I wanted to make sure such a sharp looking suit would fit nicely even though my abdomen was a little large than it should be. Still, I finished after an hour or so and returned home.When I got home I drank some water, and did a few chores, cleaning dishes, laundry. I drank some water again. I realized that I was really thirsty and that my stomach still felt bloated. I knew that there was something I was suspecting when I had my lunch, I wondered if the food had MSG mixed in to it. For those of you who don't know what MSG is, look it up. Sodium glutamate is safe, naturally occurring nonessential amino acid. It's like adding a type of salt and sugar to your food just to make it taste better. It's a cheap, unhealthy way to make customers believe that the food they are eating is awesome. The problem that I have with MSG is that it makes me feel really bloated and I can tell my body has trouble fighting hard trying to clean it out. I never want MSG mixed into my food and I may consider simply asking before hand whether it is an ingredient in the food at all. Personally, I find it irresponsible for a restaurant to use it simply for profit. As a prospective businessman, there are certain things that I will not tolerate being traded for short term profit. Customer health and welfare is one of them. Please stop using MSG or at least put signs stating clearly and truthfully whether you do or do not add MSG into your foods at any stage of preparation. In case anyone disagrees with my views is why I explained clearly and transparently why I gave the two star rating I gave so you will have the opportunity to respond to this review or consider whether it is a valid rating.",
                "reviewer_id": "HfzBiH6GBYZHefUvOlu4BA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0025466399474243983,
                    "positive_probability": 0.9974533600526067
                },
                "stars": 2
            },
            {
                "review": "I felt compelled to write an update on my latest visit.  The chicken was awful! It had a funny taste to it.  I can't seem to put my finger on it.  It did not taste like chicken nor did it look like chicken.  I felt it was way overpriced for what I got.  I will avoid from now on.",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9881655537973334,
                    "positive_probability": 0.011834446202662392
                },
                "stars": 1
            },
            {
                "review": "I was walking around the mall Christmas shopping when I was struck with a sudden hunger.  While walking around trying to decide where to eat a nice gentleman with a sample tray walked up to me and had me try one of every sample they had.After sampling the Orange chicken, the teriyaki chicken and the bourbon chicken I decided to get a triple entree meal from Kato's.It was delicious, and they did not skimp on portion sizes like some places o it was mounded on my plate and was freshly made.the only complaint would be that the fried rice was rather bland and flavorless.",
                "reviewer_id": "x-LqeyKcgNQ-illPkaqcFA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.039845362936167895,
                    "positive_probability": 0.9601546370638278
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "iUuHgmsuCPstwJlr5jH02w",
            "ew5MdPbrBWKV6XIO9_gieA",
            "fxYiDAxCK33ANk8-QemInA",
            "OQIDPNTLuOD8io9FoKKIKA",
            "TD11IPIlFL9sLAWbN9FzdA",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "umq8alp-uLf3hXnpSC99WA",
            "6AHfkdtpx7yLOFetI38gHQ",
            "u06X5C_pIAVuOXOznIcPYw",
            "6M1F5AECDtWff1Tu3uLEWA"
        ]
    },
    "iUuHgmsuCPstwJlr5jH02w": {
        "keywords": {
            "bigrams": [
                "voodoo_chicken",
                "drunken_chicken",
                "garlic_bread",
                "cajun_food",
                "red_beans",
                "crawfish_ettoufle",
                "fast_food",
                "crawfish_etouffee",
                "beans_rice",
                "white_chili"
            ],
            "unigrams": [
                "food",
                "chicken",
                "place",
                "spicy",
                "gumbo",
                "good",
                "great",
                "rice",
                "crawfish",
                "cajun"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": false,
                "Dogs Allowed": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "average",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "iUuHgmsuCPstwJlr5jH02w",
            "categories": [
                "Cajun/Creole",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "700 S Gregory St\nSte D\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "20:00",
                    "open": "12:00"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1065109,
            "longitude": -88.2218027,
            "name": "J Gumbo's",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/nazWPTqHs10terxUEJvlZA/ms.jpg",
            "review_count": 40,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "What is so great about this place is that they allow you to sample all the dishes first. Some of the best Cajun food I have ever had. The food is solid cajun food though it could definitely be spiced up a bit more, but over all no complaints at all about the food! ",
        "reviews": [
            {
                "review": "I am impressed by the food here; it tastes fresh, homemade, authentic and not like a chain restaurant at all. The crawfish etouffee is my favorite but all the other seafood dishes I've tried here are actually really good too. The employees here are always friendly, the prices are good, even for students, and, as I stated above, the food is fantastic. I highly recommend this place, especially for lunch.",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.048572467063932256,
                    "positive_probability": 0.9514275329360673
                },
                "stars": 4
            },
            {
                "review": "Red hot chicken and drunken chicken are both really impressive. Spicy and flavorful. I've been twice and I need to get back more often: I forget this place exists.The counter-staff were noticeably friendly. Definitely worth checking out.",
                "reviewer_id": "3zxHXzxP6D6K6kvDImzMAQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6851257951399035,
                    "positive_probability": 0.3148742048600969
                },
                "stars": 4
            },
            {
                "review": "Love this place! I'm a vegetarian so I always the touffe without the crawfish. So good and if you're not a vegetarian, I still recommend that one! They also have great deals on Hooked so if you have that app, make sure to check out what deals they might be offering before you go in. My only complaint is that I wish they delivered!",
                "reviewer_id": "5TRf7FoWN1QmBb_iUaUOHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04421471480080507,
                    "positive_probability": 0.9557852851991931
                },
                "stars": 5
            },
            {
                "review": "Surprising find in Urbana, extended hours (10pm) for late night takeout.Food is not cooked to order, and is served from the steam table at the counter, but for the dishes they offer this really helps develop the flavor.On our first visit we had the red beans and rice (a little bland, not quite as smoky as I like RB&R to be), drunken chicken (very good), and bourbon chicken (sweet, and thankfully not that nasty teriyaki style bourbon sauce). The \"heat\" ratings on the board are pretty accurate for a mid-western palate, and but I think the food could use a touch more heat (yes, i could add some tabasco, but cooked in heat has different flavor than a couple of drops of hot sauce).Price was right, it was fast, and food was flavorful. Its a keeper ... hope it stays.",
                "reviewer_id": "7ZESoMS8JssvHjbrrIUuXg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06575853711638129,
                    "positive_probability": 0.9342414628836241
                },
                "stars": 4
            },
            {
                "review": "Drunken Chicken is a great slightly spicy dish. A great thing to change up the usual Asian take-out routine. Not a really large menu but everything I've had has been great.",
                "reviewer_id": "_H5MEMsNrbs-VU5DLPpcAg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1553701239225713,
                    "positive_probability": 0.844629876077429
                },
                "stars": 5
            },
            {
                "review": "I am extremely sad and disappointed in the fact that I only discovered this place in my last year in UIUC. The staffs are all friendly and are willing to let you sample pretty much everything before you make your purchase upon request. I am usually not that big on southern cuisine, but this place is the bomb! Not only do they serve gumbos over white or brown rice, they also serve it over nachos! The portions are huge for what you are paying for! I usually eat a lot so I can single handedly finish a full size serving, but my roommates who eat like a normal human split one serving into two meals. My personal favorite is the drunken chicken for those that are looking for some spicy kicks on your tongue. They are extremely fast as well. All the food are ready to serve. Simply have to walk in , order, and enjoy yourself! They also have a punch card available for those that plans to visit regularly ( which you should! )",
                "reviewer_id": "acbR6V3UTAsxe05lQiWWcQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0007142203012883726,
                    "positive_probability": 0.9992857796986978
                },
                "stars": 4
            },
            {
                "review": "We made our first visit to J Gumbos on a whim. We hadn't heard anything about it, but we love Cajun food. We both ordered the Lafitte bowl (portions come in half or full bowl sizes). The full bowl is a generous-enough amount of food, even for $8. The bowl came with a choice of bread; we both took the garlic bread.The Jean Lafitte bowl is half corn stew (sweet, cream-based) and half chicken stew (spicy, tomato-based). The corn stew was far too sweet for either of our palates (aka Bumblebee Stew, per the menu). The staff warned us that the chicken stew was extremely hot (aka Voodoo Chicken), but we found it only edging toward spicy. Fortunately, there was hot sauce on the table. We had a choice of adding toppings of cheese, sour cream, jalepeno slices, green onions, and seasoning.We also had a choice of white or brown rice as the base (corn chips are another option). The rice was a decent texture in each case (with the brown cut to a finer grain), but the rice-to-stew ratio was off: way too much rice. The chicken in the chicken stew was finely shredded and there wasn't enough meat to make it very substantial. However, the ingredients were fresh (something that can be hard to find in campustown, where many places serve pre-frozen and re-heated fare) and the recipes not far off the mark -- if modified to reduce the protein for costs and appeal to a public not comfortable with more authentic, stronger Cajun flavors. The bread was nothing special: commercial and lacking in texture or flavor.Overall: The food was decent, but not good or great. For the quality of the food, we each agreed we'd give it a 5 out of 10.J Gumbos is a national chain, with franchiser-owners, with the next closest located in Bloomington, IL. At the Urbana location, the staff were friendly and the restaurant was clean and comfortable: a step up from a crowded fast food environment.",
                "reviewer_id": "Co9VOK72zpB_nSWrgaNkLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.609742446112992e-07,
                    "positive_probability": 0.99999913902576
                },
                "stars": 3
            },
            {
                "review": "I usually don't write reviews but this place is terrific. I've been there 3 times now, gotten something different each time, and the food tasted terrific! The garlic bread is also really good.The employees (who I think are a husband and wife) are beyond friendly and always offer samples of their food if you don't know what to get.",
                "reviewer_id": "CQk3GiZhjmnt5-y7uEQtMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009021161104616725,
                    "positive_probability": 0.9909788388953787
                },
                "stars": 5
            },
            {
                "review": "Mmm. Take me back to Louisiana. I love this place. Everything is mushy and flavorful and mushy. I have soft spot for soft food. I am willing to embrace that my favorite meals could be considered by some to be a gross and desperate college rendition of Gerber's, and while I enjoy decadent, gourmet meals, J Gumbo's belongs to the former class and it's fucking fantastic. I give J Gumbo's five stars not because it's \"as good as it gets\" (we can surely all agree that this isn't a master chef-endorsed bistro), but because the food is delicious for its niche, a nice, fast, yummy gumbo place. Additionally, the staff is great. J Gumbo's outshines campus restaurants.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04479757054319319,
                    "positive_probability": 0.9552024294568007
                },
                "stars": 5
            },
            {
                "review": "I initially went here because a friend of mine had tried their food at a charity event.  This place motivated me to create a yelp account so that I could right a review.I am so glad they were at that event because I am in love!  Right off the bat they offer you a sample of any item on the menu.  This allows you to actually know if you are going to like what you are ordering.  I tried the bumblebee stew and said I wanted more spice.  The very helpful waiter recommended the Jean Lafitte.  It was a delicious mix of Voodoo Chicken and bumble stew.  My friend had their Drunken Chicken.  This one is delicious for someone who maybe doesn't want a lot of spice.  We did not realize how huge the portions were and everything sounded so good that we ordered the Crawfish Cheese dip as well.  It was fabulous!I am already planning on going again this week.  Food can draw me in, but as a college student, what really brings me back is a great price as well.  You can get a huge bowl that will give you left overs or leave you really full for only 7 dollars.  They also offer and half portion or 4.50. I recommend also grabbing a piece of cornbread.  You will not regret eating here.",
                "reviewer_id": "e3Of4RCyEsaQRywSKMUhJA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07895909319800083,
                    "positive_probability": 0.9210409068020029
                },
                "stars": 5
            },
            {
                "review": "This place turns my software into hardware if you know what I mean. Their gumbo is hearty and delicious. It feels like you're ordering from a mundane cafeteria though. I find it interesting that they have a desserts section but nothing in it.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7482860789739226,
                    "positive_probability": 0.25171392102608026
                },
                "stars": 4
            },
            {
                "review": "I thought that J. Gumbo was an independent business, but it turns out that it is a small chain. I love how it feels like a small business. The staff was all very friendly and gave their recommendations and answered our questions. They give out samples so that you know exactly which one you like the best. You can mix the different selections such as chilis and gumbos if you would like. I went with just one dish, the Drunken chicken. It came with some garlic bread which was toasted and buttered. You can order a smaller dish of any regular entree for $6 I believe. The big bowl is a lot of food, so consider getting a couple smaller dishes if you are with friends. I thought my dish was perfectly seasoned. They offered green onions, sweet garlic powder, and sour cream so you can customize it to your taste buds. It was warm; it was comfort food.I will definitely be going back to J. Gumbos and trying more of their selections!",
                "reviewer_id": "eWjqh5F-2tHtWhZODsJAyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.330167650836388e-05,
                    "positive_probability": 0.9999266983234915
                },
                "stars": 4
            },
            {
                "review": "Being born-and-raised in the Midwest, I am not an expert on Cajun food, but that won't stop me from reviewing one of my favorite eating spots in Champaign-Urbana.A micro-chain with just over 30 locations nation-wide, this Cajun joint get 5 stars from me. Upon entering, you are confronted with a number of various Cajun options. These can be eaten on rice, tortilla, or Po Boy (perhaps even a couple of other options). Don't know what you want? No worries. They are always urgent to allow you to sample upon finding out that you're a first time customer. The options are helpfully labeled with 'x' number of peppers aside each listing - an indication of the spiciness of the respective dish.I tried the gumbo the first time I dined at J. Gumbo's, which was not bad. It was a little bit too sweet for me, but that is a matter of personal preference. I found my dish afterward and have yet to look back --- Drunken Chicken. This dish is choc-full of flavor. It contains just the right amount of sweetness while packing the perfect amount of heat for one who enjoys moderately spicy food but isn't a daredevil. Get the green onions on top.The garlic toast that is served with each dish is a perfect compliment. Spoon some of the dish on top of each bite of the toast and enjoy!In terms of staff, they are always very helpful. The staff varies occasionally but is typically a selection from a group of 5-6 people. They enjoy offering you samples and are very helpful. The joint offers membership cards as well, which award you a free dish after 10 bowls bought, in case you're considering becoming a regular.In sum, I have nothing bad to say about J. Gumbo's. It is a chain and has a fast-food style, but the food you are getting is remarkable. Stop by, it is sure to be worth it!",
                "reviewer_id": "FE8MaLc2qM7sZvXvoRsSnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.2209371070451264e-06,
                    "positive_probability": 0.9999987790628737
                },
                "stars": 5
            },
            {
                "review": "Voodoo chicken just not very spicy, texture very dull, need some chunks of something to break up the monotony.",
                "reviewer_id": "FGLZNvO3x0lW-eo9WbUFSQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5889857206869996,
                    "positive_probability": 0.41101427931299916
                },
                "stars": 3
            },
            {
                "review": "Went with me and my man RON bear. We love good food and lots of it. He ordered voodoo because Ron is big and love him spicy sauce and I got the drunken one because of a committed relationship with liquor. Advice: Order with a buddy because you can do half and half orders. we split the red beans and the gumbo. Do a little bit of both over your chicken of choice. You make a Cajun slop salad of sorts but the shit is legit and I will be a repeat loyal maaanger.",
                "reviewer_id": "Gw3vDYXqELupfClvmFpUog",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04722739451951238,
                    "positive_probability": 0.9527726054804825
                },
                "stars": 4
            },
            {
                "review": "Only get the chicken dishes (generous portion sizes and flavorful) or the bumblebee stew (flavorful).  Everything else on the menu, which I've ordered, is underwhelming as the majority of other reviews acknowledge.  It's actually amazing how a deep brown gumbo broth looks so flavorful yet have not taste whatsoever; and you only get a small cupful of it!  Trust me, stick to the chicken and you'll have no regrets. It's what keeps me going back.",
                "reviewer_id": "hMpeqMPNKxIW4pPo6Moi4A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8601467161250824,
                    "positive_probability": 0.13985328387491283
                },
                "stars": 3
            },
            {
                "review": "I've never had a bad meal here. The garlic bread is very yummy! The service is excellent. They will let you try the food before you buy it. Great place to go with friends and family!",
                "reviewer_id": "hRflciflE77Ekmg5gGNwiQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07154426034977682,
                    "positive_probability": 0.9284557396502254
                },
                "stars": 5
            },
            {
                "review": "Offers a very good spice level but anything down toward the bottom end of that is a bit over-bland. Food is plentiful for the price and the service is usually quite good, I eat there a couple times a week. Recommend the Jean Lafitte hands down.",
                "reviewer_id": "hYh2hTAfio3UrafRljjuzw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3742081168017423,
                    "positive_probability": 0.6257918831982616
                },
                "stars": 4
            },
            {
                "review": "The food is solid cajun food though it could definitely be spiced up a bit more, but over all no complaints at all about the food!  The service is absolutely fantastic, the staff is always super friendly and don't hesitate to give you a bit more of the food to make sure you leave full and content.  The price is absolutely reasonable for what you get and this is somewhere I often love to visit.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009183055418072293,
                    "positive_probability": 0.990816944581927
                },
                "stars": 4
            },
            {
                "review": "After posting my second review for 1 star, I received a sincere message from the biz owner, which made me visit this place again.Crawfish ettoufle was still of the menu, sorry to see you go. I asked if they could make this, as well as the price. 6.25 bucks + tax = the maybe original crawfish ettoufleyes it's crawfish ettoufle...but seemed that some flavor disappeared from the ingredient list. idk why or just my perception. hmmm. it used to be 'heaven' and now is 'in the atmosphere'.better than on earth right?",
                "reviewer_id": "iZXnZSzTUWdXe_ZNIixgUA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9945882522841485,
                    "positive_probability": 0.005411747715856994
                },
                "stars": 3
            },
            {
                "review": "I dream about  eating half voodoo, half drinker chicken. Spicy, flavorful and delicious!  Perfect after a late night or anytime!",
                "reviewer_id": "jfnxH8u5ksFVLoZlyzIkEA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.691071740450891,
                    "positive_probability": 0.30892825954910935
                },
                "stars": 5
            },
            {
                "review": "I am a big fan of all things J Gumbo's. I'm not usually a big fan of Cajun/creole style foods, but I dig this getup. They have a fairly large menu of meaty deliciousness you can get over rice, chips, or a tortilla (I'm not positive on that last one. Don't hold me to it). I like my food with a kick and I was expecting to find that here. The voodoo chicken looked and sounded so promising. It is exceptionally tasty, but it's only moderately spicy. Even though I was disappointed with the lack of heat, every dish I've tried was intensely satisfying. The Jean Lefitte is a must-try. Also, the Drunken Chicken is their most popular dish for a reason, it has an insane flavor profile. Whatever you decide to try, make sure to get the garlic bread. Who knew something so simple and effortless could be so insanely delicious. Grab a mint, your breath will raise the dead.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14935264592836245,
                    "positive_probability": 0.8506473540716468
                },
                "stars": 4
            },
            {
                "review": "First time visit but it certainly will not be my last. What is so great about this place is that they allow you to sample all the dishes first. They have a variety like voodoo chicken, ratatouille, gumbo, white chili chicken red hot, other dishes all served over your choice of white or brown rice and you get a piece of garlic bread. I sampled the white Chili which was pretty delicious and then sampled the chicken red hot. Between the two chicken red hot was the winner especially since I love spicy food. The meal was super delicious and the portions are great. I didn't get the big bowl but the small that I got was more than enough. The prices are nice for the portions sizes. I will definitely be coming back to try the rest!! The atmosphere was great as well.",
                "reviewer_id": "kwQ7FNfDJ8Jz27EU-_wg0g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.629303118505434e-05,
                    "positive_probability": 0.9999737069688157
                },
                "stars": 4
            },
            {
                "review": "I've been here quite a few times now, it may be a bit out of the way but.... DEFINITELY worth it. I've never been less than blown away here. Chicken zydeco is my favorite, it's a sweet/spicy tasting shredded chicken and comes on top of a bed or white or brown rice and a slice of buttered bread. I would recommend getting the chopped green onions on top! As far as value for food to price ratio.... Phenomenal! Huge servings for pretty dang cheap. Go check it out!",
                "reviewer_id": "LBLCmg2aYjwrlBAwHZ-jlg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.525684640465251,
                    "positive_probability": 0.4743153595347578
                },
                "stars": 5
            },
            {
                "review": "I'm originally from Louisville, where J. Gumbo's started, and I'm so happy to see it here in Urbana! What's great about the place is that they have enough of a variety for folks who are new to Cajun food to get on board. For instance, the Bumble Bee Stew is my absolute favorite, and it happens to be both vegetarian and gluten free. There are lots of dishes to try, it's incredibly fast, and the garlic bread is delicious.",
                "reviewer_id": "li5fpIszc41BZwc4ML3VdQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0022147729989081236,
                    "positive_probability": 0.9977852270010953
                },
                "stars": 4
            },
            {
                "review": "This fast-food restaurant chain serves red beans and rice, jambalaya, Bourbon Street chicken, creole ratatouille, gumbo, crawfish etouffee, white chili and other chicken dishes.  They are located in the building just south of Krannert Center for the Performing Arts. We ate there on a Friday at noon and it was packed. My Voodoo Chicken was delish.  They were refilling the steam table because it was busy and the manager pulled out a plastic bag filled with an entree and squeezed the contents into the bin on the steam table.  This kind of procedure might be easiest and most efficient but the optics are all wrong.He should have carried the stainless steel tub into the back room, filled it from the plastic bag out of view of the customers, then returning to the front of the house with a piping hot tub of food.But it is quick, reasonably priced and the food was good.  The member of our group who got the Crawfish Etouffee was not as impressed with the taste.For no apparent reason they feel compelled to have two flat screen TVs which no one was watching, playing CNN as background entertainment while folks attempted to enjoy their lunch.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.768263865296746e-05,
                    "positive_probability": 0.9999223173613409
                },
                "stars": 4
            },
            {
                "review": "I got the Jambalaya and it was disgusting. I literally had 10 bay leaves in it (practically a whole tree). If you want good jambalaya go to distill. Don't waste your money on this food. The bread was dripping with butter. Perhaps this is good drunk food? I will never go back.",
                "reviewer_id": "Q_sDeVjJvMoQ5vdafAe0jA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.978710339301471,
                    "positive_probability": 0.021289660698527592
                },
                "stars": 1
            },
            {
                "review": "The Voodoo Chicken was so good that I ordered a second helping to-go for tomorrow. Set up a little like a deli, it's not super-fancy (which means no waiter to tip). The staff was super friendly, explained the spicy and non-spicy options, and offered samples right away. There was not a single marginal or overpriced menu item that I saw or tried. It was all excellent. Very unique for this area. All-in-all, it was a legit experience.",
                "reviewer_id": "QRc9cONXPe4GvsEV8eesjg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5355785228521358,
                    "positive_probability": 0.4644214771478628
                },
                "stars": 5
            },
            {
                "review": "I'm a guy who loves Cajun food, and this place hits the spot when I need a New Orleans fix!The food here is tasty, the spiciness is accurately described, and the folks behind the counter are nothing but professional! One of the unheralded selling points for me is a wide selection of Zapp's chips including spicy crawtater and voodoo chips. I've rarely seen those outside of Louisiana, and it's a delightful reminder of the crescent city!I've eaten here a half dozen times and I'm sold!",
                "reviewer_id": "SKP8Qo3dYyV82VLuAMHkRQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.016601564865657458,
                    "positive_probability": 0.98339843513435
                },
                "stars": 4
            },
            {
                "review": "I finally got to try this place yesterday after allowing my curiosity to linger for nearly a whole Spring semester.  I love cajun spices/flavors, but this was only okay for me.  I ordered the Drunken Chicken bowl, and while the flavors were pretty good, I think I was looking for a little more heat.  However, the portions were generous, and if you're looking for something quick & dirty, this is a satisfying alternative to your typical fast-food chains.  I'll be coming back to try some of the other items on the menu.",
                "reviewer_id": "TE7_0PKyx9nJ3lrHI15ycw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0019129098623161627,
                    "positive_probability": 0.9980870901376918
                },
                "stars": 3
            },
            {
                "review": "I had the gumbo, bourbon street chicken and crawfish etouffee here. Although I had no idea about cajun style cooking, I liked the first two of the aforementioned entrees. Just the right amount spices for my taste. The etouffee could have been better, turned out to be a little bit bland. The staff were really customer friendly and the serve size was adequate as well as appropriately priced. You can have a decent lunch with the small bowl for just $5~6 (beverage/ pop is not included). For this reason, I will be back for sure.",
                "reviewer_id": "TuVs2IndRJ6BPHy2uKiEOQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.712036107308409,
                    "positive_probability": 0.2879638926915845
                },
                "stars": 4
            },
            {
                "review": "Not really ever been a fan of the New Orleans style food scene but I have to say this is some tasty stuff. Very well prepared. If you want to break out of the sub/pizza/burger routine then I think you should give this a try. Menu is very foreign to most of us so ask questions or get a sample. They are very nice there. I think this is a place I will put into the rotation every so often for something different. Give it a try!",
                "reviewer_id": "tXxofyqdFPEb55a77nNo0A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6026640605346675,
                    "positive_probability": 0.3973359394653344
                },
                "stars": 4
            },
            {
                "review": "This review is LOOOOOONG overdue!!! One thing I really miss about my alma mater is eating at J Gumbo!!! The voodoo chicken over rice was my absolute favorite!!! Spicy, perfectly seasoned, actual shredded chicken breast (I hate rib meat) in a tasty red sauce on a bed of rice. Buttery garlic bread comes with. They have a punch card system!!! I feel like this was the main contributor to my freshman & sophomore 15.  I also like how they allow you to taste the chicken before trying it. Everyone has different taste buds, so it's great that they're cool about you tasting the food. I got to taste the jambalaya before buying, which I really appreciated.I literally texted my sister the other day & told her to bring home some voodoo chicken and freeze it for when I come home for thanksgiving. I hope she follows through on her promise!",
                "reviewer_id": "w8fSMa_-1lHFFi-ZwYEwdA (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0008525719368812505,
                    "positive_probability": 0.999147428063116
                }
            },
            {
                "review": "This review is LOOOOOONG overdue!!! One thing I really miss about my alma mater is eating at J Gumbo!!! The voodoo chicken over rice was my absolute favorite!!! Spicy, perfectly seasoned, actual shredded chicken breast (I hate rib meat) in a tasty red sauce on a bed of rice. Buttery garlic bread comes with. They have a punch card system!!! I feel like this was the main contributor to my freshman & sophomore 15.  I also like how they allow you to taste the chicken before trying it. Everyone has different taste buds, so it's great that they're cool about you tasting the food. I got to taste the jambalaya before buying, which I really appreciated.I literally texted my sister the other day & told her to bring home some voodoo chicken and freeze it for when I come home for thanksgiving. I hope she follows through on her promise!",
                "reviewer_id": "w8fSMa_-1lHFFi-ZwYEwdA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0008525719368812505,
                    "positive_probability": 0.999147428063116
                },
                "stars": 5
            },
            {
                "review": "I love this place! It's really affordable, and I love the fact that you can get free samples... How can you go wrong with that?? My favorite it the Jean Lafitte with the Drunken Chicken instead of the Voodoo Chicken (which is what it normally comes with). This is also the only place in town that has Crawfish-- a big plus!The garlic bread is yummy, and it's free with every meal, made with real french bread. (50 cents for an additional piece!) You definitely won't leave hungry, even if you try the half portions. The counter-staff are also really friendly :)",
                "reviewer_id": "w98MLlY4g_Zo0W6Xur7mOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0043788220684052945,
                    "positive_probability": 0.9956211779315992
                },
                "stars": 5
            },
            {
                "review": "I'm literally addicted to this place. I love everything about it. So fresh, decently prices, fresh as can be--and the workers are kind and willing to abide by the annoying requests to \"taste another flavor\". I would go here everyday if my wife let me. Suggestions if you don't already, get the Jambalaya on the bottom of practically anything. My personal favorites: jambalaya with bumblebee stew and zydeco chicken or on a normal day, drunken chicken with jambalaya. Addicted--and this comes from someone who's been to NOLA and couldn't stand anything jambalaya or gumbo related. That's why I didn't try this place for a whole year. I'm ashamed of that decision!!!",
                "reviewer_id": "XaOgsg43y93pzEm01DGtpA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4458016671541728,
                    "positive_probability": 0.5541983328458272
                },
                "stars": 5
            },
            {
                "review": "Yummy in my tummy is the first thing that comes to mind when I think of the Cajun food from J. Gumbo's. The other day I came in and had no idea what the food tasted like. The staff allowed me to sample as many dishes as I wanted. None of the dishes were bland but some might have had too much seasoning. The restaurant seemed to have a variety of dishes that catered to a wide variety of palates. If you prefer spicy food I would highly recommend the voodoo chicken but it might be too spicy for some spicy food eaters. For non-spicy eaters the drunkin chicken is a great choice.",
                "reviewer_id": "xkOQUAqnU-u6qSj9pBtukA (1)",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6229018707330626,
                    "positive_probability": 0.37709812926693087
                }
            },
            {
                "review": "Yummy in my tummy is the first thing that comes to mind when I think of the Cajun food from J. Gumbo's. The other day I came in and had no idea what the food tasted like. The staff allowed me to sample as many dishes as I wanted. None of the dishes were bland but some might have had too much seasoning. The restaurant seemed to have a variety of dishes that catered to a wide variety of palates. If you prefer spicy food I would highly recommend the voodoo chicken but it might be too spicy for some spicy food eaters. For non-spicy eaters the drunkin chicken is a great choice.",
                "reviewer_id": "xkOQUAqnU-u6qSj9pBtukA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6229018707330626,
                    "positive_probability": 0.37709812926693087
                },
                "stars": 4
            },
            {
                "review": "Although I appreciate Cajun food, I found the food to be tasteless even though the portions were great for the price (under $8 for two dishes).I ordered the red beans and rice and bourbon chicken. I was expecting chunks of bourbon chicken but it was shredded. I believe the red beans and rice came with some andouille sausage, but the sausage lacked kick. Perhaps this is what J Gumbo's meant by how neither of these dishes were spicy since J Gumbos has a spice rating on their menu.If/when I go back, I plan to go for the very spicy stuff in hopes of more flavor.",
                "reviewer_id": "XOnwygK-EerILmQSxP2K6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025710908562534423,
                    "positive_probability": 0.9742890914374587
                },
                "stars": 2
            },
            {
                "review": "Some of the best Cajun food I have ever had. I did a mix with three items with advice from the staff. They were very knowledgable and their suggestions were delightful!",
                "reviewer_id": "yz32fad4cJZINjaQX_7PZg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7867895518557885,
                    "positive_probability": 0.21321044814421303
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "Cu4WjKd2EZ-b5PxPXyH9EA",
            "ew5MdPbrBWKV6XIO9_gieA",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "doCqqCuoDsIQYDSY2gkUtQ",
            "umq8alp-uLf3hXnpSC99WA",
            "k0kNhfkp1GrYE15YDApKMg",
            "6M1F5AECDtWff1Tu3uLEWA",
            "TD11IPIlFL9sLAWbN9FzdA",
            "pygZcdPZ-XMp8CY8_5tE8A",
            "5FPsw0_mNhylWujmJHseCQ"
        ]
    }
}