{
    "4UG9uGnByKgoiuVpC0DthA": {
        "keywords": {
            "bigrams": [
                "chinese_food",
                "tip_enforced",
                "authentic_chinese",
                "garlic_sauce",
                "portion_size",
                "golden_harbor",
                "okay_impressive",
                "hot_pot",
                "fish_bitter",
                "americanized_chinese"
            ],
            "unigrams": [
                "food",
                "chinese",
                "place",
                "restaurant",
                "price",
                "fish",
                "good",
                "tip",
                "service",
                "menu"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wi-Fi": "no"
            },
            "business_id": "4UG9uGnByKgoiuVpC0DthA",
            "categories": [
                "Food",
                "Desserts",
                "Barbeque",
                "Chinese",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "140 Lincoln Sq Mall\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:30",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "12:00"
                },
                "Thursday": {
                    "close": "21:30",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:30",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:30",
                    "open": "11:00"
                }
            },
            "latitude": 40.111024,
            "longitude": -88.197063,
            "name": "Tang Dynasty",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/dyIeMIws_Zm-p7ZbIMTvVQ/ms.jpg",
            "review_count": 13,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "We stuck to the authentic Chinese side of the menu, and on the waiter's recommendation ordered one dish for each of us: half duck no bones, potatoes/eggplant/peppers, and spinach in garlic sauce. I ordered lunch online and got a call asking me to tip more and order more dishes, because it is a long way from the restaurant to my place in Savoy. In general, this is a great place to come if: you like real Chinese food or quality Americanized Chinese food, enjoys above average food and services, and willing to pay for the food and service. ",
        "reviews": [
            {
                "review": "I can't believe this place only has one review on Yelp so far!I was taken here recently for my going-away dinner, and I was BLOWN AWAY. The food is incredible! It is in the same price-range as Golden Harbor (which I love), but in my opinion the food here is even better.We were a party of 13, and were seated comfortably in the large table in the side room. The owner of the place took our orders, and she was wonderfully fun/sassy about it. She gave great recommendations, and would tell us if she thought we were making an unsuitable selection.Cuisine highlights:- GARLIC SAUCE, anything in garlic sauce was delicious (beef, eggplant, etc)- Beijing duck (wraps had good texture, duck was cooked well, good sauces)- Crispy tofu (crispier coating than from Golden Harbor)- Fish with pine nuts (fish was battered and fried, and drizzled with a sweet sauce)- Steamed tilapia (very tender)- Scallion pancakes (owner served us two orders for free)- Kung Pao Tofu (all-around delicious)I had been skeptical of the place because of its location in the eerily-deserted Lincoln Square mall, but they renovated the place a few months back, and the ambience is great!My only regret is, having gone away, I can't partake in this sumptuousness anymore :(",
                "reviewer_id": "8S5-Oyrsl3sBG5uxCablfw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.073948857890781e-05,
                    "positive_probability": 0.9999792605114146
                },
                "stars": 5
            },
            {
                "review": "The price on the menu is cheated. When I argued about the misleading price on the menu during checkout, the owner became rude and personal. The owner of this restaurant doesn't take business honesty as a serious thing. The attitude of her is arrogant and impolite. My girlfriend and I had very bad experience there.",
                "reviewer_id": "cPtl6NE9vl9oPtaTVOfzNw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008077166211938415,
                    "positive_probability": 0.9919228337880592
                },
                "stars": 1
            },
            {
                "review": "I love this restaurant - you can choose from the traditional menu or American menu, so just about anyone will find something they like.  The prices are also very reasonable for the amount of food you get. I keep coming back to the dry tofu hot pot (soo good) and I can get at least 2, usually 3 meals out of it.  The owner is also very friendly! Highly recommended!",
                "reviewer_id": "ePDAvEQ_ZNfEhfqeJUewQA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04453352222571938,
                    "positive_probability": 0.9554664777742791
                },
                "stars": 5
            },
            {
                "review": "It's a great Chinese restaurant with good service. Menu is always updating and they just had a all new dec.",
                "reviewer_id": "JpiL2e-KCcOqemErU9a13Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.37588584972406835,
                    "positive_probability": 0.6241141502759309
                },
                "stars": 5
            },
            {
                "review": "I visited this place after a year. The quality has become much lower than what I experienced in the past. The whole plate was filled with white rice, with very little veggies and chicken (perhaps 2-3 spoons). I just had to eat dry rice, which were also overcooked. It seemed the management is trying to save costs by cutting the portion size, while charging the same price. Next time I will pay more at a different restaurant, which does not try to compromise with quality and portion size. I was so unhappy with their service that I did not pay tip. But later I saw that they added $1.00 to what I had signed on the receipt.",
                "reviewer_id": "M3OaoH0CdpP7nfDRfQvVsg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0008927808084498913,
                    "positive_probability": 0.9991072191915542
                },
                "stars": 1
            },
            {
                "review": "food is okay but not impressive.  The price is high. Tip is enforced no matter how the service is . I do not think it at all",
                "reviewer_id": "OHlNjcJko1RYE2Ihv7sOMQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5185649532228933,
                    "positive_probability": 0.4814350467771058
                },
                "stars": 2
            },
            {
                "review": "Dinner for three last night. We stuck to the authentic Chinese side of the menu, and on the waiter's recommendation ordered one dish for each of us: half duck no bones, potatoes/eggplant/peppers, and spinach in garlic sauce. The duck was good though the \"pancakes\" were cold. The spinach was acceptable (and looked like a popular dish, considering how many other tables were ordering it). But the best thing hands down was the eggplant dish, which had the best sauce I think I have ever tasted. You will like eggplant after trying this dish! There was plenty of food for all of us, and we even took some home afterward; the vegetable dishes are large portions. Price was totally reasonable. Only real complaints are that the \"hot\" tea was barely warm, and that we had to flag down our waiter to bring the check, even though we'd been sitting over empty plates for quite a while.",
                "reviewer_id": "osa5VWfKat-N8cW-7tMqWg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006579131350438801,
                    "positive_probability": 0.999342086864963
                },
                "stars": 4
            },
            {
                "review": "Favourite Chinese restaurant in Chambana. I've tried hot pot and some other traditional Chinese food there. Sometime the food is not so impressive but definitely above average. Love the roasted duck here!",
                "reviewer_id": "piHfqvlPPfmoJpgCtIp4Eg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13142090622507777,
                    "positive_probability": 0.8685790937749247
                },
                "stars": 4
            },
            {
                "review": "",
                "reviewer_id": "sfswIxWJKcT5g4nUnD4EUw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 5
            },
            {
                "review": "the delivery experience was horrible. I ordered lunch online and got a call asking me to tip more and order more dishes, because it is a long way from the restaurant to my place in Savoy. Even after I explicitly told them I am fine with the amount of food I ordered (over $30), the guy still tried to ask me to order more and threatened not to deliver until I agreed to pay the so called additional delivery charge. All I want to say is that I understand it is a relatively long drive to savoy, but all other restaurants in town does delivery to Savoy with a lower charge and will never bother to call customer threatening them to order more.",
                "reviewer_id": "tFQ86uRQ-w3rIp0DEk8Ddw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0021138979840552253,
                    "positive_probability": 0.9978861020159445
                },
                "stars": 1
            },
            {
                "review": "It was my WORST experience in my life. I wish I could gave zero star on it. I ordered a fish and it tasted really bitter. When I was complaining with my friend that the fish was bitter, the waiter heard it and said he would talk to chef and replace a new one. I was surprised about how kind he was. 5 minutes later the chef came to my table angrily and was YELLING at me in front of other customers \"are you lying ? I tasted the fish before it got served and it was not bitter.\" I was eating with 6 friends and it was just so sudden. I was so embarrassed and almost crying into tears. I was NOT lying and your fish is bitter! I'll never been this place ever ! The worst service I've ever had.",
                "reviewer_id": "X8jRayPUEOiIARQaVULcjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31867170318771526,
                    "positive_probability": 0.6813282968122801
                },
                "stars": 1
            },
            {
                "review": "Let me try to give a fair review on both sides.Pros:1. Authentic Chinese food. Though more inclined towards a Northern style. But nontheless delicious.2. Variety of Americanized Chinese food, including the all-mighty general cao's chicken, plus lunch special.3. Deserts and snack-sized dishes () are beyond comparable in CU area.4. The ONLY restaurant that opens late-night which serves authentic Chinese food rather than fast food.5. Services are above average.Cons:1. Above averagely pricy. Usually $2-$4 more expensive then similar dishes served elsewhere in CU.2. Delivery may be slow during busy hours (~40mins to ~1hour). 3. 15% tip is enforced on Chinese customers, due to their tendency to tip waiters inappropriately or not tipping at all. But if you look like a gentlemen/lady who appreciates the service of others then they won't enforce anything on you, liberty of tipping is all yours.In general, this is a great place to come if: you like real Chinese food or quality Americanized Chinese food, enjoys above average food and services, and willing to pay for the food and service. This is not a good place to come if: you would prefer to save up a little money and settle for okay food (Panda Express is always an option, right? lol), or your meal budget doesn't include tips like it is for most cheaper Chinese places.Hope this helps.",
                "reviewer_id": "Y7TaGvsfK8wbKoIkqMguOg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00021728461840081053,
                    "positive_probability": 0.9997827153816187
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "DB5rZ9spvyhBJsqOwckncw",
            "u06X5C_pIAVuOXOznIcPYw",
            "i0_W9_1abdjBS7d5-pWORQ",
            "qRgEy-m4sejzTKphIFKFkw",
            "rzH3NU9teI9WVKt-hBsJjg",
            "rE8048_DAh3Z8Tep466wrA",
            "M5E7DW8rqI4v37HhD2pzGQ",
            "umq8alp-uLf3hXnpSC99WA",
            "Kck9wE9Z1S_xxzglh1Qdwg",
            "6M1F5AECDtWff1Tu3uLEWA"
        ]
    },
    "tSObxv4wRa99nEDaB8Xisw": {
        "keywords": {
            "bigrams": [
                "bubble_tea",
                "milk_tea",
                "green_tea",
                "mango_green",
                "half_hour",
                "tea_tasty",
                "come_back",
                "tea_house",
                "gift_cards",
                "place_bubble"
            ],
            "unigrams": [
                "tea",
                "bubble",
                "milk",
                "sweet",
                "mango",
                "back",
                "great",
                "green",
                "come",
                "try"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "tSObxv4wRa99nEDaB8Xisw",
            "categories": [
                "Food",
                "Bubble Tea",
                "Cafes",
                "Desserts",
                "Juice Bars & Smoothies",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "410 E Green St\nSte 2\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.110554,
            "longitude": -88.232373,
            "name": "Milk Tea House",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/mplhXeodLMzrLZPBJoF_Kw/ms.jpg",
            "review_count": 15,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Would definitely come back if I come down for a visit again to try a new flavor. I had to wait half an hour for my drink and there weren't even that many customers at the time. Came here on grand opening day and although it did take a while to receive my order, I came back the following weekend and the service was indeed much better! ",
        "reviews": [
            {
                "review": "The first time I went with my girlfriend she had a disappointing experience with their macha bubble tea while I got the mango bubble tea which was so-so. I went again and order the almond bubble tea and it was complete trash. I only took two sips before throwing it out. This place is garbage.",
                "reviewer_id": "B6CG3zfADjG6DoVnj6U04Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3900706438151546,
                    "positive_probability": 0.6099293561848435
                },
                "stars": 1
            },
            {
                "review": "We've been waiting half an hour for our drinks and still haven't gotten them.I came earlier in the day and their milk teas are very weak, tastes like water and powdered flavoring with no semblance of a tea flavor. It's all hype but  they are ridiculously slow and the product isn't even good. Never coming here again.",
                "reviewer_id": "fgaQKuljQcO9xTVzqL-81Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8920686190553638,
                    "positive_probability": 0.10793138094463307
                },
                "stars": 1
            },
            {
                "review": "I had to wait half an hour for my drink and there weren't even that many customers at the time. The drinks tasted watered down and the only taste I could gather was the jelly they added because they ran out of boba, which I didn't even request. The product was not worth the long wait. Definitely do not recommend.",
                "reviewer_id": "iiUTeJN_iJBhxp5VuwoDDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2972103855592387,
                    "positive_probability": 0.7027896144407596
                },
                "stars": 1
            },
            {
                "review": "Most authentic bubble tea place in the entire Champaign-Urbana area! For those looking for real bubble tea that's not over sugary with a plethora of flavors, look no further! The gift cards are also a great investment too - $50 gift cards have a $10 bonus, and $30 have a $5 bonus! Will definitely be back in the future.",
                "reviewer_id": "J1mSzzc2UQN9r5TvWJvWgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02154743045393613,
                    "positive_probability": 0.9784525695460599
                },
                "stars": 5
            },
            {
                "review": "The grand opening buy 1, get 1 free deal ended, and that might also be the end of my visits here. They just opened on 4/24, and I think they're off to a shakey start. I do enjoy the taro milk tea though! I also really like their cartoon animal cups and lid covers that sort of teach you Chinese fruit names. Depending on when you come, there may be a large crowd of people, which means your order will take some time to make as they make everything to order - nothing is premade. Also, they don't allow for customizations. You can only get what's offered on the menu - no fruit substitutions, etc. Unfortunately, there are only two tables to sit at, so you'll likely be standing around while waiting. I hope they'll get more chairs and tables because there's a lot more room in the shop.My one pet peeve is that some of the fruit syrup they use to flavor their milk teas tastes weirdly artificial. I got a strawberry milk tea and it tasted like I was drinking a liquid, watered down strawberry ring pop. I tried a friend's mango green tea and it was ridiculously sweet with a tang of mango. Otherwise, it's not very remarkable milk tea that would make me come back.I'd give them two and a half stars, but I bumped it to three because the service is really nice and the employees do try very hard to get the orders correct. Also, when I came on Friday as they were closing up and finishing the last orders, the owner lady gave me and my friends free drinks to try anyway, which was sweet of her. Everything on the menu is relatively inexpensive and under $5.",
                "reviewer_id": "JsHky2NY-FvugF8WTMsZtQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10522950143547392,
                    "positive_probability": 0.8947704985645382
                },
                "stars": 3
            },
            {
                "review": "Taste is awesome, the space is small but cute. They play Chinese music, which takes me back to my summer abroad. Just a little pricier than I would like, 3.50 for the smallest size which is labeled medium but is more like a small. Original Milk Tea is so tasty :)",
                "reviewer_id": "jzHYOVZbns5qY08149moKg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0223016133538187,
                    "positive_probability": 0.9776983866461794
                },
                "stars": 4
            },
            {
                "review": "The wait is long but I can understand it. They don't pre make things. However, the powder they use for the drinks is too sweet and overwhelming. And my coffee jelly was hard :( not a fan.",
                "reviewer_id": "KBsh9Y0qz9O9uaZqfkSG9Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27395334301921753,
                    "positive_probability": 0.7260466569807841
                },
                "stars": 2
            },
            {
                "review": "So randomly visited my alma mater and stumbled upon this place since I was craving a smoothie and apparently smoothie king is gone.  They just opened up recently or maybe even today.  Looks nice and clean and they have like way more workers than they probably need. I ended up getting a taro bubble tea and the gf got matcha milk tea.  Not sure if it's a promo or something but the tea was free!  Whoo hoo.  Anyway,  the bubble tea was delicious for 4.50 for a large. Would definitely come back if I come down for a visit again to try a new flavor.",
                "reviewer_id": "kKhktrVTWqDUom8ZbxE8JA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04662851196544147,
                    "positive_probability": 0.9533714880345534
                },
                "stars": 5
            },
            {
                "review": "Milk tea house is great! If you've had a bad drink, I encourage you to go back and try something else - they have tons of things on their menu (especially since they just added a lot of new things) like boiled tofu, chicken wings, and great shaved snow ice in several flavors (taro, coconut, mango, chocolate, green tea, etc.) in addition to lots of great drinks. C",
                "reviewer_id": "lJw_0CG8isgttEMIVUEtkg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06015472195129363,
                    "positive_probability": 0.939845278048703
                },
                "stars": 5
            },
            {
                "review": "Came here on grand opening day and although it did take a while to receive my order, I came back the following weekend and the service was indeed much better! One of my personal favorites is their mango green tea. It isn't made too sweet, but isn't too bland, either.The staff there are friendly, price is reasonable and with the new addition of the daily 25% off specials as well as having met my current boyfriend here, I have no choice but to give it 5 stars!",
                "reviewer_id": "mUlzfW1cEL4qtEXfB4_y2g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11762654360909547,
                    "positive_probability": 0.8823734563909034
                },
                "stars": 5
            },
            {
                "review": "A great place to go for bubble tea! The decor is nice and homey, and the staff is very friendly! It's more or less the bubble tea shop I wish we've had on campus for the last 4 years. And they actually have non-milk fruit teas (which I highly recommend)!",
                "reviewer_id": "nMLiGbzq7C6iogrlcUejPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09679383108089878,
                    "positive_probability": 0.9032061689190996
                },
                "stars": 5
            },
            {
                "review": "I just tried their new products..like eel don and boiled food (i forgot the name)... Do not recommend at all",
                "reviewer_id": "p6ex4oQN1D0WU4xdAIHlYA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9256769802557836,
                    "positive_probability": 0.07432301974421866
                },
                "stars": 1
            },
            {
                "review": "Tried this for the first time. They've added about a half dozen more tables, have some privacy screens up, decor is cute. Workers were earnest and ready to help. I had the mango green tea and it was tasty, not too sweet, hint of green tea flavor and the jelly was soft and fresh. Only three bucks for a medium too. Service only took a few minutes, no line, just steady customers, few people sitting down. No complaints here!",
                "reviewer_id": "tBiAJtAB4RsXiB4uWxtWrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005181278916143657,
                    "positive_probability": 0.9994818721083795
                },
                "stars": 4
            },
            {
                "review": "I come here almost every day! Milk tea house is hands down my favorite place for bubble tea. I used to only get their bubble tea, but since I have been coming here so often, I decided to try everything on their menu. Though some things are pricey, they are all so delicious and worth it! (Except maybe the roasted sweet potato because it was just a sweet potato lol)",
                "reviewer_id": "tltp1yeqycXSUF73zXJ5uw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08667961623948627,
                    "positive_probability": 0.91332038376051
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "9nmeU-OOyxkn8vRy5dolNg",
            "p8GMdsCCy-NV_wZuDaU2Jw",
            "IZOKtFjm_hiL4OGmCq2NNA",
            "oHKjjwehNipcGIYBThWg9w",
            "4UG9uGnByKgoiuVpC0DthA",
            "wO8c-FbduauxCGiEHchGRA",
            "0P0XckSv_2_ZNKoYlhT4Gw",
            "caK31Iq3TClNCRB9WH9lhQ",
            "YkKEsYsSpOkDBbHBGKuWQA",
            "DntkMrzlbFPdOdxJtEWLBw"
        ]
    }
}