{
    "2UAbUSTMsR9G26A8AYO3dA": {
        "keywords": {
            "bigrams": [
                "french_toast",
                "breakfast_special",
                "greasy_spoon",
                "american_fries",
                "hash_browns",
                "breakfast_food",
                "food_good",
                "order_french",
                "best_french",
                "two_eggs"
            ],
            "unigrams": [
                "food",
                "toast",
                "breakfast",
                "french",
                "place",
                "sam",
                "good",
                "special",
                "two",
                "greasy"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": false,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": true,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "yes_free",
                "Caters": false,
                "Corkage": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": true,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "2UAbUSTMsR9G26A8AYO3dA",
            "categories": [
                "Breakfast & Brunch",
                "Diners",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "115 N Walnut St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "14:00",
                    "open": "06:00"
                },
                "Monday": {
                    "close": "14:00",
                    "open": "06:00"
                },
                "Saturday": {
                    "close": "13:00",
                    "open": "06:00"
                },
                "Sunday": {
                    "close": "13:00",
                    "open": "07:00"
                },
                "Thursday": {
                    "close": "14:00",
                    "open": "06:00"
                },
                "Tuesday": {
                    "close": "14:00",
                    "open": "06:00"
                },
                "Wednesday": {
                    "close": "14:00",
                    "open": "06:00"
                }
            },
            "latitude": 40.1169853,
            "longitude": -88.2427068,
            "name": "Sam's Cafe",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/FRDH3t03Nb7aIZmlp4A59A/ms.jpg",
            "review_count": 69,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The service is fast, the food is super-quick and quite cheap (I got a breakfast special: bacon, 2 eggs and toast--for $3.50. Sam's Cafe has great breakfast food and very friendly staff at a good price. I definitely will be back here again Just for the French Toast, but I'm sure the other food has to be good as well as I saw others plates come out. ",
        "reviews": [
            {
                "review": "The French toast, oddly pancake style, is to die for. Also great to eat the ethnic food in the evening when available.",
                "reviewer_id": "-9JGmOgqza0FDkzYLP48Zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18215463077689575,
                    "positive_probability": 0.8178453692231057
                },
                "stars": 4
            },
            {
                "review": "Sam's has the best pancakes I've had in quite a while. The coffee was really good too and my bacon and eggs were delicious. Sam is a charming man with a big smile, and the other staff is great too. This is so different from the bland franchise food that dominates modern American life - authentic diner food and really cheap :))For a while, Sam's served Lebanese food on Thursday/Friday nights, but not at the moment. Wish it would make a comeback, because I've heard the food was fantastic!",
                "reviewer_id": "-FqXwGg8isV0ap9U1q7p6g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.030015936712583367,
                    "positive_probability": 0.969984063287418
                },
                "stars": 5
            },
            {
                "review": "I got Sam's French Toast with a side of eggs and the eggs were fine but the french toast mostly tasted of everything else that was on the grill. I think if there were separate grills for meat vs other items it would've been better. Friendly service though.",
                "reviewer_id": "1DeSfxo0l7n8lOec_qd5DA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06915462052314796,
                    "positive_probability": 0.9308453794768572
                },
                "stars": 2
            },
            {
                "review": "This place is what it is. A cheap greasy spoon dive with a cash only policy. If that sounds repulsive to you, don't go!If not, go and definitely have the French Toast.Service is ok at best but wth?",
                "reviewer_id": "2wvsTvuxcpAHpHlfovTv6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.37294699882985277,
                    "positive_probability": 0.6270530011701495
                },
                "stars": 4
            },
            {
                "review": "They have the  best French toast. My husband always ordered Denver omelette where we were here. The price is also very reasonable :)",
                "reviewer_id": "3kVrBV9PwJBgmFyI4PZr-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08662648696842803,
                    "positive_probability": 0.9133735130315724
                },
                "stars": 5
            },
            {
                "review": "This is, by far, the BEST place to eat breakfast anywhere in the world.Do not leave Sam's without trying the pancakes. Even if you don't care for pancakes, you will explode in flavorful bliss when you try them. Sounds a little creepy, but it's true.",
                "reviewer_id": "5PQuZD80WNbf_oFw-ahXMQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9329221237519864,
                    "positive_probability": 0.06707787624801441
                },
                "stars": 5
            },
            {
                "review": "Amazing breakfast! So delicious, a customer finishing up when we sat down recommended the french toast and I'm glad we tried it.Be prepared: Sam's is a small place so you may have a wait (like a line wait, not a take a # go get a coffee wait) and its cash only so be sure to stop at the ATM on your way.",
                "reviewer_id": "60juruDHOc7-yhc2bE2Elw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6051266375255836,
                    "positive_probability": 0.39487336247442034
                },
                "stars": 5
            },
            {
                "review": "Sam's Cafe has a Lebanese dinner menu now, like Amanda W. said, which includes the staples, such as hummos with a delicious puddle of olive oil,  crispy falafel, Greek salad chock full of feta, overstuffed dolmades, tabbouleh & baklava (not homemade, w/ pistachios).  Two highly recommended plates you can order are the Shish Taouk (chicken kebab) or Breaded Tilapia (one of their specials). The woman who started the menu recently emigrated to the US after the tragedy in Lebanon. Go support local business!",
                "reviewer_id": "7zSppEZd2C6ASpNeBebxAA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06063698374890254,
                    "positive_probability": 0.9393630162511
                },
                "stars": 4
            },
            {
                "review": "Stood in there for twenty minutes before anyone noticed us. Four tables without people, all covered with plates and trash. We were told it would be awhile because there were no tables. Incredibly rude, clearly don't care for customers or loyalty. Will not be returning.",
                "reviewer_id": "9FOYCNxxGDlBRfAgK3IB7A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4153173935653507,
                    "positive_probability": 0.5846826064346456
                },
                "stars": 1
            },
            {
                "review": "Four stars bc they could clean up the place and yes, utensils are just old..  but what are you expecting from an old place that hasn't been renovated in a while? ok enough of the rant..I came in because it was rated highly and I did get the French Toast, which is their specialty and recommended by others. It was Amazing, to say the least. I definitely will be back here again Just for the French Toast, but I'm sure the other food has to be good as well as I saw others plates come out. The only stipulation about this place I have, is they only take cash.. so remember to bring Cash with you.",
                "reviewer_id": "9ScardfadcsD_A5XpqEv3Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02093240234726624,
                    "positive_probability": 0.9790675976527363
                },
                "stars": 4
            },
            {
                "review": "great little greasy spoon here in champaign. delicious and cheap pancakes.  only down side is they only take cash, no credit or debit",
                "reviewer_id": "_W8RFMuPVTqwXKHRFHgmvA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21478418425680396,
                    "positive_probability": 0.7852158157431969
                },
                "stars": 4
            },
            {
                "review": "The service was excellent and the place seems to be busy every time I visit. Have always gotten breakfast, and the food has been wonderful every time. I recommend Sam's Cafe!",
                "reviewer_id": "Ah3DGqw43fKmbaoPwBU7VQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04813872342452107,
                    "positive_probability": 0.9518612765754778
                },
                "stars": 4
            },
            {
                "review": "Just stopped through on a road trip and the French toast is to die for. Amazing service. Lightening fast.",
                "reviewer_id": "B_0iozXb-wdO1IRBlJ0TQg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7531085590270585,
                    "positive_probability": 0.2468914409729406
                },
                "stars": 5
            },
            {
                "review": "If you go to Sam's, you probably already know what you're going for. It's not for ambiance or subtle flavors or lunch... it's for delicious breakfast food. It's not exactly a new trend to sing the praises of small greasy-spoon style places, but there is a reason for that: no $30 fancy brunch can ever really inspire the same satisfaction that  getting gratifyingly greasy french toast, pancakes, sausage, and hash browns for a few dollars can.",
                "reviewer_id": "bHCAZYvsh9LkydyBNl2PGA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04318791469135063,
                    "positive_probability": 0.9568120853086594
                },
                "stars": 4
            },
            {
                "review": "This is the breakfast place of my dreams!  Two people, breakfast, less than $10.00!I know, it's not fancy.  They don't have smoothies or espresso like La Peep, they don't have stuffed pancakes like Ihop, and they don't pretend they're something they're not, like others.However, the food was really good, the coffee drinkable and the service friendly.Now if it would only move toward Urbana...",
                "reviewer_id": "BZjl6W41tc5E2wWyvJ23gQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8882368767544276,
                    "positive_probability": 0.11176312324556821
                },
                "stars": 4
            },
            {
                "review": "Took my dad for breakfast and even he noticed it was dirty and that's saying something! The wait person was prompt and friendly. The food was just s bit too greasy and eggs were over cooked. I don't think we'll be back.",
                "reviewer_id": "CGKrk7ZPDD-Sb1ssOFnYkA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08514036780416077,
                    "positive_probability": 0.9148596321958388
                },
                "stars": 2
            },
            {
                "review": "It is a small crowded place serving inexpensive and ok food. But I think it is over rated in yelp.",
                "reviewer_id": "dPjYfacluGoHiCRjDmIIlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07438068327766709,
                    "positive_probability": 0.9256193167223349
                },
                "stars": 3
            },
            {
                "review": "This place gets so much hype on Yelp that my friends and I decided to try it. Sam's Cafe is super cute-looking from the outside. But that's where the good stops. Well, the waiter was really nice. But other than those two things, I see no positives about this place. I would much rather go to another well-known diner in this town ;)! The food was floppy and soggy and the utensils were not washed well... Maybe we ordered all the wrong things... Seems like that could be a possibility seeing that this place has 4 stars.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5253977675581675,
                    "positive_probability": 0.47460223244183736
                },
                "stars": 1
            },
            {
                "review": "They have a really good breakfast special. It is cheap and good.",
                "reviewer_id": "e5kUp-BFI-PttvVNKGT03Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7214773208780508,
                    "positive_probability": 0.2785226791219499
                },
                "stars": 5
            },
            {
                "review": "The biggest flaw of this place is the extremely slow wait times. There seems to be only one cook. I set my parking meter to an hour and twenty minutes and it was expired by the time I returned to my car. That meant that we waited around fifty minutes for our food. The staff is relatively amiable. However, I did catch them complaining about a customer who wanted her order done sooner. They talk about that customer as if she was in the wrong. Another problem are the extremely small tables. Its greatest strength are its really good prices. The breakfast special is $4.75 I believe for two eggs, two pancakes, and two sausages or bacon. It costs $6 if you want to include the misnamed American fries and coffee. Their \"American\" fries is actually very soft hash browns.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8371892244195323,
                    "positive_probability": 0.16281077558047485
                },
                "stars": 2
            },
            {
                "review": "Best French toast in town!!",
                "reviewer_id": "EnA4CHcOwDq_XcLZBI1q8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4160173642030276,
                    "positive_probability": 0.5839826357969721
                },
                "stars": 4
            },
            {
                "review": "I went here for breakfast and I was quite happy. I had a bacon and cheese omelette and hash browns. It was inexpensive and very tasty. It is a no frills greasy spoon type of place but I kind of like that.",
                "reviewer_id": "EvH6_Z7px4opHEDr0ig4Ww",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8657143385198143,
                    "positive_probability": 0.13428566148018414
                },
                "stars": 4
            },
            {
                "review": "Did you know the specials are here at the top? Because the greasily myopic server will remind you of this no matter how frequently you visit.  You could get the best damned French toast in the world at Sam's every weekend, and I'm pretty sure he'd still point out the special.Did you read what I wrote there?  Best. Damned. French. Toast. In. The. World.How is it so good?  That's a good question.  Somehow the combination of totally ordinary white bread and totally ordinary pancake batter transcends the potential of both parts to result in something truly drool-worthy: a giant slab of golden brown toast in a pool of butter and syrup.  If you like French toast, there's no reason to consider anything else on the menu.BUT if you do, you'll find that they also have grits - a rarity above the Mason-Dixon line - swimming in butter, crispy bacon, truly over-medium eggs, and delicious pancakes.  The coffee is, well, blackish, but it's really not fair to judge a diner on the quality of their coffee.  Your mug will always be full, for better or for worse.My husband and I moved away from Champaign in 2007 but make a point of having breakfast at Sam's whenever we're back.  There are better-for-us breakfasts in Champaign.  There are fancier breakfasts in Champaign.  But there's only one Sam's, and we'll keep coming back as long as it sticks around.",
                "reviewer_id": "Ez5s5sU6jqdxwDnpE5KiCg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3054484618011453,
                    "positive_probability": 0.6945515381988396
                },
                "stars": 5
            },
            {
                "review": "My favorite breakfast place of all time here.  It's your typical cafe, everything done the way you would want it.  Don't even bother with Merry Anns just come straight to Sams.  So the food is greasy... if you're not into that you can order it light on the butter/grease.  They make everything to order (duh).  Sam and his family are some really hard working people and it shows.  I'm just so happy at Sams, bottomless coffee and eggs all to the tune of 5 dollars. You can't go wrong!",
                "reviewer_id": "F5RtyAOJXpHGtwGR100YrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4133744558086797,
                    "positive_probability": 0.5866255441913176
                },
                "stars": 5
            },
            {
                "review": "This is my favorite place for breakfast in Champaign. It is a comfort-food-greasy-spoon restaurant. I recommend doing the breakfast before your shower in the morning and then go home for the shower afterward or you will smell like the restaurant all day! The food is very inexpensive and it has the best french toast in town. The seats are quite uncomfortable but fit in with the ambiance. For a while they served Lebonese food on some evenings but stopped doing that. I wish they would bring it back. It was excellent, high quality and reasonably priced.",
                "reviewer_id": "f8whKgtvAF6NOExa-D0nuQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04797166114219396,
                    "positive_probability": 0.9520283388578046
                },
                "stars": 5
            },
            {
                "review": "I was skeptical the French toast could be the best in the world. Not anymore though. They were amazing, perfect and the best ive ever had.",
                "reviewer_id": "g9BX7gOTgF_jtm8cIJKM3g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015405085728597863,
                    "positive_probability": 0.9845949142714016
                },
                "stars": 5
            },
            {
                "review": "Cheap.  But that is where it begins and ends.  Otherwise, it is just a below average greasy spoon with a staff that is apathetic or bored or both.",
                "reviewer_id": "h4thMbFhvdlZvFkAJU-nyw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10771696850284718,
                    "positive_probability": 0.8922830314971545
                },
                "stars": 1
            },
            {
                "review": "I'm such a huge fan of hole-in-the-walls. As my friend Andrew W. once said, they have nothing else going for them but their food. Therefore, the ones that stay open are successful by the sole virtue of their food. And that's exactly why I'm giving 5 stars to Mr. Sam and his cafe of dive heaven. I have many regrets from my college career. One of these is that I didn't discover Sam's until late in the game. I get to experience two of my favorite words here: CHEAP BRUNCH. Breakfast platter special for $3.75??? Fluffy french toast for under $5???? Pancakes? Omelettes!!!?? OH YES PLEASE GIMME NAO I WANT IT I WANT IT SO BAD.Footnotes:DO NOT eat here if:- you are on a diet. I don't think the cooks know what that word means. No Lite Butter or Diet Fat Free Bacon to be found here.- you are a snob. The \"decor\" consists of plastic furniture and faded ads in lieu of actual ceiling tiles. - you are a germaphobe.... but really, why would you be? Snap out of it, take a class in immunology. Germs ain't got nothin' on you. (Sorry, bio nerd leaking through.)DO eat here if:- you are a broke-ass college kid. Full meals for under $5 ... how could you resist?- you love breakfast foods. The french toast is particularly noteworthy.Advice: CASH ONLY; FOR BFAST, CLOSES AT 2 PM (I think - it's been a long time since I was there. It's either 2 or 1...)",
                "reviewer_id": "HyrcAxselbPZbxpVH3Hpzw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9999724062980907,
                    "positive_probability": 2.7593701903440855e-05
                },
                "stars": 5
            },
            {
                "review": "Good Lebanese food on Thursday and Friday nights. I went with a couple of friends for a B.day party, and decided to share all their entree's to get a feel of all the food. The cafe itself is nothing to brag about, just a small, non-elegant, bread-and-butter diner type of place. The food was good though. They had four items on their dinner menu, each being either $7 or $7.50, including tax:1. Shish Taok. Small chicken breast pieces, fried in a garlic sauce. recommended. 2. Kibbe. I don't recommend it. A mixture of some sort and then fried, tasted strange.3. Kafta. Their main beef meal. By far the best food they had. Very tasty.4. Falafel. It was ok. nothing to brag about. They had a special meal that night, for $12, which had fried rice and cooked chicken. It was ok.Each meal comes with a choice of two meals. We all got homous, and tabolli, both of them being delicious. In fact, I think the homous was their best food! Btw, warm pita bread keeps coming, which was a nice touch.There are three Lebanese ladies who do the whole Lebanese dinner thing (Sam's cafe doesn't cater dinners on any other night other than the mentioned two). They were friendly and nice people.",
                "reviewer_id": "I3qt_NaZfu3j5RfCQTiq4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012715325413945176,
                    "positive_probability": 0.9872846745860715
                },
                "stars": 4
            },
            {
                "review": "Wow. Greasy. Must be a southern thing. No clue how this has 4 stars. French toast was hidden like a pancake.",
                "reviewer_id": "ICwHBy1h1okCQ-51ZVoCog",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4460083161955241,
                    "positive_probability": 0.5539916838044765
                },
                "stars": 1
            },
            {
                "review": "As good as a cheap and greasy breakfast gets.  Very friendly staff, and it really feels like a neighborhood restaurant.  The breakfast special with coffee is a fantastic deal, and the refills keep coming.  Better food than Merry Ann's in some ways, since it is the same type of food, but Sam's is only open during the day.  I'll hopefully get a chance to go back for dinner.Overall, this is one of the best of breed for greasy delicious breakfast food at low low prices.",
                "reviewer_id": "IJ3m1dLcXv_NjDlXQ5J8Iw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04909755773160079,
                    "positive_probability": 0.9509024422684033
                },
                "stars": 5
            },
            {
                "review": "As far as I know, this is the only place to get good Levantine food in town! I am reviewing the Cafe's Thursday-night transformation into a Lebanese restaurant, as it never seems to be open when I have thought about trying their regular stuff. But who cares about that? The food is phenomenal! I get the garlic chicken almost every time because it's so good, but seriously everything is wonderful. It's so cute because they serve it on the same crappy styrofoam plates that you'd expect a crumby diner to serve you a greasy burger on, but the Lebanese cuisine is of a quality that could (and IMHO should!) be served at a way fancier place for way more money.What a cool place. Seriously. It's one of C-U's little gems.",
                "reviewer_id": "irnzN5lDB32mVrSPiPw7nw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35980299871895044,
                    "positive_probability": 0.6401970012810559
                },
                "stars": 4
            },
            {
                "review": "After seeing the reviews of this place a friend and I decided to try it. We were completely disappointed and frustrated afterwards. When we first walked in I totally thought of turning around to leave, but I tried not to 'judge a book by its cover'. So we sat down and the service was just terrible. He talked way too fast and barely gave us time to respond. Didn't like him at all. As for the food, we ordered their special - eggs, sausage, American fries, and pancakes. EHHHHH! It was edible, sure, but delicious? Yeahhhh, no. I only ate it because I was really hungry and we had to pay for it anyway. The only positive thing I could say is it is cheap, so if you don't want to spend a lot on breakfast then I GUESS you should visit this place. By the way, CASH ONLY!* Another problem we had here.",
                "reviewer_id": "j-4oPcfzx6jS3avdVEuWsA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.43383531290436317,
                    "positive_probability": 0.5661646870956336
                },
                "stars": 1
            },
            {
                "review": "Really good value tasty breakfast/brunch. The all day breakfast special is only $5.10! Nice place to meet with friends, friendly staff and nice atmosphere :-)",
                "reviewer_id": "JJZr5bFgSk2P1uVhHhcnDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1768694278725756,
                    "positive_probability": 0.8231305721274227
                },
                "stars": 5
            },
            {
                "review": "Don't know what I ordered here but it was dirt cheap. Probably less than $3.You get what you pay for but the food is cheap quick and easy. There's an 80% chance that Sam could be serving you. Say hi.",
                "reviewer_id": "jvcqOUPPVBXErhjfdejPng",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3456733239158986,
                    "positive_probability": 0.6543266760840992
                },
                "stars": 2
            },
            {
                "review": "Stopped through champaign on our way back to Iowa from Indiana.  Whole family had breakfast.  Every item ordered rocked!  French toast was unlike any I've eaten... Was simply amazing!",
                "reviewer_id": "K8D4Z5vy9G14DPtd4J5FJw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05965703956651853,
                    "positive_probability": 0.9403429604334825
                },
                "stars": 5
            },
            {
                "review": "Good, cheap breakfast.  After seeing all the excellent reviews here--many of which mention the fantastic french toast--how could I order anything BUT french toast?  It was definitely pretty amazing.  Delicious, and a perfect serving.  I got a half order of American Fries on the side and it was plenty.  The only reason you'd need a full order is if you intend to split it with someone!  Basically hash browns, they were delicious.  Crispy bits mixed with soft buttery masses of potato that leave a little bit of grease on the plate.  Sounds disgusting?  Trust me, it's awesome.Considering the simplicity of our order, it seemed like it took a while to get our food.  The wait wasn't ridiculous by any means, just a little longer than I expected.  Still, we were in and out within an hour.The atmosphere is probably going to take a few visits to grow on me.  It felt cramped.  Once we settled into our little nook I felt more comfortable.  Clearly, if you're coming here, you're coming for the food...not the ambiance.And the food is indeed good.  GREAT, even.  I'll be back...for more decadent french toast...and scrumptious hash browns...",
                "reviewer_id": "kltu5MyodHXondt_qvdAHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00032385589944510423,
                    "positive_probability": 0.9996761441005519
                },
                "stars": 4
            },
            {
                "review": "Cheesiest omelette EVER! And it's delicious melty American cheese, not oily coagulated cheddar. And I swear these has browns are from scratch. Deeeeelicious!",
                "reviewer_id": "LgmBShHsMHpQX3Z0bQ8wWg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5552649014309083,
                    "positive_probability": 0.44473509856909
                },
                "stars": 5
            },
            {
                "review": "I'll make this one as easy as possible. Sam's Cafe serves  good breakfast food at reasonable prices. I mean their breakfast special is like $5 and you get 2 eggs, bacon, and pancakes. And they use REAL butter. No other places that I've been to have quality food for a price like that. The place is pretty small so if you have more than 6 people, it's not happening. Strangely for as small as the place is, I've never waited for a table, even in a busy Saturday morning. There is like one server/busboy/cashier and he is awesome. Love this place!",
                "reviewer_id": "lR8ztGfJzRv-dp9ZPyooUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3691986344187351,
                    "positive_probability": 0.6308013655812658
                },
                "stars": 5
            },
            {
                "review": "The perfect inexpensive diner experience - even though it's a small place, we have been there several times and have never had to wait to sit (including a weekend morning). Don't get me wrong, there's always people there, just always seems to be a table ready!We are not big eaters so we get a half order of French toast, breakfast special, and a side of grits - and split that all between us and our 1 year old daughter. French toast is unique and excellent, and the breakfast special is exactly what it is supposed to be - eggs, sausage (or bacon), toast, American potatoes, and coffee, and prepared how you like it.Everything including a milk for the daughter is $20 with tip.Service is awesome - everyone is super-friendly.1/2 star reserved for the inconvenience of not accepting credit/debit cards - that would make this place 5 stars! For now, make sure you keep an Andrew Jackson on ya!",
                "reviewer_id": "LXdedN_nGtEa4ztCDij83Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009822821843008025,
                    "positive_probability": 0.9901771781569988
                },
                "stars": 4
            },
            {
                "review": "I stopped in here for breakfast the other day, and it was pretty excellent.  I had the breakfast special for about $4.25, and it included two eggs, a few slices of bacon, and a short stack of outstanding pancakes.  The server was very friendly, and the food was brought out quickly.  I'd highly recommend this place for a low-key diner-style breakfast.",
                "reviewer_id": "M7Ay-iCMnLLXFWtcUhxI8w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2030354505922208,
                    "positive_probability": 0.7969645494077788
                },
                "stars": 4
            },
            {
                "review": "The best french toast you will ever eat!!!I don't even like french toast, and I went to this place and ordered it based on reviews and I am so glad I did.  I'm a believer. It has this crispy outer area and is drenched in cinnamon sugar, and perfect with syrup or without.  A half order is plenty one, but go all out and get the full order!  You'll be glad you did.Prices are great, I think a burger is under $3.00!  I have never ordered anything other than french toast and hash browns.  The hash browns are darn good too. The place is a little dumpy- poster boards on the ceiling, really uncomfortable chairs, broken equipment sitting out in the open, tables go uncleaned for awhile.  But none of this matters, it's clean enough and the food is soooo good!Side-note: they only take cash.  So go to the ATM right now, get some cash (you won't need more than $15 for two) and head over to Sam's cafe and order the french toast!",
                "reviewer_id": "mlxwcI_dMNzdwwYzjADn-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015150221838784455,
                    "positive_probability": 0.9848497781612154
                },
                "stars": 5
            },
            {
                "review": "Best value in town. The breakfast and lunches are just \"ok\", greasy spoon standard, but their low, low prices bring them into the 3-4 stars territory. I would not say the place is dirty (because it's not), but I hope they wash their hands after touching that cash register.The Lebanese dinners are really special, as when we went, Sam's wife was there and talked to us about the food and culture of Lebanon, really making us feel welcome. She explained every item on the menu for the noobs and really seemed to care about us and our experience. The food was great.I cant justify 5 stars for this, as it is not high cuisine, and the decor, even for a greasy spoon, is pretty poor. But when your meal is less than $5 (with a drink, and fries), who's complaining?",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6266707437824239,
                    "positive_probability": 0.37332925621757984
                },
                "stars": 4
            },
            {
                "review": "Disclaimer:  This is a review of Sam's Cafe's new evening menu.In recent months, Sam's, which appears to be a typical greasy-spoon coffee-and-eggs place during the day, has begun serving delicious Lebanese food on Thursday and Friday evenings.  My husband and I came with two other friends, with whom we seldom agree on where to eat.  I was curious about this place, but wasn't holding out extremely high hopes, since one of my dining companions is from the Middle East and has sky-high standards for Middle Eastern cuisine.  All these problems melted away, however, when we tried Sam's.  Even my Middle Eastern friend was impressed.  Service is quite friendly and lightning fast, and although the menu is limited, everything is delicious!  All the entrees are very reasonably priced and include such classics as falafel, kafte, hummus, and tabbouleh (which was especially delicious!).  All the dinners come with a choice of two side dishes (hummus, Greek salad, or tabbouleh).  The baklava is the best I've ever had.  One caveat:  They do not accept credit cards, so make sure you have cash on hand.  Not knowing this caused my husband to make an emergency ATM run, but the baklava was waiting for him when he returned, so all was well.I'm thrilled that we found this place; it is a treasure!  My friends and I will now never have to argue about where to go out to eat, and that is amazing in and of itself.",
                "reviewer_id": "NtmiVAP4zoM8Kx8_8SNgMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.5530453749376401e-06,
                    "positive_probability": 0.9999984469546265
                },
                "stars": 5
            },
            {
                "review": "This hole-in-the-wall was a great find.  Service was fast and friendly, customers were a little gruff, but nice.  Food was great for this greasy spoon.  We had t-bone steaks and french toast for breakfast.  Small place, so I can imagine it fills up fast.  Not a long wait for anything and reasonably priced.",
                "reviewer_id": "nuDluohucnGMT2K0Id8jYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.019869518371247657,
                    "positive_probability": 0.9801304816287509
                },
                "stars": 4
            },
            {
                "review": "Super cheap, tasty and quick. Sam's is awesome for breakfast. The place is small and a bit dingy, it epitomizes what I think of as a greasy spoon cafeteria but the food is great. You can't beat the $3.70 breakfast special (two eggs, pancakes and sausage or bacon). The waitstaff is friendly and fast and the owner is slinging the food on the griddle most days.",
                "reviewer_id": "oXF1ugDJPy6FUwWCLfywDQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.054369188344347584,
                    "positive_probability": 0.9456308116556498
                },
                "stars": 5
            },
            {
                "review": "Much ado about nothing.  Have heard so much about Sam's Cafe and now wonder why.  Upon entering, the first (and lasting) impression was that it was dirty.  Okay, in my Harley riding days, I've eaten at many greasy spoons that turned out dynamite food.  Not the case here.  Service was perfunctory but that could be owing to the place being so busy.  Coffee was decent.  Ordered the Western Omelet.  Huge.  To their credit, it was filled with slices of bacon instead of just pieces, slices of ham instead of diced pieces, and large pieces of sausage patties.  That having been said, the vegetables were soggy and the entire omelet lacked seasoning of any kind.  Totally bland.  The American Fries were a soggy mess and also without flavor.  Had to have at least a half order of their much ballyhooed French Toast after reading the rave reviews here.  Blah!!  Did these reviewers eat the same stuff as I did?  There was nothing remotely commendable about it.  It was soggy and relatively flavorless.  I tried it with and without syrup.  The syrup at least gave it flavor, albeit that of low grade imitation maple syrup.  It's been a while since I left that much food on my plate.  This may be a case of the Emperor's New Clothes as it is with so many of the \"In\" places in C-U.  \"Oh look, we found this quaint little cafe downtown; you must try it.\"  Of course, if you disagree you are obviously declasse.  Color me declasse.",
                "reviewer_id": "OZCzq4BvNGdTpBE2iUg0Tw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.984733645180616,
                    "positive_probability": 0.015266354819395686
                },
                "stars": 1
            },
            {
                "review": "How have I lived in CU for 20 years and never visited Sam's Cafe? We go out to breakfast every Sunday and were getting tired of our usual spots, having whittled down the list to just a few for one reason or another. So glad I remembered seeing Yelp reviews of Sam's. The American fries are great, as is the french toast. Food was out to the table in what seemed like less than 5 minutes, freshly cooked. The kids split an order of french toast and I had the breakfast special. I think next time I'll skip the pancakes with the special and eat the 1/2 piece of french toast that the littlest one left on her plate. It's not much to look at, but is clean, great service, and good food. And all for just $17 for all 4 of us.",
                "reviewer_id": "P9IzWYGOoVPaAxLo4MswMw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7359621426720822,
                    "positive_probability": 0.26403785732792134
                },
                "stars": 4
            },
            {
                "review": "Good food. Inexpensive. The breakfast special is worth the price as the portions are fairly large. The restaurant was crowded upon arrival, but the service was fast and we never saw the bottoms of our cups since the waitstaff was quick about refills.",
                "reviewer_id": "pBXAAyWhlBCyiEGbX7PKmA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007576902460487254,
                    "positive_probability": 0.9924230975395105
                },
                "stars": 4
            },
            {
                "review": "I was a student here for years but never tried it until a recent trip back to C-U.  I got the  breakfast special, which seems to be the way to go (other than perhaps the French Toast). The bacon was just okay (it was clearly not fresh), but the eggs were very good, and the pancakes were the best I'd had in quite some time.  If I were going back, I'd probably try the sausage - it looked better than the bacon.  And it was still quite affordable - I think $6 covered my meal, including tax and tip!",
                "reviewer_id": "Qf073leqNNYey-c9a6n6xA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.30894674429058666,
                    "positive_probability": 0.6910532557094181
                },
                "stars": 4
            },
            {
                "review": "Everyone talks about the french toast at Sam's, and apparently I'm going to have to try that one day. But the thing I can't get over is the PANCAKES. They are absolutely delicious. I lived in Chicago for six years and found only one place that rivals Sam's pancakes in that huge city. As others have said, the decor leaves something to be desired, and the tables aren't as clean as they could be, but the prices are insanely cheap and the pancakes...oh, the pancakes. Plus, they have take out. :)",
                "reviewer_id": "ReZ0tYv9w_vc28M2CMxSXQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2855778426366781,
                    "positive_probability": 0.714422157363318
                },
                "stars": 4
            },
            {
                "review": "I was going to this restaurant based on what people said on yelp and I wasn't disappointed! Food is cheap, breakfast special is $4 and it runs all day! Service was as quick as you can get and still have been freshly made! The decor is diveish but you aren't paying for a formal French you are paying for good cheap food fast! Also the french toast is dipped in pancake batter and is really delicious!!!! I know I will be going again!",
                "reviewer_id": "rgjdVmK5nYVOxrK6YeQJNQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9265735083817781,
                    "positive_probability": 0.07342649161821758
                },
                "stars": 5
            },
            {
                "review": "It's like stepping back in time where diners like this were a staple for breakfast for many. They had many tables in the back where the good old boys were catching up over their breakfasts.  It might look run down or old, but everything looked clean. The server was nice and attentive.  I had the breakfast special with 2 scrambled eggs, crispy bacon, and fluffy pancakes. Nothing fancy, but you could tell the guy at the grill had the experience of cooking many a breakfast like this over the years. Very inexpensive too. You find the bathrooms by going through back door to storage area and it's to your right. Simple food but simply good too.",
                "reviewer_id": "rK5eHSM325B09ORck2VPvA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5988737367172543,
                    "positive_probability": 0.40112626328274437
                },
                "stars": 4
            },
            {
                "review": "Yeah, I'm not a fan of this place. They are always under-staffed when I go there and the service they provide reflects that. Don't even try to go in on a weekend. The food is ok but I guess in all fairness the quality does match the lower prices. I would rather them raise their prices and focus on putting more staff on the floor and increasing the quality of food because those are the two main reasons why I will probably not be returning unless the cries of desperation for breakfast suddenly call when I'm nearby.",
                "reviewer_id": "RvYWDZSFv-wL4waACRswrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3761113145425955,
                    "positive_probability": 0.623888685457403
                },
                "stars": 2
            },
            {
                "review": "I have always wanted to try Sam's.  Finally having a dentist appointment at 7 am (ICK!) meant that I was done and hungry by 7:45 this morning, so I went.Sam's is a cute greasy spoon hilariously sandwiched between two slightly snobby upscale restaurants.  I like that about the place.  The service is fast, the food is super-quick and quite cheap (I got a breakfast special: bacon, 2 eggs and toast--for $3.50.  I know.)I definitely got the feeling that this was a local place for a lot of the people and I was a 'new face,' but I didn't mind.  The food was fast and good.  I wish I'd tried a pancake, but I didn't this time.  I'd go back again.Basically, it's no-frills, straight up fast and cheap service.  And that's refreshing. :)Oh, and they don't take cards.  Bring cash.  It's not like you'll need a lot of it!",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00792865033537104,
                    "positive_probability": 0.9920713496646323
                },
                "stars": 4
            },
            {
                "review": "Met Sam as he was busy at the grill.  Paul and I went in to order some burgers.  The staff was very attentive.  I borrowed a pen to start my food diary. I really would like to see some Lebanese cuisine on the menu although Sam doesn't think he has the right clientelle.  He is a very sweet man and his brother was just in from Lebanon.  I noticed a Saint perched above the grill. He offtered to share one with me for protection.  He said I should place it above a door way of my home.  How cool is this guy anyway..",
                "reviewer_id": "TXx9DpLh1Bd1EGFP0bAxMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08216441687637542,
                    "positive_probability": 0.9178355831236215
                },
                "stars": 4
            },
            {
                "review": "Sam's Cafe, is a diner our host choose to take us and if you like a good breakfast diner this is your spot!  All I had was coffee cause I'm not a huge breakfast kinda guy... But the Coffee was awesome!  Way better then your normal bottomless pot type diner coffee.The rest of the gang ordered Omelettes,  and French toast and both looked superb..  They were excited by the amount of food you can get for not much moola! Everyone was super stoked about our Sam's stop, and the staff was great and kept my coffee full!",
                "reviewer_id": "vlWwsOG5fL8byQRZ7IIBZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08551455750723345,
                    "positive_probability": 0.9144854424927632
                },
                "stars": 4
            },
            {
                "review": "Cheap and delicious. Try the french toast.",
                "reviewer_id": "VS89OpdxlLsD7tLtmqjcUA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5472887167439202,
                    "positive_probability": 0.45271128325607957
                },
                "stars": 5
            },
            {
                "review": "Looks can be deceiving, and Sams Cafe is a classic example of that.  No doubt, there are places that look cuter with nicer decor but they don't have Sams food.  Sams is my favorite place for breakfast in Chambana.  A big reason for that is the French Toast.  It is simply the best I have every had.  The rest of the food is good, but I can rarely get myself to order anything but that. Wait staff is friendly and efficient.  This is a great place for friends to grab a some food before heading up to a tailgate or after a great night out in Champaign.  Sams is definitely a diamond in the rough.",
                "reviewer_id": "WNHdPOky5_iBsYvBMTzPUQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3130138577465641,
                    "positive_probability": 0.6869861422534381
                },
                "stars": 5
            },
            {
                "review": "I just got back from here and first off, we waited for over an hour for our food. The people who had come in and ordered way after us were served first, which was rude. Second, I heard them talking about being out of biscuits and gravy about 20 minutes before they actually told us they were. Granted, they did take 30% off after we said something, but the food wasn't even that impressive. I'm definitely never going back.",
                "reviewer_id": "x1S6q_0Lodz7-5J7PJP5Tg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49930659247866827,
                    "positive_probability": 0.5006934075213298
                },
                "stars": 1
            },
            {
                "review": "This greasy spoon effectively fills its downtown niche:  no-frills service, no-frills food, and no-frills decor.  I wanted a Denver omelette but their version had onions, tomatoes, and ham instead of the expected onions, peppers, and ham.  Oh well, I ordered it anyway.  It was very good and PIPING hot.  I burned my mouth on the end when I started eating, and on the middle part several minutes later.  I also got a short stack of flapjacks for \"dessert\" and they were okay.  Top it all off with a cold glass of OJ and you have yourself a decent breakfast for $10.16.  I was here around 9 am on Sunday, and had no trouble getting the seat of my choice.  When I left, it was close to filling up, and I don't doubt that the college kids roll in here starting mid-morning.",
                "reviewer_id": "x7ZP6lB2fZl2UN6lun87lA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13910423752610593,
                    "positive_probability": 0.8608957624738955
                },
                "stars": 3
            },
            {
                "review": "So I am from Phoenix, AZ, but recently visited Champaign with the boyfriend for the holidays.  I have been hearing about Sam's breakfast, in particular the french toast, for months now.  I love french toast, it is my favorite breakfast food.  I wasn't expecting much, thinking that it was sure to be less fantastic than my boyfriend claimed it to be.Sam's is the epitome of a greasy spoon.   No frills decor, you walk through the kitchen to get to the bathroom and your table is likely to be wobbly.  The server took care of us but was busy with other tables so the service was polite and attentive but short and sweet.  We each ordered a breakfast special and then split an order of french toast.  The breakfast special items (eggs, meat, toast, hashbrowns) were basic but good.  The french toast?  Ridiculous.  Seriously, the best french toast I've ever had.  The cook dips the bread in thinned out pancake batter and then fries it up.  It is rich, crispy and seasoned with powdered sugar and cinnamon.  It was a tasty breakfast on a cold, rainy day.  When the Illini basketball team walked in the door, my boyfriend was in heaven.  At the end of the meal we realized that we didn't have any cash and Sam's doesn't take cards.  Because my boyfriend was a regular in his college days, Gus, the owner, was nice enough to let us leave, get some cash and come back to pay.  Our total was about as pleasing as the french toast.  12 bucks and change for two coffees, two specials and french toast.  Crazy cheap.  Sam's is far away from home, but we'll visit everytime we're in Champaign.",
                "reviewer_id": "xFdK5lgUdeT3bWC7_MvcyQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.883306563622042e-05,
                    "positive_probability": 0.9999411669343559
                },
                "stars": 4
            },
            {
                "review": "There are two reasons to come to Sam's:First, you're too lazy to cook and want to eat a meal of comparable quality at a super reasonable price. I got two eggs, three pieces of bacon, and two pieces of buttered toast for $4.95. Two, you want their breakfast special. Two slabs of French toast lathered in pancake batter and cooked into the most delectable squishy crispness you can imagine. Do your mouth a favor (flavor?), and order it. You'll cry a little once your plate is empty, but oh good god it's worth it.",
                "reviewer_id": "yiRhtbRF-DHNnX3dfE8jFw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04337092383151174,
                    "positive_probability": 0.956629076168489
                },
                "stars": 5
            },
            {
                "review": "French toast is amazing! We were told it's better and thicker when Sam is working but it was still extra yummy. Imagine if a pancake mated with french toast and danced in cinnamon... yeah that good. Bacon was fresh and the right balance of crispy without being overdone. Scrambled eggs were made of real eggs and the hashbrowns (American fries) had a buttery taste we loved. Unpretentious, hole in the wall that is worth the drive. Cash only and bring change for the parking meters.",
                "reviewer_id": "yzUm9CgzEt_5kZ5nStS7yw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02814308166616243,
                    "positive_probability": 0.9718569183338419
                },
                "stars": 4
            },
            {
                "review": "Sam's Cafe has great breakfast food and very friendly staff at a good price.  What more can you ask for?  I had the corned beef hash with two eggs and toast - just the right amount of food.  I've heard the French Toast and pancakes are also great.",
                "reviewer_id": "ZRWDnvo07YZxxtrDYWf02A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4436275252741698,
                    "positive_probability": 0.5563724747258308
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "vBg5V39Vf4eTx1JVgl_5Pg",
            "8diLGO9WGVQWr05FWZ_yTw",
            "VI-zVIlK11AUz47mro8nMA",
            "6HKjKhgDLBpuZFNBOCzVQw",
            "oL91dKGJxL7F1u9X-QKXiw",
            "zOaUK1e0W7TtyYabzDBK9w",
            "u-y1z3usKenHtOGrH5Vveg",
            "4PatE4TUcea0Dj0hKICGJw",
            "KUpdnQi16DGP54FlDWOJ6g",
            "wO8c-FbduauxCGiEHchGRA"
        ]
    },
    "VI-zVIlK11AUz47mro8nMA": {
        "keywords": {
            "bigrams": [
                "salad_bar",
                "great_place",
                "good_food",
                "french_toast",
                "daily_specials",
                "hot_tasty",
                "broasted_chicken",
                "eat_sign",
                "reasonably_priced",
                "noodle_soup"
            ],
            "unigrams": [
                "good",
                "place",
                "chicken",
                "food",
                "breakfast",
                "service",
                "restaurant",
                "soup",
                "salad",
                "great"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": true,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "VI-zVIlK11AUz47mro8nMA",
            "categories": [
                "Sandwiches",
                "Breakfast & Brunch",
                "Diners",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "810 W Killarney St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "05:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "05:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "05:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "06:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "05:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "05:00"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "05:00"
                }
            },
            "latitude": 40.1329741,
            "longitude": -88.2188301,
            "name": "Urbana Garden Family Restaurant",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/bklmoB57vAd_o7bJE-tSiA/ms.jpg",
            "review_count": 30,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Fast, friendly service, reasonable prices, reliable diner food. Great place to eat. my wifes not sure she wants to go back which is to bad because that was her favorite place to go for chicken. ",
        "reviews": [
            {
                "review": "Excellent!!Just stopped in for breakfast today for the first time, I had the cinnamon swirl French toast. It was AMAZING!! The server did a great job keeping my coffee cup full. Prices are very reasonable. Definitely recommend this place!!!",
                "reviewer_id": "-G0BkEtxVYQG3_1G-KMrMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23932672765465643,
                    "positive_probability": 0.7606732723453437
                },
                "stars": 5
            },
            {
                "review": "I like going out to eat and my wife likes the chicken they serve here,so we went Friday the 13 and it was the worst experience we had there my wife had chicken and it was terrible it was nothing like it usually is. it was greasy seemed under cooked, I only go there for my wife to me the food taste cheap . the service was terrible. my wifes not sure she wants to go back which is to bad because that was her favorite place to go for chicken. the management was terrible that night.",
                "reviewer_id": "1zXAmeQU4BJBXy-3Fuc6_A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8062379639264821,
                    "positive_probability": 0.1937620360735218
                },
                "stars": 2
            },
            {
                "review": "Lot of food, if volume is your criteria, this is the place.  Good food, no, sort of like I remember army food.  Cabbage roll was way too salty.  Rack of ribs too fatty.",
                "reviewer_id": "2-nydI_wIXzyV9JvsJeDIg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5852975959919203,
                    "positive_probability": 0.41470240400807795
                },
                "stars": 2
            },
            {
                "review": "It's a place with known-by-name regulars. So that should tell you it's at least good enough. It's a qualified 4 stars in that nothing was exceptional, but nothing was bad. It's a family restaurant with half food service frozen stuff and half solid homemade stuff. You need to enlist your waiter or a local to sift through what's worth ordering. Decent salad bar and soup. Probably could get away without ordering an entree. If you've been to a greek owned family restaurant in the Chicago area, then you can kinda picture what its like here. Overall,  I'd come back, but it's nothing incredible.",
                "reviewer_id": "2FrxzRyT4_NmutHS9nfRNQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008391665323059709,
                    "positive_probability": 0.9916083346769351
                },
                "stars": 4
            },
            {
                "review": "Good diner food. Casual atmosphere and very fast service. I had the Belgian waffle and eggs-standard. Husband got the house skillet \" and it was good, I would order it again.\"",
                "reviewer_id": "2H_uyIKbtGPMYjte6Fbjww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26661701295704,
                    "positive_probability": 0.7333829870429591
                },
                "stars": 4
            },
            {
                "review": "This is a wonderful mom and pop style diner. Its quite the hidden gem in the area too since its a bit away from the U of I campus.They have a huge menu with tons of options. Our group got a bunch of things off the menu and shared. No complaints about any of the food. Oh, and the portions are gigantic especially for the reasonable price!",
                "reviewer_id": "3wSdAy0qbV_vtvbxHQrJkw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012892695713192473,
                    "positive_probability": 0.9871073042868105
                },
                "stars": 5
            },
            {
                "review": "Fast, friendly service, reasonable prices, reliable diner food.  My husband ordered a pork tenderloin sandwich \"deluxe\" which includes fries and a cup of their delicious homemade chicken noodle soup. It was hot and tasty, as were the steak fries!I had a chicken salad sandwich with a cup of soup - the bread was a little stale, and the chicken salad rather plain - just chicken and mayo. We were out of there in under 25 minutes and for under $25.00 - will have to stop in and try their breakfast next time.",
                "reviewer_id": "B_JNs-MExFOVjMvH876S6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45115561469919185,
                    "positive_probability": 0.548844385300808
                },
                "stars": 3
            },
            {
                "review": "Ordered a skillet. Huge amount! Less than 10 bucks and you can be full! Great place to have brunch. The price of the waffle is a little bit high though.",
                "reviewer_id": "C74BJGf0RuKdYKxjm7SDuQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40288001691097186,
                    "positive_probability": 0.5971199830890279
                },
                "stars": 4
            },
            {
                "review": "This is a great place to come with a large group when you're hungover and all the good expensive places are full. That's exactly what my friends and I did last weekend. The menu has a huge selection - something for everyone (unless you're eating vegan of course). There were about 8 of us and they had plenty of tables but for some reason, we had to wait 15 minutes for a table. When one of us asked if we could sit at the empty ones, they said sure if we didn't mind being split up, which we agreed to. When we were about to be seated, they asked if we wanted the tables pushed together (all of us were wondering why they didn't just do that earlier) but we said no, it's fine to keep them separate. All the food had that fake butter country crock flavor and the toast had huge slabs of margarine on them. Also, one of our waitress was considerably faster than the other which made our experience a little more strange since we were already split up at two tables.All in all, this place was one of those places that's so bad it's kinda good and when you're hungover, I'd choose this place over Merry Ann's any day.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8977517048382092,
                    "positive_probability": 0.1022482951617961
                },
                "stars": 3
            },
            {
                "review": "Wow. Not good.  Salad bar was a mix of browning iceberg lettuce and slightly fermenting beets,  three bean salad etc. I ordered the Broasted Chicken,  blah! not seasoned and thickly coated in a batter. Mashed potatoes were unseasoned Luke warm powdered blah floating in a puddle yellow canned sauce.not a good meal, disappointed after reading good reviews.",
                "reviewer_id": "DpKvuixjWSPsJzioZfddig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.000302496821763139,
                    "positive_probability": 0.9996975031782406
                },
                "stars": 1
            },
            {
                "review": "This is a great place for senior citizens as it has its own separate page dedicated to senior citizen specials. I would highly recommend the breakfast options here. Their homestyle cinnamon french toast combo was awesome. It includes four slices of round cinnamon bread, two eggs, and two bacon strips or sausage links for $6.99. The service also proved very convivial.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00037831010489991956,
                    "positive_probability": 0.9996216898951042
                },
                "stars": 5
            },
            {
                "review": "Restaurant review:I had high hopes for this diner in Champaign-Urbana, but I left feeling disappointed. If you like a cheap meal or breakfast item this is likely the place to go. Also if you are eligible for a senior citizen discount, this is a great place to grab a meal. For everyone else, there is so much left to be desired. I don't care about the drab interior that reminds you of a restaurant from the 80s. If the food is good I am there. The prices are cheap for dinner and they have multiple specials everyday of the week. Today was 11.99 all you can eat bbq ribs or pasta. I took at pass an tried the grilled salmon for 12.99. A couple issues came up. First there is no warm bread with butter, you get a trough of saltine crackers so this is clearly wrong in the menu. Second you can chose soup or salad, I went with the soup based on the other reviews. The beef vegetable had a lot of veggies, but no pieces of beef another thumbs down. Finally the meal itself came without any other fixins instead a slice of tomato and lettuce. I have no idea how that goes with salmon. A couple of steamed veggies would have paired nicely. Salmon was okay, nothing special that you couldn't whip up at home. Finally that amazing pie that people wrote about, if you look carefully at the shelf, those are store bought pies. All and all this is a place for 10 dollar ish meal, but I think I might have been better off eating at a fast food restaurant. Pro: cheap breakfast/lunch/dinner, daily specials, seniors discountCons: store brought pies, no fresh bread with butter which is in the menu, borderline poor-below average mealsHidden gem:Daily specials. Check the website, although it does not appear to be updated and constantly shows a Monday special",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0013700417261009474,
                    "positive_probability": 0.9986299582739175
                },
                "stars": 2
            },
            {
                "review": "This is the place with the big EAT sign in front of it.  For four years, I was afraid but enticed to enter.  Finally I caved to that EAT sign and said, \"I must EAT there.\"  What a surprise it was! Here are the surprises1. Their coffee sucks 2. Their fried chicken is AMAZING3. All their pies (especially the pecan) is like awesomeness in your mouth4.  The breakfast omelettes are a frown... which is so unfortunate because I can never find a unbusy good brunch place. If you're suspicious like I was, it's worth a try.",
                "reviewer_id": "FJX1GCTzyrq4PRxQV8H-Ig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11095421965650734,
                    "positive_probability": 0.8890457803434951
                },
                "stars": 4
            },
            {
                "review": "My brothers and I ended up at a hotel next to this restaurant.  We always use yelp when trying to find a good restaurant in a new location - and when yelp gave us this restaurant as the #1 in the area, we were doubtful it would be right for us.  It looks like your typical family greasy spoon but we decided to try it because of the yelp reviews & we were hungry.  This is the only restaurant in the vicinity of at least 5 hotels but we quickly realized why.  The food came out in what seemed like 5 minutes and everything was fantastic.  My reuban came with a bowl of soup - chicken rosemary - huge chunks of real chicken breast and perfect flavor.  The salad bar was very fresh and had a nice variety of choices - you can order the salad bar instead of the fries but the fries are nice steak versions - which usually are served uncooked in the middle because they are too thick.  Not here - every one was perfect...and we all ate every one.  The service staff was very nice & friendly.So we went back for breakfast the next morning.  Again, everything tasted great and we had wonderful service and the prices cannot be beat.I would give this restaurant 5 stars but both times we were there, there were kids whining in the back ground.  Not the restaurants fault but it is a family style restaurant and as long as you can put up with a whining kid the whole time you are there, then this is the #1 choice in the area.",
                "reviewer_id": "Gt4JpWiyVPwc-HRMdsKyiA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00030768213764282036,
                    "positive_probability": 0.9996923178623692
                },
                "stars": 4
            },
            {
                "review": "Stopped for a quick breakfast and found that here. Great pancakes and fast, pleasant service.",
                "reviewer_id": "HnJCMSrwDFRX3Rsk--vrCA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4739530383688348,
                    "positive_probability": 0.5260469616311655
                },
                "stars": 4
            },
            {
                "review": "The chicken and dumpling soup is fabulous! I had a pizza burger and fries, too. So yummy! The portions were big and reasonably priced. Fast, great service. I will definitely be going back soon!",
                "reviewer_id": "hRflciflE77Ekmg5gGNwiQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16157031881199296,
                    "positive_probability": 0.8384296811880089
                },
                "stars": 4
            },
            {
                "review": "Just popped in for something quick before our conference down the road. Soup: chicken & dumplings. Excellent! Lots of meat & flavor. Friendly waitress. The decore didn't bother me (like some previous reviews). We're going back the while 4 days were here.",
                "reviewer_id": "jVWWXJ8DVSSSk-iElRjzMw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9741273119335137,
                    "positive_probability": 0.025872688066481235
                },
                "stars": 5
            },
            {
                "review": "Great place to eat. Large portions. Huge list of daily specials. You won't leave hungry!",
                "reviewer_id": "K3lwLvZraGS_aFVY_iAOJA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2997521449341176,
                    "positive_probability": 0.7002478550658823
                },
                "stars": 5
            },
            {
                "review": "Our server was excellent- she was cheerful and on top of things and attentive without giving the sense that she was hovering or trying to smother you.I had the vegetarian omelette and had the intestinal fortitude to forgo the hash browns (oh, do I love hash browns!).  It was good-sized, but a bit on the bland side.  It was nothing that salt, pepper, and a bit of hot sauce can't fix, however.The coffee was good- it was hot and it woke me up, just like it's supposed to.I'd probably go there again if I was in the area.",
                "reviewer_id": "MlcRnvZJnDAPqNS027SJ4Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5855896582844599,
                    "positive_probability": 0.4144103417155346
                },
                "stars": 3
            },
            {
                "review": "Really nice waitress but they really need to up the ante on their vegetarian options. They don't even have a plain marinara sauce option for spaghetti!",
                "reviewer_id": "n85LgMXyLZ4alIyu4Vhv8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015126980761807924,
                    "positive_probability": 0.9848730192381911
                },
                "stars": 2
            },
            {
                "review": "Had breakfast there.  The menu wasn't impressive.  The coffee was awful.  Service was prompt but lacking any warmth.  Had a skillet.  The food was unremarkable but not bad.  I wouldn't say not to go here to eat, just go with modest expectations.",
                "reviewer_id": "OZCzq4BvNGdTpBE2iUg0Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3933023164006728,
                    "positive_probability": 0.6066976835993266
                },
                "stars": 2
            },
            {
                "review": "This is an Update (July 2011) to my original review from December 2009.This place continues to provide solid workmanlike meals, well-run, nothing flashy, just good food, served by pleasant staff, reasonably priced.Breakfast any time of day. Dinner any time of day. A huge menu, but who needs it they will cook you anything you want and they gladly allow substitutions. Want a cup of chicken soup with your sunny-side up eggs? No problem.Totally remodeled in the summer of 2011, it has a new, traditional American interior, just updated from the 1980 look which is a good thing.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05483457597905179,
                    "positive_probability": 0.9451654240209387
                },
                "stars": 4
            },
            {
                "review": "Got in for breakfast before the sun rose on Homecoming weekend. Friendly staff and super quick service. Ordered biscuits and gravy with home fries and 2 eggs scrambled. It was hot and tasty!  Only thing preventing 5 stars is the coffee. It was weak. Probably Maxwell House",
                "reviewer_id": "R8QlZJjnrsujajOPJfPL3Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9520277035176186,
                    "positive_probability": 0.047972296482380994
                },
                "stars": 4
            },
            {
                "review": "Just your standard diner.  Nothing special, but good food, salad bar, good size portions.  If your not looking for anything fancy, but just want to get something to eat it's the place to go.  Meatloaf dinner with mash potatoes and green beans, with soup or salad was $8.95.  Was hot tasty, maybe too much gravy.",
                "reviewer_id": "RcMd7hXA1XMKsokdcSc2-w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7439390122377643,
                    "positive_probability": 0.25606098776223263
                },
                "stars": 3
            },
            {
                "review": "Our food tasted like feet, and I have felt sick for the past four hours after eating there. None of our meals were good, and we think the milk that was in the waffles and pancakes may have been spoiled. Horrible.",
                "reviewer_id": "riL204-mr7mLpaaAygTO5A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09856733895540899,
                    "positive_probability": 0.9014326610445916
                },
                "stars": 1
            },
            {
                "review": "I have to admit... this review is almost expressly for their broasted chicken.Oh, god... thinking about it makes my mouth water.I make a lot of trips to go see family on the East coast. One of our stops is usually Urbana to relax and refuel for the last leg.And this place is right down the street from the hotel we typically frequent. The decor is blah, the servers are really nice and the coffee is warm water.But the broasted chicken is heavenly. It's seasoned perfectly, the skin is delightfully crispy and the chicken itself is so tender and flavorful that you almost can't stop eating. We also had the chicken noodle soup for an appetizer. Meh.Get the chicken. Seriously. It's better than fried, worlds better than baked and very reasonably priced. You won't regret it... until you're so stuffed you can't move, maybe.",
                "reviewer_id": "smHn8fKzH35H3nwZSrSemw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006535269198335793,
                    "positive_probability": 0.9934647308016655
                },
                "stars": 5
            },
            {
                "review": "Typical diner that serves bad food at okay prices. Severe lack of vegetarian options. I got the \"Big Breakfast.\" The waiter wouldn't let me substitute orange juice for my coffee, even though I offered to pay the additional 45 cents and give him a handjob in the bathroom after our meal.Overall, pretty lackluster restaurant. Looking back, the only positive aspect of this place is the giant EAT sign.",
                "reviewer_id": "udIP2DMpqWn7iuWwOPP39g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.36077423508570844,
                    "positive_probability": 0.6392257649142893
                },
                "stars": 2
            },
            {
                "review": "Definitely better than Denny's or IHOP, and a great breakfast after a night of drinking at U of I.Steak and eggs looked good and was a large portion. I got a sausage and egg sandwich, which was better than expected. French toast was meh. Service wasn't too shabby, she conveniently gave us all separate checks and we were well stocked on water and coffee.I'd probably go back, we all had a hearty breakfast for under $10 and it was better than the drive thru.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33687144119344364,
                    "positive_probability": 0.6631285588065534
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "2UAbUSTMsR9G26A8AYO3dA",
            "4PatE4TUcea0Dj0hKICGJw",
            "vBg5V39Vf4eTx1JVgl_5Pg",
            "6HKjKhgDLBpuZFNBOCzVQw",
            "8diLGO9WGVQWr05FWZ_yTw",
            "wO8c-FbduauxCGiEHchGRA",
            "oL91dKGJxL7F1u9X-QKXiw",
            "u-y1z3usKenHtOGrH5Vveg",
            "q4raCE4a8wMEETPG45HgAA",
            "ey7-ihj-OjM4sEOwWTc06Q"
        ]
    },
    "X3WnRljmATFjSluwVWFzdQ": {
        "keywords": {
            "bigrams": [
                "chips_salsa",
                "free_chips",
                "burrito_special",
                "tortilla_chips",
                "parking_lot",
                "burrito_place",
                "heat_lamp",
                "salsa_cons",
                "chips_health",
                "food_pretends"
            ],
            "unigrams": [
                "burrito",
                "chipotle",
                "order",
                "moe",
                "chips",
                "burritos",
                "queso",
                "time",
                "salsa",
                "free"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Take-out": true
            },
            "business_id": "X3WnRljmATFjSluwVWFzdQ",
            "categories": [
                "Southern",
                "Mexican",
                "Diners",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "2041 S Neil St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.0902181795859,
            "longitude": -88.2462392250518,
            "name": "Moe's Southwestern Grill",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/R7LeZjQMU1VhRJXP4pf4PA/ms.jpg",
            "review_count": 6,
            "stars": 2,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "I like Moe's maybe with time the employees and the service will get better. Next you go in and order your burrito like Chipotle. Pros: online ordering app, Monday' 5.95 all burrito special, free tortilla chips and salsa ",
        "reviews": [
            {
                "review": "Poorly managed with rude employees. They ran out of chicken and tried serving me burnt queso. I asked what was wrong with the queso and they told me it was burnt. So I had to ask for fresh queso. I won't be coming back here ever again.",
                "reviewer_id": "3_a63LQxIQ9jAqLaEMqW9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17862404062071563,
                    "positive_probability": 0.8213759593792794
                },
                "stars": 1
            },
            {
                "review": "Restaurant reviewWow what a disappointment. I have seen Moe's by the chicagoland area, but I have never actually eaten at any of the locations before. I was happy to hear that this opened up as it is closer than Chipotle on Prospect. Someone should be fired for the design and layout for the restaurant. I placed my order through the app which was quite easy to use, however when I wanted to place a second order for my wife, my credit card was rejected due to similar transactions so I decided to drive out to the location and order it in person. First the parking lot before Brixx pizza opened was a disaster. Super tight parking spaces, one way for traffic to go. It was a nightmare trying to park my car. Next you go in and order your burrito like Chipotle. For one of the orders I did not want cheese and the both of the other burritos did not need lettuce. Somehow I ended up with cheese on the one I didn't want and lettuce in both. One person trying to get the order for two burritos should not be difficult. Staff was not friendly at all and said why did you not tell me earlier. I got to the end of the line and paid. I also picked up my online order. There was a big box that was sitting in the middle of the table without any heat lamp. If you order too early, your burrito maybe stone cold when you come to pick it up. I did get a ridiculous amount of tortilla chips enough to feed 6 people. The salsa station is great as there is quite a variety and the spicy ones have quite a kick. The final straw was when I brought the food home, my wife and sister in law had burritos that had probably 3-4 oz of meat only. When you looked at the burrito after a bite all you could see was the tortilla skin, small amounts of rice, lettuce, and a sliver of chicken running down the middle. I wish I would have paid attention to how they made the burritos, but they were quite disappointed. All and all this is a big bust!Pros: online ordering app, Monday' 5.95 all burrito special, free tortilla chips and salsaCons: crazy small parking lot, apathetic staff, small amount of protein portions, no heat lamp for online ordersHidden deals: 1. Free chips/salsa2. 5.95 any burrito special on Monday only3. Sign up for e-club to get free queso for your chipsHealth code rating: A, appears clean and new. No health reports online at this time.",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004483072646306916,
                    "positive_probability": 0.9955169273536632
                },
                "stars": 1
            },
            {
                "review": "I do not understand all the hate on the other reviews.It costs about the same as Chipotle, but there are a bunch of fun extras.  You get free chips and salsa with any order, you can get discounts depending on the day of the week, and I love their queso.  They also have several items on the menu more in the style of Taco Bell crunchwraps and things, but with better quality ingredients.Like any burrito place, you have to try the different proteins and figure out what you like.  At Chipotle, I love the chicken or the sofritas.  At Moe's it's the steak or the pork.  But they also have some options you can't get at other burrito places like fish and ground beef.Moe's is definitely worthwhile.  It's not more amazing than any other burrito place, but the chips and salsa is a GREAT touch.  It's enough to make it my go-to.",
                "reviewer_id": "lC_pLZYy3lvDeK2jU76R0w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.021868781666492986,
                    "positive_probability": 0.9781312183335025
                },
                "stars": 4
            },
            {
                "review": "So I came here when they very first opened. And it was a train wreck. The employees sucked, the manager wasn't managing, and the food came out like a retarded cousin of a burrito. I was truly upset because I used to love going to the Moe's in BloNo. But I figured it was literally their second day open I will come back in a few weeks and give them a second chance.2nd time around, service was a lot better, and the food quality has improved. If you don't know what Moe's is, it's basically chipotle. As an admit hater of chipotle i actually prefer the Americanized Moe's. Because let's be real chipotle is not real Mexican food it just pretends to be. If you like burritos and don't want to shit yourself for a week come here over chipotle. But don't expect beautiful scenery or super cheap prices. Yeah it's probably going to cost you 10-12 dollars for your meal, do you think you can swing that? I like Moe's maybe with time the employees and the service will get better. My advice is come here at an off time or else you might get stuck waiting for a very long time",
                "reviewer_id": "twF_2RKnDgJqmKMU3K9A5w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5775196317033052,
                    "positive_probability": 0.42248036829668656
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "RRCF1uUIkmLcQdZauqZJAQ",
            "kLHPR_eUmAsOl-XLJSSO2Q",
            "cFivwA18popY5GH2tJtXlQ",
            "iYaDjwYdtqhLMY_tQFRlKA",
            "4MeniYcsZrwc_Cq6WSd3zQ",
            "ivZo1goh7HXdep03NfA7Cg",
            "-6GmhSnM8D48JtJkxVAmbA",
            "sPI0AqWHMeJB_UeZ5FRscg",
            "UBriZt4m5BzkvNqnCeuGmw",
            "_tYZuomgsRsye59b1baGSQ"
        ]
    },
    "oL91dKGJxL7F1u9X-QKXiw": {
        "keywords": {
            "bigrams": [
                "merry_ann",
                "hash_browns",
                "breakfast_food",
                "highly_recommend",
                "service_great",
                "right_away",
                "saturday_morning",
                "considerable_wait",
                "short_stack",
                "pancakes_toast"
            ],
            "unigrams": [
                "food",
                "service",
                "breakfast",
                "place",
                "diner",
                "merry",
                "ann",
                "great",
                "came",
                "good"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": true,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true
            },
            "business_id": "oL91dKGJxL7F1u9X-QKXiw",
            "categories": [
                "Diners",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "1103 W Oregon St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Monday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Saturday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Sunday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Thursday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Tuesday": {
                    "close": "09:00",
                    "open": "09:00"
                },
                "Wednesday": {
                    "close": "09:00",
                    "open": "09:00"
                }
            },
            "latitude": 40.1068411,
            "longitude": -88.2218579,
            "name": "Merry Ann's Diner",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/wBx2_EjG9imStQt-mkAYkA/ms.jpg",
            "review_count": 22,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The food and service are great during the morning, average throughout the day, and absolutely awful during the night. Merry Ann's is one of my go-to spots for food around campus, and by far my favorite place for breakfast food. This little diner in the heart of the U of I campus is a great place for a quick breakfast. ",
        "reviews": [
            {
                "review": "After a disaster of a breakfast at IHOP yesterday, I went with a group of seven to Merry Ann's Diner in Urbana for breakfast today. There were only a few groups in the place so seating was not a problem. We were able to order quickly and our food came within a few minutes. Everyone seemed to think their breakfast was okay -- no great raves, but no problems either. Service was excellent. My meal was a Mexican Omelet with hash browns and coffee -- and was good.",
                "reviewer_id": "-KZ0k14H3zdZVzEnhVq1ag",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8859962448101868,
                    "positive_probability": 0.11400375518980978
                },
                "stars": 3
            },
            {
                "review": "Their food is less than average and the woman taking my order there for the two times I went was very rude and seemed not too happy about me being there. Not a place I would recommend.",
                "reviewer_id": "44GzCA_7s9Xq3kzl2xD1TQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19915472856763264,
                    "positive_probability": 0.8008452714323651
                },
                "stars": 1
            },
            {
                "review": "No one ever said it was quality. Open all the time, pretty affordable.",
                "reviewer_id": "_H5MEMsNrbs-VU5DLPpcAg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5214182606371758,
                    "positive_probability": 0.47858173936282405
                },
                "stars": 2
            },
            {
                "review": "We went around 1 am.  It was pretty well filled in there.  We got a table right away and service came and was very nice.  I ended up splitting a diner stack which is hash brown, eggs, biscuit, and choice of sausage or hamburger.  I got the eggs over easy and sausage.  It was really good!  It was smothered in gravy and was a bit over peppered but it really added to the taste and did not overpower it at all.   This is one of the most expensive at 8.25 ish.  But well worth it.  The rest of the food is in the 6 ish range.My other friends were happy with their fries, chili, and root beer float.  The chili was salty but that could have been the crackers that were put into it, I didn't try it myself.I must say, I have NEVER had service this fast.  We got water right away, the food was on the table 2-3 minutes after we ordered.  She kept making sure we were good on water and clearing plates.  She was VERY Nice, never made us feel hurried.  I would highly recommend it.",
                "reviewer_id": "aw3NdtzanMHUT4FIv1lCzQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09550244860337136,
                    "positive_probability": 0.904497551396632
                },
                "stars": 4
            },
            {
                "review": "Drunk food at its finest! You can't go wrong with breakfast food and drunken folks. It's easier to go here and get grub than drunkenly go home and try and cook. The service is solid, quick, and the food is affordable.  HOWEVER, I've never been sober, because I'm afraid that my view of the joint well go south.",
                "reviewer_id": "Ba9fIJAmGNjFXU2Oc0fyxQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6731885092832848,
                    "positive_probability": 0.32681149071671234
                },
                "stars": 3
            },
            {
                "review": "Decent food, horrible service. My friend and I went here on a Saturday morning. It was pretty busy but we were able to seat ourselves and find a table. The menu looked like normal diner food and I ordered the mega omelet with two pieces of wheat toast and my friend ordered a waffle with 2 scrambled eggs on the side. The food came out pretty quickly but my toast was not even toasted but instead just warm and soggy from the amount of butter they put on it. After cutting into my omelet it oozed with grease and I think they were using slices of American cheese inside?? Despite the grease and cheese it wasn't the worst omelet I've had and it was stuffed nicely with veggies and meat. The hashbrowns were also decent. My friend said she enjoyed her waffle but when her \"scrambled eggs\" came out it appeared to be a flat not fluffy mini omelet with nothing inside.. Definitely not anything close to \"scrambled\". After we finished our meal we walked up to the counter to pay and there was a long line that didn't appear to be moving. After a couple minutes of investigating for myself, I realized that the credit card machine system had crashed. The girl working at the counter didn't feel the need to let the long line of customers know what was going on. After 20 minutes and missing our bus, she started just writing down the credit card information of customers and saying she would charge us later?? After the person in front of me she said \" if anyone can pay with cash please do that so I don't have to enter these all in later\" with an extremely rude tone. When it was my turn, she took my card and had the nerve to ask me to leave a tip. I left a 2 dollar tip and left. Definitely not a great last impression. This place is probably amazing when you're drunk with the amount of grease and poor customer service you'll get. But it's cheap and just don't get your expectations too high.",
                "reviewer_id": "BfhyW_ctG91xJwNU0_Qvfg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006872320734967614,
                    "positive_probability": 0.993127679265026
                },
                "stars": 2
            },
            {
                "review": "The workers here have grown jaded from having to deal with university students on a daily basis. We sat a a dirty table for awhile before someone came in and finally cleaned it. I ended up getting a breakfast burrito which was fairly average. It's a place to go if you don't care about lazy service and want average diner food.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26111115782997973,
                    "positive_probability": 0.7388888421700183
                },
                "stars": 2
            },
            {
                "review": "A lot of places will claim to be \"old-fashioned diners,\" but Merry Ann's is as close to that description as I have ever seen! Merry Ann's is one of my go-to spots for food around campus, and by far my favorite place for breakfast food. The only down-side is that they are frequently under-staffed, but Debbie and her team are always hustling to make up for it. It is very reasonably priced (it comes with being near a college campus), the food is delicious, and the waitstaff and chefs are extremely hard-working. I highly recommend the ham and cheese omelette, which (I believe) includes a choice of pancakes or toast. Go with the pancakes - they are fluffy and piping hot. Oh, and make sure to compliment your meal with coffee. It will come to you in traditional diner fashion - sliding down the table as the coffee swirls around the edges and ever-so-slightly spills over the sides. I go for the food, but I stay for the diner atmosphere. Consider Merry Ann's!",
                "reviewer_id": "FE8MaLc2qM7sZvXvoRsSnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00042993063509387134,
                    "positive_probability": 0.9995700693648963
                },
                "stars": 4
            },
            {
                "review": "The food and service are great during the morning, average throughout the day, and absolutely awful during the night. We came here around midnight (all of us completely sober) and ended up having to wait almost 15 minutes just to be acknowledged by the overweight waitress with one of the worst attitudes we've ever encountered. After another considerable wait for our food, and another considerable wait for our bill, we were thoroughly dissatisfied with the waitress who seemed to be doing absolutely nothing while we waited. Finally, we pay and leave, but as we are walking across the street, we hear the door open and that very waitress scream at us across the street, \"Are you f*cking serious!? You tipped me 36 cents?\" Admittedly it is kind of a dick move to tip anyone in change, but I have never met any waiter/waitress with the audacity to yell at me for it. This was by far my worst experience at this place, but I'll be back in the day when the waitresses aren't overweight goths with a bad attitude.",
                "reviewer_id": "fYG-KkAay8x4YniEz_Uxpg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7778214120157823,
                    "positive_probability": 0.22217858798420953
                },
                "stars": 2
            },
            {
                "review": "This little diner in the heart of the U of I campus is a great place for a quick breakfast.  We were lucky enough to find two tables for six on a busy Saturday morning before the football game.  Our server was fast and friendly and our standard breakfast fare was tasty and hot.  Not ideal for large groups since the seating options consist of either 4 top booths or counter stools but a good choice regardless.",
                "reviewer_id": "K_QK5BTPPQjWBmaCaGtyIQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.043730338831382345,
                    "positive_probability": 0.9562696611686092
                },
                "stars": 3
            },
            {
                "review": "Debbie gave awful service. I came in with a group of people and she was unreasonably rude. She swore, she seemed angry, and she made us feel all unwelcome and uncomfortable. Worst service I have ever gotten from a restaurant.",
                "reviewer_id": "mXI1iWI4imTN11d3k7PNvA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9481558884284722,
                    "positive_probability": 0.051844111571527636
                },
                "stars": 1
            },
            {
                "review": "This place was awesome!  The service was great and very friendly.  We went for early dinner and had cheeseburger, fries, shakes, and biscuits and gravy.  Everything was really tasty, although diner-y, so you know it's probably not the best thing to eat every day.  Very well-priced (under $20 for all this good stuff) and close to campus.  Highly recommend.",
                "reviewer_id": "nuDluohucnGMT2K0Id8jYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22344615959925895,
                    "positive_probability": 0.77655384040074
                },
                "stars": 5
            },
            {
                "review": "I love this place I always come to this one the service is great always nice and funny and more then happy to tip the food is basic dinner food with a not so basic taste fully recommend it for a midnight snack and a good time",
                "reviewer_id": "OeVbKa-5bo0aL9AQ6bLodg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18498999220154855,
                    "positive_probability": 0.8150100077984553
                },
                "stars": 5
            },
            {
                "review": "Amazing price for so much food! This location and all of its other location are open 24 hours a day every day. And they now have chorizo!!!!!!!!!!!! You can get amazing chorizo sausage with your dish!",
                "reviewer_id": "oIn0cp9CH0ja0450z7gShg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38778687612624996,
                    "positive_probability": 0.61221312387375
                },
                "stars": 4
            },
            {
                "review": "Flame food. Definitely the best spot off breakfast on campus hands down and arguably the best place to eat from 2-10 am Waitresses are always quick and friendly and food always comes out promptly and delicious.",
                "reviewer_id": "patOau5_Kpk7X1lfnjDg1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4200679815059308,
                    "positive_probability": 0.5799320184940645
                },
                "stars": 5
            },
            {
                "review": "Went for breakfast this morning. Excellent service! Our waitress was attentive, kind, and went out of her way to make our experience enjoyable. The food was what you would expect from a diner - big portions, cheap prices. Would definitely recommend Merry Ann's!",
                "reviewer_id": "qX_7H7290cecWquGxD2zFQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27417747980533813,
                    "positive_probability": 0.7258225201946611
                },
                "stars": 4
            },
            {
                "review": "Been here a few times so far and the shakes are delicious and thick, reasonably priced too. Friendly service. I've had the burgers, breakfast food, shakes, and smoothies. Everything is good, shakes are a great deal since they're huge and thick. Other food options are relatively small portions.",
                "reviewer_id": "SKhnKL9P9-LrUWzsw9oYNA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07761658210143961,
                    "positive_probability": 0.9223834178985617
                },
                "stars": 4
            },
            {
                "review": "Best grilled chicken sandwich on budget price in Champaign Urbana. The only place that feels home to me. I just love this place.",
                "reviewer_id": "TuVs2IndRJ6BPHy2uKiEOQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7187165553562394,
                    "positive_probability": 0.2812834446437612
                },
                "stars": 5
            },
            {
                "review": "I was in Urbana for a job interview that didn't start until 9 AM, so I decided to grab some breakfast. Being unfamiliar with the area, I wasn't sure where to start. I saw a subway, but I wanted something more, and I got it!I walked in at about 8 AM, and I was the only one there, along with Alex the cook, and Debbie, my waitress. I am an eggs and 'cakes guy, so that's what I ordered. I had the mega omelette (egg whites and no ham/cheese), with a banana instead of hash browns, and a short stack of pancakes instead of toast.The omelette was solid. It was nothing great, but it wasn't terrible either. The salsa that I asked for was just okay. I put ketchup on some of my omelette... I love that stuff.Anyways, my short stack of pancakes were the best part of the meal. They were fluffy and delicious!Debbie was very fast, even though 6 other parties came in while I was still dining. She was by herself on the floor, and did an excellent job.It looks, and sounds, like Merry Ann's is known for their late night gluttony items, which is fine. I was looking for something quick and not terrible for you, which is what I got. I wish I would they would have had some green veggies for my omelettte, but oh well.7.60 for an omelette, fruit, and cakes? AWESOME! I tipped very well to show my appreciation.I was not aware that there are other locations in the area until driving around later that day. Open 24/7. If I'm in the area for breakfast again, I'll def stop by!",
                "reviewer_id": "VgJ_IZrdBRgFmp03jv8Nmw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16402463835286382,
                    "positive_probability": 0.8359753616471518
                },
                "stars": 4
            },
            {
                "review": "The place is relatively cheap, and a nice break from dorm food if you're a student. It has a very retro diner kind of feel, if you enjoy that kind of thing (there's a counter with spinning stools and a whole lot of booths). Their chocolate milk shakes are fantastic, and I've always had a good experience with anything they have that comes with eggs and hash browns.",
                "reviewer_id": "wr1z0YW4Wzk5l43FJq6H9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25784588419115123,
                    "positive_probability": 0.742154115808851
                },
                "stars": 5
            },
            {
                "review": "If you ever go to school at University of Illinois Champaign-Urbana, you must visit a Merry Ann's diner at least once! Especially to try the infamous DINNER STACK:  hash browns topped with cheese, hamburger or sausage patties, two eggs, and then smothered with delicious sausage gravy. (Add a KFC-like biscuit for another 95 cents.)This is the latest Merry Ann's in the area out of three locations. By me being the first to review it you can tell that not everyone knows about it.  Therefore, it's the cleanest location. Like the other Merry Ann's, it's open 24/7 and I've definitely seen some students write key papers over several cups of coffee.Prices aren't bad. Lots of food choices. Once finished, pay up at the front register.",
                "reviewer_id": "XOnwygK-EerILmQSxP2K6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04056263203003059,
                    "positive_probability": 0.9594373679699739
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "zOaUK1e0W7TtyYabzDBK9w",
            "vBg5V39Vf4eTx1JVgl_5Pg",
            "2UAbUSTMsR9G26A8AYO3dA",
            "8diLGO9WGVQWr05FWZ_yTw",
            "VI-zVIlK11AUz47mro8nMA",
            "dvO4zlxg3GoK_CiqbvtxbQ",
            "UBriZt4m5BzkvNqnCeuGmw",
            "Z8EGaOokvK2hoD6tGup0MA",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "6AHfkdtpx7yLOFetI38gHQ"
        ]
    },
    "vBg5V39Vf4eTx1JVgl_5Pg": {
        "keywords": {
            "bigrams": [
                "merry_ann",
                "hash_browns",
                "diner_stack",
                "diner_food",
                "waffle_house",
                "late_night",
                "sausage_gravy",
                "cheese_fries",
                "biscuits_gravy",
                "sausage_patties"
            ],
            "unigrams": [
                "diner",
                "food",
                "merry",
                "ann",
                "place",
                "breakfast",
                "gravy",
                "stack",
                "good",
                "hash"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": true,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "no",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": true,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "free"
            },
            "business_id": "vBg5V39Vf4eTx1JVgl_5Pg",
            "categories": [
                "Breakfast & Brunch",
                "Diners",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1510 S Neil St\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.0984473,
            "longitude": -88.2442422,
            "name": "Merry-Ann's Diner",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/8_55zCRPTIk-0FkxJj1xow/ms.jpg",
            "review_count": 53,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "It's a diner. do try the diner stack at least once. i know to some, it's just a diner. ",
        "reviews": [
            {
                "review": "While this diner appears to be nothing special, they serve up some of the best and most craved dishes for breakfast all day.  The service is always excellent and the staff is quite friendly - even if their customers have just managed to fanagle a DD to drive them here after a night in campus town.For those of you health conscious, perhaps you can have wheat toast?  That's about the only health alternative here.  So settle down in a booth, order the horseshoe or infamous stack and prepare yourself for a guilty pleasure.My personal favorite is the hangover stack - a bed of hashbrowns, optional biscuit, sausage or hamburger patty, eggs any way you want them, slice of cheese, smothered in artery-clogging country gravy heaven.  It's really the gravy that sets this breakfast delight apart from the rest.  Guaranteed to take the edge off that night of heavy drinking - as if one indulgence weren't enough.",
                "reviewer_id": "0EfU6vvU7buXmTc3LPsnNw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26746613636739713,
                    "positive_probability": 0.7325338636325959
                },
                "stars": 5
            },
            {
                "review": "Yes. It is a diner/waffle house; it's the least original thing that can be said about it but no less true. Comfortable and relaxed, the perfect place to go when you need to ignore the angels of your better nutritional nature and just pig out on things slathered in gravy.If I were in college, lived in Champaign, and needed a late night place to haunt, this would be it.",
                "reviewer_id": "2CTCrl-YdeT-4LekCsJSLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3556975508491339,
                    "positive_probability": 0.6443024491508678
                },
                "stars": 4
            },
            {
                "review": "They have this dish called the diner stack....wowhashbrowns, two eggs, sausage patty, and gravy....all on top of each other. I also got a biscuit to go with it. I am pretty sure this might be one of the worst possible things to eat health wise, but damn was it good!!! I dont think I had lunch that day since it was such a huge meal and great hangover cure. The line can get long at this place for breakfast, but it moves pretty quick and it worth the wait IMO. Service is your typical diner service so not bad.",
                "reviewer_id": "3wSdAy0qbV_vtvbxHQrJkw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9901866270463533,
                    "positive_probability": 0.009813372953645368
                },
                "stars": 4
            },
            {
                "review": "This place is nostalgic. It's got that classic diner booth setup where the servers pass plates right from the center, and they're both friendly but abrupt like a diner should be.If the coffee even tried to be good here I'd probably be here more often (they usually always keep it topped off!). But it's consistently the worst coffee in town. You can taste the stale.Even so, it's a diner. I still go back for friendly people, cheap eggs, the clanking of dishes, and the grease rolling on the edge of the plate.",
                "reviewer_id": "3zxHXzxP6D6K6kvDImzMAQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8119631108644119,
                    "positive_probability": 0.18803688913558742
                },
                "stars": 4
            },
            {
                "review": "1st off I have not eaten here in over 10 years. I got the fish sandwich Which was 2 frozen fish pattys on a bun and plain fries. I could of ate cheaper at home with the same ingredients. My kids got the #2 breakfast and the grilled cheese sandwich which both of them loved. I give it 2 stars the kids give it 4 stars so we gave it a final score of 3 stars",
                "reviewer_id": "5ZIbB1o742vx77ZgO67ZQw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6230327572338524,
                    "positive_probability": 0.3769672427661497
                },
                "stars": 3
            },
            {
                "review": "I was excited when I walked in, because it reminded me of a Waffle House.  I know Waffle House is generally pretty disgusting, but I love it.  Then I looked at the Merry Ann's menu and . . . no waffles!  WTF?",
                "reviewer_id": "6uSW2qLSL5w0iz0g-Iwa-g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.700883993867872,
                    "positive_probability": 0.29911600613212824
                },
                "stars": 3
            },
            {
                "review": "Food was ok. Service was slow but once we put the order in the food came quick.",
                "reviewer_id": "7JdLXBk4T8D6gQFwxV0Y7A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4808353941683574,
                    "positive_probability": 0.5191646058316436
                },
                "stars": 3
            },
            {
                "review": "Came in with my family, ordered a smoothie, got a cup full of ice chunks with some fruity milk. Ordered a mega omelet with no ham, it comes back with ham. Server was very nice about remaking it. It comes back-- ham again!!! Left hungry. Not coming back.",
                "reviewer_id": "85IQTbyu8rYM6slllAV9Yw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16004040197193015,
                    "positive_probability": 0.8399595980280664
                },
                "stars": 2
            },
            {
                "review": "I've been to Marry-Ann's several times while visiting friends in Champaign.  It's an old school diner in every sense: small booths, you're expected to order your food then get out, mountains of greasy food, and cheap prices.On football Saturday's (when I go) it's a great place to fill up prior to heading to the stadium.  I've tried a couple of different things, but usually end up with steak and 2 eggs over easy.  Now to be honest, the steak is tough, thin, and overcooked, requiring a healthy dose of A1.  But hey, that's what I expect form a place like this.As an out of towner, I like to make at least one trip here.  Just take it for what it is; cheap, greasy eats.",
                "reviewer_id": "8vjkgeJB5pWCcJ0XWkv4zg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0028277283693788693,
                    "positive_probability": 0.9971722716306194
                },
                "stars": 4
            },
            {
                "review": "You'll find a diverse array of people dining here. This Merry Ann's isn't nearly as pretty as its newer sister location, but the food is the same. Sometimes you'll see students studying here.It's a 24 hour place, and there's one of those \"use the claw to grab a stuffed animal\" machines in the back if you're interested.",
                "reviewer_id": "93R48Yo7_H8Q4V59oJZyRQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.038762749917037397,
                    "positive_probability": 0.9612372500829605
                },
                "stars": 4
            },
            {
                "review": "(Note: Rating only applicable from 2am-6am)Stack.  Sausage.  Over-easy.  Biscuit.There have been nights where I go into Merry Ann's and that's all I'd say.  And I'd be a happy man.  Despite being off-campus, this is still the numero uno place to go when you've got that drunken hunger.  The late night staff is great too as long as you're not overly drunk or loud; my friends and I have come in enough that they recognize us, even though some of us have been alumni for a few years now.As noted above, the stack is their signature item (hash browns, meat, cheese, egg, and gravy), which I recommend with sausage (hamburger is too plain) and a biscuit.  An acceptable alternative is the horseshoe burger (toast, cheese fries, burger).(Second note: Make sure you go to this location and not the one in downtown Champaign.  The downtown one is too brightly lit, takes longer to get your food since it holds more people, and doesn't have the same staff or service)",
                "reviewer_id": "agJz7qFAkwGbzoC3I03h0Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6543521957365953,
                    "positive_probability": 0.34564780426339897
                },
                "stars": 5
            },
            {
                "review": "I went here as an alternative to IHOP, which I must say I adore, for various and idiosyncratic (read: sentimental) reasons.The seats face big open windows, so you get a nice view of some traffic going by (as well as a Walgreens and McDonalds) if you're into that -- I am.The food was pretty standard. My special came with a VERY large portion of hash browns.Unfortunately, I had to pay quite a bit extra for the same items I typically get with the special over at IHOP -- 2 eggs, bacon, hash browns, and some pancakes.However, it was worth it to be in a different location with its own ambiance. Feels a bit like you're eating at a diner in a small forgotten town that only has one main road running through it, and the people who stop there don't live there but are just passing through. Or I could be projecting.The staff when I was there was older and not college-aged kids, if that makes a difference to you.",
                "reviewer_id": "AsnmK0LnbKYRVwqOX8S6JQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006338891506472456,
                    "positive_probability": 0.9936611084935209
                },
                "stars": 3
            },
            {
                "review": "Just a fantastic establishment with friendly people. I have literally never ordered anything outside of the breakfast menu, and don't plan on ever doing so. The corn beef hash is the best in town, and the diner stack will cure you of all current or potential ailments. It's great for before you get black out drunk, great for after you get blackout drunk, and pretty good when getting blackout drunk is not involved at all.",
                "reviewer_id": "AZ9x-RhMQO_FwlW1reuE6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.132748283736469,
                    "positive_probability": 0.8672517162635255
                },
                "stars": 4
            },
            {
                "review": "Not a fan. I was expecting much better, even from a breakfast-all-day diner, because I've raved over similar diners in other review (see: CJ's in Seattle and Izzy & Nat's in Battery Park). However, no. I have no interest in darkening the door of this diner again.I rate diners based on how they deliver on four menu items: their hash, biscuits and gravy, country fried steak, and pancakes. I wasn't able to try Merry-Ann's hotcakes or their steak, so I'm just rating my experience on the hash and biscuits and gravy.Merry-Ann's is a cute, Illini-paraphanalia-ed (is that a word?) diner with overly hovering waitresses and bad orange juice. The booths are teeny and sticky, with an assortment of dairy-free creamer and jam stacked haphazardly on one end. Interesting. But ick. Their $3 orange juice is pulp-less, watered down concentrate.Their hash is AMAZING. It's the reason why I'm giving Merry-Ann's its single star. Crispy yet soft, I could've had platters of this thing. Dripping in ketchup or on its own or mixed with the diner's pepper gravy, oooh the hash is heaven.Biscuits and gravy. Oh gosh. What went wrong? I appreciate the full-size serving, but the biscuits were soggy and the gravy.... I am a fan of sausage gravy in general (I don't discriminate), and I have no qualms of venturing out into the pepper gravy arena, but gravy in general should be thick and flavorful and not congeal and as awesome as it could be. Merry-Ann's does not know how to make a good gravy. It was flavorless and milky and the only reason I even ate it was because I mixed it with the aforementioned fabulous hash browns.Sigh. Oh well. Am still on the search for a great breakfast nook in Champaign. Any suggestions?",
                "reviewer_id": "b4mD_qeym7sGUhDN4a96FA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.99910458535419,
                    "positive_probability": 0.0008954146458131964
                },
                "stars": 1
            },
            {
                "review": "I have some pretty fond memories of this place, since this is where we USED to go before the new one was put downtown. This is a total drunk-food/hangover spot for sure. The food is by no means phenomenal, and the method of just walking in, seating yourself, and being casual about it definitely doesn't appeal to some people. But being that it's 24 hours (and there are few of those places in Champaign) this will always be a favorite of mine.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04487418034324551,
                    "positive_probability": 0.9551258196567504
                },
                "stars": 4
            },
            {
                "review": "This was the first diner that I've been to but I was not impressed at all. The food was just okay, nothing to rave about. You can find your regular grease-laden favorites here. As far as specialties go, I'd say, the diner stack? If you're looking for a fast track to a heart attack after a game at the Assembly Hall, look no further.",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2124300146511501,
                    "positive_probability": 0.787569985348848
                },
                "stars": 2
            },
            {
                "review": "Just okay food. I can make better food at home for cheaper.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.551062124313983,
                    "positive_probability": 0.44893787568601684
                },
                "stars": 2
            },
            {
                "review": "Horrible service, OK stack.  I wish the hash browns were a bit more crispy, but I guess you can't complain when it's $4.50!",
                "reviewer_id": "DbJHA6uuUeCcCrIiLxDawg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6404989003004097,
                    "positive_probability": 0.3595010996995888
                },
                "stars": 3
            },
            {
                "review": "Looks like a waffle house, smells like a waffle house.. feels like I'm back home in SC! He had the diner stack, biscuit on the bottom, eggs scrambled. I had 2 eggs over medium with bacon, hashbrowns, and toast. We were the only customers on a Sunday morning at 1pm until the hungover undergrads rolled in. Service was excellent. Our waitress was very friendly, and our food arrived promptly. It was delicious and didn't leave me with that greasy what did I just put in my stomach feeling that I was expecting (from past WH experiences). I will definitely come back. The only thing that could have made my experience better is a big bowl of cheese grits...",
                "reviewer_id": "DJbX0XH6Kn3Nm5uo58lu9A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01903143582699733,
                    "positive_probability": 0.9809685641729938
                },
                "stars": 4
            },
            {
                "review": "merry ann's will always hold a special place in my heart, as evidenced by my making it my first review.  at the corner of neil and kirby, just on the edge of the illinois campus, it was one of my favorite places back when i went to school there.  you might be thinking, \"really, diner food for one of your favorites?\"  partly.don't get me wrong - it's not the best food I've ever had.  i mean c'mon man, it's a diner for goodness sake.  but if i'm ever in the mood for diner food, give me merry ann's over ihop any day.  but it's about more than just the food - i'll get to that in a second but first my review.  when i ate here, i really only ordered one of two things: the #1 and the diner stack.  ahh yes...the stack.  two eggs any style, sausage patties or burger, slice of cheese, served on a bed of hash browns, over your choice of biscuits or not, covered in a generous ladling of sausage gravy.i get mine over-easy, with biscuits, and the hamburger patty (because it felt heartier than the sausage patties and went better with the cheese, plus you get bits of sausage in the gravy anyway.)  top it off with some black pepper and about 10 plops of tabasco, and i'm good to go.i've seen the stack ordered with over-medium (a solid choice and they make them well here) or scrambled (though i prefer the runny yolk.)  the hash browns are your regular frozen kind, but somehow the cook always gets a good mix of soft and crispy, even under all that gravy.  i prefer the burger, but my wife favors the sausage patties and a side of toast in place of the biscuits because it's less heavy.  but the key to the diner stack is the gravy.  i've never seen them actually make it, but they always seem to have a vat of it readily available.  it looks real thick, but goes down surprisingly smooth.  now i understand the phrase, \"and it's all gravy,\" because it tastes amazing and goes great with however you build your stack.  any way you order it really, it's a thing of breakfast beauty.  i will never stop touting the glory of the diner stack at merry ann's.if you're not in the mood to miraculously gain two pounds, then i recommend the #1: two eggs, choice of bacon, ham, sausage links or patties, hash browns, and toast.  traditional.  plain.  simple.  delicious.  and you might only gain one pound.the other reason i hold this place in such high regard?  the memories.  the people, the conversation, the bonding.  all of it.  i was introduced to merry ann's by upperclassmen who used to come here and just talk about stuff.  just you and some friends fitting no more than four to a booth and talking about life, about school, about what lay ahead, and bonding over a stack and a smoke (back when you could smoke in restaurants.)  as a student, you couldn't get to merry ann's unless you had a car (which i didn't) so it meant something to me when i would be invited to join them.  when you're young and a few hundred miles from home and living by yourself for the first time, it was nice to have a place where you can open up or just sit back and enjoy conversation.i've spent many a good time and never a bad time here.  i enjoyed everything about it.  i liked that it was 24-hours, so you could head over after the bars closed, or in the middle of the afternoon (i've done both, and maybe once or twice during regular breakfast hours.)  i liked the fast and friendly service, which it was for the most part.  i liked that they always asked if we wanted our checks split.  i liked that townies ate here; made from bits of real townie, so you know it's good.  i liked the menus that never changed, except for when they got laminated.  i liked watching the cooks assemble a stack like an artist at work.  i liked sitting on the left side a little more than sitting on the right - don't know why.i leave you now with a couple of do's and don'ts for merry ann's; some words of wisdom if you will.  do eat here.  do not judge it until you do.  do try the diner stack at least once.  do not box or take it to-go (it won't be the same.)  do make sure at least the driver is sober enough to make the drive here.  do not eat all by your lonesome (invite someone.)  do expect to wait for a table (and if there's no wait then it's all gravy - see what i did there?)  do not go there to study.  do respect the staff and other patrons.  do not overstay and take up a booth if there's a long wait formed.  do tip well.  do not sit in silence.  do engage in good conversation.  do NOT talk about fight club.  and do come back now, ya hear?so many words for a little diner in central illinois.  i promise future reviews won't go this in-depth or off-tangent, but this was more about paying homage to friends, to this place, and to memories from way back when.  i know to some, it's just a diner.  not me.  yeah it was far.  yeah it was never really clean.  yeah it was just diner food.  but to me it was more than just that.  the time i spent at merry ann's was always...comforting.",
                "reviewer_id": "DTn_TAo3Mhj9xI2H2zv71A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00026483961444754173,
                    "positive_probability": 0.9997351603855279
                },
                "stars": 5
            },
            {
                "review": "This is a great place for late night food, but it's your stereotypical diner fare. I'd recommend the breakfast burrito. It was pretty sad seeing some worker sitting down on the floor behind the counter just texting on his phone the whole entire time.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15301314656180995,
                    "positive_probability": 0.8469868534381889
                },
                "stars": 3
            },
            {
                "review": "Better for the fact that it's open 24/7 than the quality of its food. Merry Ann's is definitely a place to recover from a rough night. I just love breakfast.",
                "reviewer_id": "eIQwlepZ2qgvv3ZnCPfucA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25151792015106267,
                    "positive_probability": 0.7484820798489367
                },
                "stars": 3
            },
            {
                "review": "Restaurant reviewI so wanted to like this place, but the food just falls below par. I would have to say that the wait staff is top notch. Very attentive friendly and helpful! This is a classic nostalgic diner where the server comes right to the side of your table to take your order. The menu itself is quite limited to basic breakfast items such as eggs, hash browns, sausage, burgers, sandwiches, and salad. I went with the house specialty dish the diner stack that has (hash Browns topped with cheese, hamburger or sausage patties, two eggs, and then smothered with delicious sausage gravy) I missed the part of the menu where it said smothered... The dish had so much gravy on it that you could not make out the food underneath. The hashbrown were oily, no real crispy to it. The sausage and eggs were good without complaint. Overall with the oil and salt, it was somewhat difficult to eat. I think if they changed some of the options to other more contemporary diner foods they maybe better off. I had high expectations, but the food just as other reviewers wrote falls flat.Pros: friendly service, cleanCons: the food really is below par, salty and very greasy not in a good diner kind of wayHidden deals:Monday to Friday 6 am to 11 am2 eggs, 2 pancakes, 2 ham for 3.99Ham omelet 3.99All day specials Mon-ThursSuper burger 4.40Grilled ham and cheese 4.00",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9260400838731356,
                    "positive_probability": 0.07395991612685791
                },
                "stars": 2
            },
            {
                "review": "Merry-Ann's Diner is a truck stop style 24 hour breakfast diner. Unfortunately, Merry-Ann's is not very good. I can't recommend it.Merry-Ann's menu, decor and layout, and overall look and feel, are identical to that of a Waffle House franchise. I suspect that this diner was designed to duplicate the successful Waffle House model. All of the menu items, from the coffee, eggs, and omelets down to toast and sweet rolls, are poor, although some items are a notch better, namely mediocre. Service is roughly comparable to that of other Waffle House stores. Ditto for the decor, and, in fact, the actual floor layout.Prices are low in absolute terms but they are somewhat high for the types of menu selections offered, quality aside. (And the quality delivered is mostly poor.)Before the Hilton-Garden Inn took over the property across the street, there was a well-regarded breakfast restaurant, almost a Champaign institution, attached to the property. The Hilton razed the restaurant as part of its renovation. Too bad. The Merry-Ann Diner is not suitable for breakfast at any time of day.",
                "reviewer_id": "FaHa06QgYKrko68AYM199A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02921107573053071,
                    "positive_probability": 0.9707889242694605
                },
                "stars": 1
            },
            {
                "review": "Service 5 stars, food 2 stars, atmosphere 2 stars. Overall 2.5 stars.",
                "reviewer_id": "FFsuViuxEt6rvWPyTMo02Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4128697325873489,
                    "positive_probability": 0.5871302674126506
                },
                "stars": 2
            },
            {
                "review": "Generally, I'm a fan of cheap, greasy diner food. This place, however, is just bad. It's overpriced for what you get and the service is awful.  The diner itself could use a little work as well. Our table was sticky and dirty. My friend and I stopped here before I moved to Champaign while I was in town looking at some apartments. My friend ordered the grilled cheese with fries and I ordered a chicken sandwich and fries.  Her grilled cheese was basically a piece of American cheese on white bread. That's it. I've made better grilled cheese at home using the same ingredients. There wasn't really much to my chicken sandwich either. Overall, nothing special. I don't understand the rave reviews of this place at all.  Maybe the breakfast is better? Too bad, I won't be returning. Also, I noticed a sign that said NO STUDYING. I guess they want you to just eat your crappy food and GET OUT. The location in downtown Champaign seems nicer, but I haven't been in because of the horrible experience I had at the other location. Might give it a try to see if it's any better.",
                "reviewer_id": "FVOhtMCxbqm_9riDcVmmVw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9863587254308046,
                    "positive_probability": 0.013641274569194246
                },
                "stars": 1
            },
            {
                "review": "Best place for a hangover meal! The omelet are always on point amd you can't go wrong with the diner stack! the people are super friendly and the atmosphere is just a classic diner that you can walk in in last nights clothes with no shame. Love it.",
                "reviewer_id": "HsV2ZQ6Y6g0czba0MaCBkQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14621219103633282,
                    "positive_probability": 0.8537878089636702
                },
                "stars": 4
            },
            {
                "review": "Average small-town diner feel in all the good and bad ways. Food tastes pre-cooked or frozen, meny is too large, service is great, and it's breakfast all day.",
                "reviewer_id": "hYh2hTAfio3UrafRljjuzw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6920880837809126,
                    "positive_probability": 0.30791191621908864
                },
                "stars": 2
            },
            {
                "review": "I'm generally not picky, but Merry-Ann's has become a disappointment for me.  You might say \"well, it's just diner food,\" but even for that it's kinda expensive.  If you stick to biscuits and gravy you're pretty safe, and their fries and hash browns aren't bad.  However, everything is a couple bucks more than I would like to be paying for greasy diner food.I think the final straw with me was when I ordered a chicken tender plate only to receive chicken nuggets that definitely came out of the freezer: uniform inside texture, only vaguely reminiscent of chicken.  I'm pretty picky about mechanically separated chicken.  Maybe that's snooty, but I just hate it.  In any case, for how much I paid I expected something a little better than that.For late night food, you're better off making it yourself or even going to Steak 'n Shake.",
                "reviewer_id": "iN34tIuP_IYqQWIaPhddmw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00015655908252034653,
                    "positive_probability": 0.9998434409174781
                },
                "stars": 2
            },
            {
                "review": "Outstanding breakfast!  Eggs so fresh you'd think they had the chickens out back.  C ordered corned beef hash and was delighted to find that they mix in grilled onions.Highly recommended.  An institution in Champaign.",
                "reviewer_id": "lmzyA38QR3GJ4MP4uErFGg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06479984748227559,
                    "positive_probability": 0.9352001525177247
                },
                "stars": 4
            },
            {
                "review": "Merry-Ann's Diner is the definition of mediocrity when it comes to diners. Unfortunately, Champaign has a lack of diners and 24 hour restaurants.  I usually get the Diner Stack or the Hangover Stack if I go in past midnight. Both are pretty average with the sausage gravy masking the rubbery taste of the hamburger and the hashbrowns tending to be the best part of the meal. I don't necessarily think that Merry-Ann's is bad, but there are better breakfast places (Sammie's Pancake House in Champaign is much better/cheaper in my opinion) and late night places (almost anything on Green Street). It's definitely better than the IHOP on Green Street, which is terrible in every conceivable manner.",
                "reviewer_id": "LxWkCCjbxcLEuoit8RBDEQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9971345833997536,
                    "positive_probability": 0.0028654166002359096
                },
                "stars": 2
            },
            {
                "review": "It's a cute diner!! The food is not terribly greasy but isn't 5 star quality but c'mon, it's a diner! It's suppose to be that way. The breakfast burrito is very good. It's huge so I got to take it home which is always nice for a college student. Cheap prices, decent food, what more could one want in a highly populated college town??",
                "reviewer_id": "mlpqV5Ck1jDmVh5qi6ijng",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8622704582302941,
                    "positive_probability": 0.13772954176970315
                },
                "stars": 3
            },
            {
                "review": "Merry Ann's is a great place, a true down home American diner.  They have great breakfast food, which is all I've ever had there.  You can sit as long as you want, the waitresses keep bringing you refills, and there is a good mix of locals and students.  My boyfriend and I used to always go here to study, or for late night munchies.  I definitely recommend it.  It's not the cleanest, or healthy by any means, but if you're looking for a good American diner, this place is it!",
                "reviewer_id": "mlxwcI_dMNzdwwYzjADn-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03677034503449726,
                    "positive_probability": 0.9632296549655
                },
                "stars": 4
            },
            {
                "review": "I would normally rate this 3 stars, but considering my behavior the last couple times here, I suppose I owe them at least an extra star in asshole tax. An average diner with good service (by this I mean they dont kick people out who clearly need to be put to bed). I suggest the Diner Stack with Lipitor for dessert.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7531856582922412,
                    "positive_probability": 0.24681434170775415
                },
                "stars": 4
            },
            {
                "review": "Walked into Merry-Ann's for breakfast on Saturday.  There was no sign to indicate method of seating.  I stood there while several staff stood idly behind the counter.  They looked me in the eye but never acknowledged my presence.  I waited a bit and then left.  I will NOT return.",
                "reviewer_id": "OZCzq4BvNGdTpBE2iUg0Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4119670109955706,
                    "positive_probability": 0.5880329890044338
                },
                "stars": 1
            },
            {
                "review": "Good food, good pancakes, SUPER FAST service.  I was very impressed with that.  Standard diner fare, my hubby liked the biscuits and gravy and didn't complain about being brought to a diner (he's a snob usually).So overall, a great cheap place to go.",
                "reviewer_id": "ozrNVWvxqNyzcrVFT1zDNQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5026567588100549,
                    "positive_probability": 0.49734324118994555
                },
                "stars": 3
            },
            {
                "review": "We ate at Merry-Ann's Diner in December of 2010 and our entire experience was very disappointing. First, we struggled to even get into the building due to an ice buildup on the sidewalks, common sense says that you at least take the time and salt your sidewalks for your customers safety. Our waitress acted like she had better things to do than to take our order. When our orders arrived my husband ate about 80% of his but explained that the flavor was \"lacking\" and that his food was \"very greasy\". My order was virtually inedible...literally only ate a couple of bites and was unable to stomach anymore of it due to the horrible flavor and excessive grease. The two best things about our meal was our coffee and getting the bill so that we could leave. The restaurant itself was dirty. The only positive thing that I would guess that this diner is good for is a hangover fix...unfortunately we weren't hungover college kids and were actually expecting a good meal, which did not happen.",
                "reviewer_id": "p5QIAR4nshID89WvPCs0iQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.003449183593994021,
                    "positive_probability": 0.9965508164060113
                },
                "stars": 1
            },
            {
                "review": "I first went to Merry Ann's the night I craved The Home Stretch Haystack. Merry Ann's version paled in comparison. I gave them another shot a few weeks later, this time for lunch.  I ordered a blue plate special, country fried steak, mashed potatoes and gravy, and peas. The country fried steak patty was chopped formed, deep fried, and covered with a gravy dry mix, which also covered the potatoes. The peas were from a can. Haven't eaten there since.",
                "reviewer_id": "PbNJ09Y1E1hjx9mORJrYzg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0020127596472526367,
                    "positive_probability": 0.997987240352745
                },
                "stars": 1
            },
            {
                "review": "So terrible.Everything... besides the hotcakes.",
                "reviewer_id": "pfTTMGZc1JYI5LYqhITRgw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5110304701586389,
                    "positive_probability": 0.48896952984136133
                },
                "stars": 1
            },
            {
                "review": "I went to Merry-Ann's for the first time on Sunday morning. I was a little bit hungover (oops) and ready for some diner food. Merry-Ann's satisfied all of my breakfast cravings and then some. I had the #1 combo - 2 eggs, hash browns, bacon and toast. I also got a half-order of gravy and a biscuit, plus a coffee. The bacon was by far the most disappointing part of the meal. It was just flavorless and gross. Everything else made up for it, though. My eggs were done perfectly (sunny-side-up), the hash browns were crispy, and the biscuit and gravy was just the right amount of spicy. Two people had a good, filling breakfast for around $14 before tip, which rocks. Pros: Everything except the bacon and the awkward time when we had to stand around and wait for a table to open up. Oh, also, I wish they had Heinz ketchup.",
                "reviewer_id": "pjIrFFjl03twCAaQMJQxwQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1188881158281047,
                    "positive_probability": 0.8811118841719017
                },
                "stars": 4
            },
            {
                "review": "The Original Merry Ann's...look no further for your search for the proverbial greasy spoon.  What is it about this diner down by the train tracks?  Is it scarfing down cheese fries on blindingly bright orange decor at 3 in the morning after a night out?  How about when you feel the train shaking the whole place when it passes by a few feet away?  Maybe it's the \"diner stack\" (a blob of eggs, biscuit, sausage, on a bed of hashed browns, then drowned with gravy).  Or its hangover cousin that adds hamburger to the mess?It's a rarity to find a place like Merry Ann's in Chambana nowadays - best to enjoy it while your stomach can handle it!",
                "reviewer_id": "Pt9jWh6tYhA2YZhqt5oFAA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9904195576254103,
                    "positive_probability": 0.009580442374583291
                },
                "stars": 5
            },
            {
                "review": "We were looking for somewhere to eat after 9:30pm on a Sunday night, and this was about the only place open. The service was good, the place was friendly, and the food was tasty.",
                "reviewer_id": "qT5l2CphwfU9CP69ocQiew (1)",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5961338066277152,
                    "positive_probability": 0.40386619337228413
                }
            },
            {
                "review": "We were looking for somewhere to eat after 9:30pm on a Sunday night, and this was about the only place open. The service was good, the place was friendly, and the food was tasty.",
                "reviewer_id": "qT5l2CphwfU9CP69ocQiew",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5961338066277152,
                    "positive_probability": 0.40386619337228413
                },
                "stars": 3
            },
            {
                "review": "Amazing diner food, but that's it.It's still a diner, no matter how you cut it.It's nothing to really make a fuss over, as even the best diner food is still diner food.The price is reasonable and they're open till all hours of the night.  Making my ridiculous drunken forays into Champaign-Urbana much more comfortable and filling.I love this place, but it's just a diner.The atmosphere and look of the place is classic 1950's diner, which is actually pretty awesome.  I seem to always get the really short and rude servers.  The ones that make you feel like you're not supposed to be there.So, there you have it.  It's great food, poor service, great looking diner, great price.  But, man have my waitresses been bitches.",
                "reviewer_id": "SBQ3S4ywuR939q6JY81jtg (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21399909280625218,
                    "positive_probability": 0.7860009071937475
                }
            },
            {
                "review": "Amazing diner food, but that's it.It's still a diner, no matter how you cut it.It's nothing to really make a fuss over, as even the best diner food is still diner food.The price is reasonable and they're open till all hours of the night.  Making my ridiculous drunken forays into Champaign-Urbana much more comfortable and filling.I love this place, but it's just a diner.The atmosphere and look of the place is classic 1950's diner, which is actually pretty awesome.  I seem to always get the really short and rude servers.  The ones that make you feel like you're not supposed to be there.So, there you have it.  It's great food, poor service, great looking diner, great price.  But, man have my waitresses been bitches.",
                "reviewer_id": "SBQ3S4ywuR939q6JY81jtg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21399909280625218,
                    "positive_probability": 0.7860009071937475
                },
                "stars": 3
            },
            {
                "review": "When you're in Champaign, and you want a quick, cheap breakfast with good service, you come to Merry Anns! I loved coming here all the time in College to do some homework in the morning and get breakfast. The ladies who worked in Urbana side were always very friendly and remembered faces/ orders. At one point they would give me coffee on the house and whip up my order before I even placed it! I know they have 24/7 breakfast, but since I lived in Champaign, I never was apart of the crews who would come in at 3am and much away.Naturally, when visiting for the summer, I had to go back to Merry Ann's with a few friends and grab hangover brunch. This time, we went to the Merry Ann's on Neil street. The diner on Neil is definitely smaller than the one in Urbana and was much, much more busy/crowded. Still, the waitress was very friendly, and I know I enjoyed my meal! We didn't feel rushed at all to finish, even though the line was out the door and we felt bad if we kept staying around just to talk/ get more coffee. Unless you're looking at somewhere like Le Peep to get brunch with your parents, I highly suggest Merry Ann's since it is a staple at U of I.",
                "reviewer_id": "tg7okrqe-28FW4kpN7aeNQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6506840221514901,
                    "positive_probability": 0.3493159778484901
                },
                "stars": 4
            },
            {
                "review": "Merry-Ann's Just doesn't do it for me.  I'd just assume walk to Subway or Peking Garden when I'm looking for a cheap lunch.",
                "reviewer_id": "TiSrb2z0UmsF-Vw91cEVDg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6706061710830723,
                    "positive_probability": 0.32939382891692653
                },
                "stars": 2
            },
            {
                "review": "The stack after 1am is the only thing I ever really came here for.  But it sticks out in my memory.  Ah the goodness.  I also went to the other newer location in downtown Champaign.  But its almost too new and clean to enjoy properly.  This place is dingy and small, but it gives it character.  At either rate, if you in town and awake late at night stop by and order the stack.  You'll be amazed you ate it.  And more amazed you loved it.",
                "reviewer_id": "TZCbIU6_8rTxxtFNUo3hBA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13811570787449146,
                    "positive_probability": 0.8618842921255124
                },
                "stars": 4
            },
            {
                "review": "The Merry-Ann's at Neil and Kirby is a standby.  I use to live near there and my neighbor and I would go there every Sunday morning.  The regular waitress was awesome and knew what we wanted.  It is the typical greasy spoon and I love it for that.  Got the t-shirt.  I've moved and have yet to find that certain place that gives me the warm fuzzy feeling that a omelette or diner's stack from Merry-Ann's can provide.  Forget your calorie-counting conscience at the door.I think the one downtown is okay, but because I heart the original so much, the dt one will never compare.",
                "reviewer_id": "ugPNMeR_KqMDrkZJ14X2lA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.017460834700699743,
                    "positive_probability": 0.9825391652992953
                },
                "stars": 4
            },
            {
                "review": "The Billy Goat's of Champaign.  'Nuff said, but in case it's not...Definitely the place I go to after a night of debauchery for that heart-clogging, turn-everything-it-touches-transparent-from-the-grease, orgasm-in-your-mouth goodness.  I mean, they have a \"hangover burger\" for f*ck's sake!I love breakfast food.  I would eat breakfast food every meal of the day if I didn't mind putting on 20 pounds (trying to go in the opposite direction, actually: new years resolution, you see =\\).  Merry-Ann's has AMAZING breakfast food.  Ergo, I love Merry-Ann's!  Everytime I go, I make sure to get The Dinner Stack (everything you could want for breakfast dumped together and then smothered in sausage gravy), or their Super Burger (sometimes with a side of cheese fries even though I know the burger itself fills me up... what can I say?  Thirsty impairs my judgement).Breakfast isn't all that Merry-Ann's does well; they have all the typical diner food (juicy burgers, grilled sandwiches, cheese fries, milk shakes, etc.) - but better.Open 24 hours a day with almost most things on the menu only around $5, you'll be able to get that extra drink or two at the bars/club.",
                "reviewer_id": "urDog6OhPoNKPJFUDob7AA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35593122129728144,
                    "positive_probability": 0.6440687787027091
                },
                "stars": 5
            },
            {
                "review": "Dear Merry-Ann's,Please start serving:1) Real cream (instead hydrogenated fat/soybean oil)2) Real maple syrup (You serve breakfast...come on)2) Real butter (see number 1)Also: Overpriced.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7909845713241224,
                    "positive_probability": 0.209015428675876
                },
                "stars": 1
            },
            {
                "review": "Good old-fashioned American diner.  The service was a lot friendlier than \"kiss my grits\" level, so kudos for that, but the kitchen had a hard time handling my request to put out my short stack a little while after my main meal.  I ended up waiting ten more minutes after we had finished our other food.They have some great cheap specials here, but I went with steak and eggs for $9.  One friend got the \"mega omlet\" [sic] for $7 which was pretty tasty.  The food was mostly plain and bland; I mean, it's hard to screw up scrambled eggs and hash browns, but it just wasn't that great.  Even the toast was more flavorless than regular toast (how is that even possible?).  But the pancakes were delicious--fluffy and wonderful.  The orange juice was terrible.  We saw the waitress mixing up a big jug of it from concentrate and water out of the soda machine.  It was room temperature when she served it.  Yuck.  Good times, though.  It's a diner.  Word of warning to you U of I students--there is a one-hour table maximum from 9-3 (that's a.m. AND p.m.).",
                "reviewer_id": "x7ZP6lB2fZl2UN6lun87lA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5959408533286361,
                    "positive_probability": 0.40405914667134435
                },
                "stars": 3
            },
            {
                "review": "This place is great when you're in your early twenties and drunk and it's after midnight. Otherwise, there are a ton of better options in town for the price.They have diner food that is about on par with Denny's, they're open late, and are within walking distance of the local bar scene. That's about the best I can say for them.",
                "reviewer_id": "YbkPwGiLcrdA2Vx4cjsIeg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.328943673195152,
                    "positive_probability": 0.671056326804852
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "2UAbUSTMsR9G26A8AYO3dA",
            "zOaUK1e0W7TtyYabzDBK9w",
            "8diLGO9WGVQWr05FWZ_yTw",
            "oL91dKGJxL7F1u9X-QKXiw",
            "VI-zVIlK11AUz47mro8nMA",
            "6HKjKhgDLBpuZFNBOCzVQw",
            "u-y1z3usKenHtOGrH5Vveg",
            "4PatE4TUcea0Dj0hKICGJw",
            "KUpdnQi16DGP54FlDWOJ6g",
            "wO8c-FbduauxCGiEHchGRA"
        ]
    },
    "zOaUK1e0W7TtyYabzDBK9w": {
        "keywords": {
            "bigrams": [
                "merry_ann",
                "downtown_champaign",
                "hash_browns",
                "diner_food",
                "better_food",
                "mediocre_diner",
                "place_sober",
                "diner_fare",
                "customer_service",
                "dragging_chair"
            ],
            "unigrams": [
                "food",
                "merry",
                "ann",
                "diner",
                "place",
                "good",
                "champaign",
                "open",
                "service",
                "pretty"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": true,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "yes_free",
                "Caters": false,
                "Corkage": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": true,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "loud",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "zOaUK1e0W7TtyYabzDBK9w",
            "categories": [
                "Diners",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1 E Main St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "00:00"
                }
            },
            "latitude": 40.1181331447692,
            "longitude": -88.2428999080116,
            "name": "Merry-Ann's Diner",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/8lRcw5ijaCTtaurzqPjlgw/ms.jpg",
            "review_count": 36,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "It gets crowded here when drunken people come out of downtown Champaign's bars, but outside of that it's easy to grab a seat. The food is clearly average generic diner fare, but the staff are super friendly. Very good food and service. ",
        "reviews": [
            {
                "review": "Good choice for traditional diner food with no frills.",
                "reviewer_id": "-9JGmOgqza0FDkzYLP48Zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13369855802380012,
                    "positive_probability": 0.8663014419761994
                },
                "stars": 4
            },
            {
                "review": "Arrived in Champaign late on Christmas Eve and the hotel had stopped serving food. We hit the snow-filled road to find some grub...actually I was pining for a piece of pumpkin pie. The Merry-Ann's near our hotel was closed but we spied another one that was open 24 hours.It was as if I'd walked into a time warp -- the menu, the decor, and the pricing was unusual for this California gal. I was thrilled to get a piece of pie and even happier for the $2 price. There's nothing on a menu for $2 in California, not even a sharing charge!My partner had a grilled cheese and tomato sandwich with fries. It may have been the processed American cheese slices...but she was hungry. I'm glad I wasn't too hungry because the vegetarian options were quite limited and if I'd stuck to my veganism, I'd be SOL.",
                "reviewer_id": "-Snu0seO3w87obiBRScRbA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6455883141024471,
                    "positive_probability": 0.3544116858975498
                },
                "stars": 2
            },
            {
                "review": "I'm drunk, I'm hungry, I'm in a hurry... LET'S GO TO MERRY-ANN's!!!whooo hoo!!!The lady and I stopped by Merry-Ann's on friday. I'm not sure what time it was, we had sort of been at a couple of places, I remember being at Radio Maria (had the fried artichoke, it was delicious); I think we then went to derailled. I hit the devil boxes, put $60 in, took out over $300 whoo hoo. I kind of recall going to quality... then it gets kind of fuzzy. I do remember \"let's go to merry-ann's\" I don't think I would ever say no to that suggestion. I don't remember what she ordered, but I'm pretty sure there were pancakes involved. I got what i always get, steak and eggs. 2 eggs over easy, steak medium rare, hashbrowns and wet white toast. How wet, i want it friggin soggy! On friday, the toast was limp it was so soggy. It was amazing. One time, I was so hungry, that I got 2 of that order. Do you want that to go? NO, GIMME BACK MY FORK! I considered doing that again on friday, but didn't. We then went to the City Center (more like the country center... amirite) for my son's birthday. Great, now i want Merry-Ann's for lunch.",
                "reviewer_id": "-UMxemhI-Co189BNhhuqpg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.99349696474211,
                    "positive_probability": 0.006503035257882096
                },
                "stars": 5
            },
            {
                "review": "Garish lighting, hard plastic seats, and mediocre diner fare.  On the other hand, open 24/7, fast service, cheap, and very very tolerant of loud, obnoxious, uncooperative, and drunken clientele (which, admittedly, my friends and I were last Friday.  Correction: my friends were; I, as DD, unfortunately (?) was not).  Final assessment: Excellent place to sober up (or not) after a prolonged night of drunken debauchery in downtown Champaign.  Probably wouldn't go there otherwise, because being the lone sober one at an otherwise mediocre diner sucks =P",
                "reviewer_id": "-Yk1KPbMJGY5OkRUeo8jlw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9972442202588275,
                    "positive_probability": 0.002755779741171209
                },
                "stars": 3
            },
            {
                "review": "Perfectly serviceable diner food -- haven't tried the Mexican food yet, though. REALLY nice people working there, too. Great hash browns as well.",
                "reviewer_id": "0xdrA5SyCKBsNOkGWA3LSw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5486463823535378,
                    "positive_probability": 0.45135361764646287
                },
                "stars": 4
            },
            {
                "review": "Honestly, this place probably deserves just one star.  However, I experienced Merry Ann's tonight with a delightful mixture of old and new friends.  Some of my friends were drunk, others were not.  All I had was a milkshake, which was decent.  One guy ordered some eggs, which looked and tasted like rubber.  The atmosphere is mediocre, with no music and just the buzz of fluorescent lamps.  The seats are hard and uncomfortable.  Despite all this, I enjoyed my time at Merry Ann's today, so I'll give it 3 stars.",
                "reviewer_id": "27lOuVNMavQQhzvtz3pNGg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006123022300299871,
                    "positive_probability": 0.9993876977699717
                },
                "stars": 3
            },
            {
                "review": "If you like greasy, unhealthy, but wonderful tasting food, this place is like coming home. I have frequented the diner during grad school and liked the fact that they are open 24/7. Budget friendly too!",
                "reviewer_id": "2ZbcMH_SKCmknofTamSR4g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19863912593761054,
                    "positive_probability": 0.8013608740623913
                },
                "stars": 5
            },
            {
                "review": "Keeping with the theme of a few older reviews below. You can't say all merry-Ann diners are the same because the 1 on neil street sux's compared to this one. This one is cleaner and has a better staff that can actually break Into a smile or 2. Better food, better food and better food.",
                "reviewer_id": "5ZIbB1o742vx77ZgO67ZQw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35639896619432226,
                    "positive_probability": 0.6436010338056795
                },
                "stars": 4
            },
            {
                "review": "I can't help but feel that the foodies who love this place only do so with a kind of hipster irony.  When ordering at Merry-Ann's, \"Occam's razor\" applies: go with the simple choices.  See a particular dish on the menu that you'd consider ordering?  First, imagine yourself cooking it at home...now count all of the potential steps where poor decision-making or lack of skill could result in disaster.  Choose the dish where there is little room for error and you're set.On my first, misguided visit to Merry-Ann's, my youthful enthusiasm (and naivete) led me to order the Mexican omelet.  What was I expecting?  Maybe an egg-licious concoction with chorizo and peppers.  Instead I got something akin to a burrito with scoops of taco meat, where the thin skin of egg acted as a wrap.  I openly and unashamedly admit that I am a snob in this regard--due to early childhood trauma involving Taco Bell, I simply refuse to consume oily ground beef cooked with packets of \"Mexican-flavored\" seasonings.  The meal didn't make it far past \"Go\" before it had to take a few steps back...  Err.With that experience behind me, I still gladly stop by Merry-Ann's, but now I stick with those simple dishes, like eggs, breakfast meat, and hash browns.  All the breakfast combination plates are pretty reasonably priced and the serving sizes are more than adequate.  I don't recommend the dinner items (remember Occam's razor?).The overall ambiance of the place is above average.  Compared to campus-town's IHOP, Merry-Ann's is bright and clean.  The kitchen isn't in a separate room, which allows you to observe that a good deal of the food items are microwaved.  Maybe those people who have food industry experience wouldn't be surprised or bothered, but most places aren't quite so brazen about the nature of food preparation.For standard breakfasts, Merry-Ann's is a solid choice, especially as it's the only real 24-hour game in town and within easy walking distance of all the downtown bars.  Still, I'd recommend keeping your expectations low.",
                "reviewer_id": "6nqakbu2zU6fjOmbE83_-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05166664222190104,
                    "positive_probability": 0.9483333577781059
                },
                "stars": 3
            },
            {
                "review": "Merry-Anns is best in the wee hours of the night, (or morning) when your judgement is down and a huge greasy plate of fries, a burger, and milkshake no longer sounds like a bad idea.  Or just when it's 11PM and you decide you need an omelet and pancakes.  Or when you are out on the town and simply no where else is left open to feed your poor, wandering, hungry soul.   It's 24/7 diners like this, that while never your first pick when deciding where to eat, you realize are vitally important to life when the above conditions arise. The food is super greasy, comes out super quick, and costs the right price.  The food tastes good, but really people, most things that are greasy are going to taste delicious.  You definitely get enough for the price you pay as well.  Service is hit or miss.  The restaurant is set up so you can actually grab your own extra silverware, condiments, or napkins if needed.  Despite the closeness of the waitress, she pretty much takes your order, brings food and drinks, and then throws your check on the table and that's the end of that.  You don't go here for the service though.  It is midnight on a Tuesday night and you want scrambled eggs and waffles damnit.",
                "reviewer_id": "7JQ8n15WeW4D5AnNulQOCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011606540853699632,
                    "positive_probability": 0.998839345914627
                },
                "stars": 4
            },
            {
                "review": "The second Merry Ann's. It gets crowded here when drunken people come out of downtown Champaign's bars, but outside of that it's easy to grab a seat. I think I'm addicted to the cheeseburgers here. Also, the place is 24 hours.",
                "reviewer_id": "93R48Yo7_H8Q4V59oJZyRQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5486539040920144,
                    "positive_probability": 0.45134609590798463
                },
                "stars": 5
            },
            {
                "review": "I don't get the hype. The food isn't anything special. The price is a little high for the food you get. The ambient, well it's a diner. Somehow, my friends seem to love it. I feel like I only go here either after the bars or in the morning after a night out at the bars.",
                "reviewer_id": "9iRDAeoTW08yZgR0JaaOHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2816530290139409,
                    "positive_probability": 0.718346970986057
                },
                "stars": 2
            },
            {
                "review": "Very good food and service.Restaurant is in a excellent location to u of I games... Within walking distance to several shops",
                "reviewer_id": "_KZvI93jlWNJeJEtH0jZyw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.057263145165487556,
                    "positive_probability": 0.9427368548345109
                },
                "stars": 4
            },
            {
                "review": "I've lived in CU for 8 years, visited both Merry-Ann's locations at least three times, and never had a decent bite of food. Skip it and go to McDonald's.",
                "reviewer_id": "BZjl6W41tc5E2wWyvJ23gQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35028168312845004,
                    "positive_probability": 0.6497183168715484
                },
                "stars": 1
            },
            {
                "review": "Just okay food. I can make better food at home for cheaper.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.551062124313983,
                    "positive_probability": 0.44893787568601684
                },
                "stars": 2
            },
            {
                "review": "Honestly, the food was probably 2-star quality, but I'm giving it 3 because it was late, and we were hungry, and it was open. That said, it was very generic quality breakfast/diner food, and while it satisfied my hunger, it didn't quite hit the spot.",
                "reviewer_id": "d_4nmvSVET24Y0IGzKFirw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.644216709151765,
                    "positive_probability": 0.3557832908482345
                },
                "stars": 3
            },
            {
                "review": "I went there once about 10am, sat down waited for 15 minutes, no one came, I left.I forgot to mention, I was the only customer there.",
                "reviewer_id": "FFsuViuxEt6rvWPyTMo02Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9852535248437648,
                    "positive_probability": 0.014746475156237055
                },
                "stars": 1
            },
            {
                "review": "This Merry Ann's is MUCH better than the one on Neil.  It is cleaner, nicer, and the staff is way friendlier.  They let you study as long as you want here, and even offer to plug in your computer behind the counter! The guy that works here at night is super nice and very attentive, and I just love that he wears those cheesy shirts with whales on them.  I have been here to study and get some late-night food several times. It just gets difficult once the post-bar crowd comes in around 2am.The chicken fingers and fries are good, especially because their honey mustard is delicious.  I've also had the hamburger with fries, which was fine also.  The prices are cheap so it's nothing fancy.  I've never been here post-night of drinking, but I'm sure it would be amazing at 3am after 6 PBRs.",
                "reviewer_id": "FVOhtMCxbqm_9riDcVmmVw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002590511524398485,
                    "positive_probability": 0.9974094884755998
                },
                "stars": 3
            },
            {
                "review": "I came here after an unfulfilling dinner at Big Grove Tavern.  We sat down for some fries and a slice of pie.  Everything was great, the pie was delicious, the fries were hot, and the service was prompt and friendly.  Everything was great, that is, until I start hearing noises behind me.  I assume someone is dragging a chair across the floor.   I don't turn around, because it stopped soon enough.  Time passes and the sound starts up again. My S.O. starts looking a bit uncomfortable. I turn around, and no one is dragging a chair, but there is a man 2 booths away.  It was him.  Farting.  Having a fart-attack.  A super-extended fart-attack.Having quickly lost my appetite, we asked for the check, left the server a hefty tip, and skedaddled.  I can't really blame Merry-Ann's for this.  This is a place for everyone, farters included!  So if you want a cheap diner, this is your place, but be aware that this is a big world, and flatulence happens.",
                "reviewer_id": "gA0OMSf59WBNzoj48693ng",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9917613875791134,
                    "positive_probability": 0.008238612420888844
                },
                "stars": 3
            },
            {
                "review": "Pancakes were very salty, bacon was raw and they wouldn't discount our meal!  Even though the manager said she would discount the meal, it never happened even after we reminded them. We will not go back!",
                "reviewer_id": "HzzBITPaMjLLGF90ra_yvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09582507154831582,
                    "positive_probability": 0.904174928451682
                },
                "stars": 1
            },
            {
                "review": "I'm going to be completely honest here: the food at Merry Ann's really isn't that great at all... Nothing terrible, just mediocre diner food.So why four stars? - It's dirt cheap. Seriously. They have a fairly long menu and almost every item is under $5. Try to beat that.- It's open 24/7. Now that's unheard in downtown Champaign, where every other restaurant closes at around 11pm. So yeah... the chances are that I'll be back.",
                "reviewer_id": "igrgFZl9wDohSem0UyoP6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09481388347751551,
                    "positive_probability": 0.9051861165224857
                },
                "stars": 4
            },
            {
                "review": "If only I can remember what I order and keep it down. The only time I come here is after too many drinks... but however, I thank thee for being open!",
                "reviewer_id": "m8u49f6BQbnLBPujd6twaQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.30506147742778206,
                    "positive_probability": 0.6949385225722174
                },
                "stars": 4
            },
            {
                "review": "I'll admit that food-wise, Merry-Ann's certainly isn't worthy of four stars, but for me it's more about nostalgia.  We always used to go to the one on Kirby and Neil back during my U of I days, but now when my husband and I go to C-U we'll occasionally go here for breakfast.  Their breakfast fare is actually pretty decent and insanely cheap.  Everything else is pretty much meh.  Typical diner fare.  Milkshakes are super yummy, though.There can often be a wait on the weekends particularly during home football game weekends, but it's never very long at all (and I suspect there's probably a wait at most other places, too).  There's a parking lot adjacent to the building which is convenient--and there's easy access to 74.",
                "reviewer_id": "mZsGU471CBa3W1Ymj85oSg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4176506022276512,
                    "positive_probability": 0.5823493977723522
                },
                "stars": 4
            },
            {
                "review": "Service is great. Food is average for a diner. Coffee is poor. The scrambled eggs are surprisingly bad- do they use real eggs or Sysco refrigerated liquid egg product? Next time I go, I'll be watching. Or hammered.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3703941747362744,
                    "positive_probability": 0.6296058252637233
                },
                "stars": 3
            },
            {
                "review": "Had a bad experience at the Merry Ann's on Neil Street but I thought I'd try this location.  The service was prompt and friendly.  The menu was rather limited.  The coffee was drinkable.  Ordered the Cheese and Mushroom Omelet.  Good portion but the cheese tasted processed and the mushrooms tasted canned.  The hash browns were good and the side of bacon was done to perfection.",
                "reviewer_id": "OZCzq4BvNGdTpBE2iUg0Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3300625404505554,
                    "positive_probability": 0.6699374595494395
                },
                "stars": 3
            },
            {
                "review": "After having a horrible experience at the other Merry-Ann's Diner during the winter we decided to try our luck at the downtown Merry-Ann's a couple of weeks ago...and wish that we wouldn't have because we were again disappointed. We walked into the diner to find that we were the only customers, which should mean that we would have great customer service...our waitress was one of the worst we have ever had. We only saw two people working in the diner and one of them spent the majority of our meal time scrubbing the floor...mind you just scrubbing it and bringing up all of the dirt and scum, not actually mopping it off (that part of the process must have happened after we left)...the entire floor area behind the counter and by the cooking area was covered in a black/brown mud/scum/dirt mixture which made for a very unappetizing eating experience. My husband ordered a double cheese burger with bacon and fries....he was brought two single cheese burgers with no bacon to be found. The waitress placed our food on the table and then disappeared to the back, so we were unable to complain or get the order corrected. I ordered a plain malted waffle....it was a waffle, waffles are good and pretty hard to mess-up...so, overall, my food was good, but I would never be able to refer to it as great. Prices are reasonable, but the lack of customer service and waitresses who are unable to take orders correctly ensures that we will never be going to Merry-Ann's Diner again. We have tried both of them and were deeply disappointed with our experiences.",
                "reviewer_id": "p5QIAR4nshID89WvPCs0iQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0002664087075054923,
                    "positive_probability": 0.9997335912924765
                },
                "stars": 1
            },
            {
                "review": "The food is clearly average generic diner fare, but the staff are super friendly.  Especially Maria from Zacatecas.  I go here to practice my Spanish, get a great cup of coffee and pretend I'm in California on occasion.And don't tell anyone else--but I sometimes get hashbrowns with country gravy, transfats be damned. :)",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29315140871362977,
                    "positive_probability": 0.7068485912863695
                },
                "stars": 4
            },
            {
                "review": "What a travesty that this is the only place to get late night food around downtown Champaign!!! Even when I've stumbled in hammered at 2 am I thought the food sucked... now that's saying something! Unfortunately, this is the only place to get some sober-me-up food after a long night of drinking at dt Champaign so I'm going to undoubtedly return at some point. But I do have to say that I will never get that nasty corned beef hash again...",
                "reviewer_id": "UO5eCeTNpnUekttaryBCNw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9986485927708858,
                    "positive_probability": 0.0013514072291194515
                },
                "stars": 2
            },
            {
                "review": "If I may be so bold as to say this, Merry Ann's is a celebration of everything that is good about life.  The only downside is that in this case, too much of a good thing could possibly lead to atherosclerosis or some equally undesirable cholesterol condition.  Who can not honestly say they don't harbor a soft spot for those 24 hour diners, whose men and women work tirelessly throughout the night in order to provide us, the host inebriated, with industrial strength coffee and omelets at two in the morning?The food at Merry Ann's, if you've never been, is pretty standard for diners.  Breakfast served all day, so you can get pancakes with the folks on Sunday morning, or pancakes at 4:47 in the morning after your friends push you in a shopping cart to the front door of this imperial majesty.  I was originally planning on giving them three stars, but Merry Ann's got an extra star from me for their bacon preparation technique.  Most places hand you burnt, crispy bacon-- Merry Ann's gives you greasy bacon still glistening with fat, fresh off the fryer.  The only way to eat bacon.  The aforementioned pancakes are a tasty deal too.  They're fluffy enough, and the taste can be drown in one of the three fine syrup offerings located at your booth.  Service is fast, friendly, and always ready to fill up your coffee.  And if you're at Merry Ann's, you will probably appreciate that.So overall, Merry Ann's is cheap, delicious, and convenient.  Located in proximity to the downtown Champaign bars, you will always have a place to sober up for a few hours.  Champaign suffers from a dearth of 24 hour diners in my opinion.  I refuse, out of principle, to go to the Campustown IHOP.  Even if the stories I've heard about the place aren't true, drunk undergrads still sounds pretty terrible to me.  I miss the spots like Denny's and Norm's... but I feel like Merry Ann's does its duty, and does it well.Keep on keeping on, Merry Ann's Diner.",
                "reviewer_id": "V53QZcbK1G9egSfqkL9HMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.264525268980497,
                    "positive_probability": 0.7354747310195072
                },
                "stars": 4
            },
            {
                "review": "Well, this is more of a 2am type place but heck why not try it at 5pm!  Well we were the only people in the place but!  I ordered a Veggie Burger that was just delightful for a dinner!  It was a huge patty pouring out of the bun!  Threw some Ketchup on it and was completely satisfied for the evening a head of me!  I bet this would have tasted even better at 2 am after some drinks!  This place is open 24 hours a day and is set up perfectly like an old dinner from the 50's or 60's! The staff was very polite and took very good care of us!  Like I said we were the only ones in there but they could have ignored our empty glasses of water but they did not!  They treated us like Dinner KINGS!  Probably the cheapest place to eat in downtown Champaign for sure and it was great!",
                "reviewer_id": "vlWwsOG5fL8byQRZ7IIBZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.042356231125003356,
                    "positive_probability": 0.9576437688749913
                },
                "stars": 4
            },
            {
                "review": "Merry-Ann's is one of my Champaign memories. We used to drive to Champaign to visit some of the bars. One occasion, I was taken to Merry-Ann's afterwords. Very busy when the bars closed, but oh so yummy. They have a haystack with: hash browns, sausage, gravy, eggs and other stuff I believe. Ad a chocolate milk on the side and it is a drunk boys heaven.",
                "reviewer_id": "YtNqutU6Quapds3WZHBCCA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7908026710758458,
                    "positive_probability": 0.2091973289241524
                },
                "stars": 5
            },
            {
                "review": "Cute little diner, open when you need it to be open (after the bars close).  The food was pretty cheap in my opinion (burger and fries for $5.15).  And if you order one of the breakfast combos, you can switch regular toast for french toast!  If I hadn't already been set on ordering a burger, I would have been all over that, since french toast is my favorite breakfast food.  And they were quick with the food- like under 10 minutes from the time we ordered to the food being put on the table, and we had 5 people in our group.  And you can see the cooks, and how they handle your food- it's all out in the open.I will definitely be back.",
                "reviewer_id": "YW_iT5vBAFJUepWGQCo62Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9572932277807075,
                    "positive_probability": 0.042706772219295856
                },
                "stars": 4
            },
            {
                "review": "This place is big nasty.  NASTY!  Perkins isn't much better.  Just go to any of the downtown Champaign bars, most of them serve food until pretty late and you won't get food poisoning - big plus!",
                "reviewer_id": "zkRH-NOAdIjJjU2ASeXZ1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4604105105968163,
                    "positive_probability": 0.5395894894031819
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "oL91dKGJxL7F1u9X-QKXiw",
            "vBg5V39Vf4eTx1JVgl_5Pg",
            "2UAbUSTMsR9G26A8AYO3dA",
            "8diLGO9WGVQWr05FWZ_yTw",
            "VI-zVIlK11AUz47mro8nMA",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "Fb3Pl0PO_ojEyChkM_SApA",
            "6AHfkdtpx7yLOFetI38gHQ",
            "KGGYlneCtF4xQT9T5eKV5g",
            "O_HxmcRtxdJluerS2RYqtA"
        ]
    }
}