{
    "ufOY2lQHDgSvou3YLT8gHA": {
        "keywords": {
            "bigrams": [
                "bar_food",
                "downtown_urbana",
                "dive_bar",
                "cheap_drinks",
                "slot_machines",
                "fish_sandwich",
                "come_back",
                "blown_away",
                "place_packed",
                "lettuce_tomato"
            ],
            "unigrams": [
                "bar",
                "place",
                "food",
                "bunny",
                "cheap",
                "good",
                "great",
                "urbana",
                "beer",
                "sandwich"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "full_bar",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Coat Check": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Dancing": false,
                "Good For Groups": true,
                "Good for Kids": false,
                "Happy Hour": false,
                "Has TV": true,
                "Music": {},
                "Noise Level": "loud",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wi-Fi": "free"
            },
            "business_id": "ufOY2lQHDgSvou3YLT8gHA",
            "categories": [
                "Dive Bars",
                "Bars",
                "American (Traditional)",
                "Nightlife",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "119 W Water St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "02:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "02:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1132,
            "longitude": -88.208287,
            "name": "Bunny's Tavern",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/DClgeb3_P4eO2BrDk7N_YA/ms.jpg",
            "review_count": 28,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The beer is cheap. Cheap drinks and great food! This bar  also will have live local music frequently Looking for a fun hole in the wall dive bar in Urbana? ",
        "reviews": [
            {
                "review": "I had the Italian beef and fries it was awesome! Prices are great and portions are large. Great value!",
                "reviewer_id": "2d6bYq_7cfi8zp0lswZjOQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5930091235829626,
                    "positive_probability": 0.4069908764170363
                },
                "stars": 4
            },
            {
                "review": "Right next door to downtown Urbana is Bunny's: the most unrated bar in Urbana. They've got the cheap drinks and food, the outdoor patio and lack of scenesters. Thank God!With the smoking ban in place, this small time bar is probably struggling for business. Stop in and have a few drinks... drop a few quarters in the jukebox and tip your bartenders.",
                "reviewer_id": "7zSppEZd2C6ASpNeBebxAA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2964435353343352,
                    "positive_probability": 0.703556464665669
                },
                "stars": 4
            },
            {
                "review": "Bunny's is great. Cheap, quick food, I'm there anywhere from 3-5 times a week, always calling to find out the daily special and the soup of the day. I always get take-out (as I work less the 2 minutes walk away) and it's always ready within 5-8 minutes. Their homemade soups are always top notch. Their heated patio was key during the winter months, but now it's just great outdoor seating. The staff is all very friendly. Make sure to check it out, and get a bucket of beers!",
                "reviewer_id": "9FOYCNxxGDlBRfAgK3IB7A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03469263995650762,
                    "positive_probability": 0.9653073600434918
                },
                "stars": 5
            },
            {
                "review": "If you look at my reviews, you'll see that I hold a special place in my heart for dive bars. And, actually, Bunny's is really nice and clean for a dive bar. They have specials for food every day. While it's standard bar food, there are the delicious Bosco sticks--warm breadsticks filled with hot melty cheese. The beer is cheap. Most of the fun, for me, is people watching. There are lots of locals, and they are all hilarious. My favorite experience was learning video poker from three kindly gentlemen. Plus, it's close to Black Dog. Perfect place to go after you're stuffed with barbecue.",
                "reviewer_id": "_hz_dF3yYAUdbD8rwqbVPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03331650237469288,
                    "positive_probability": 0.9666834976253128
                },
                "stars": 5
            },
            {
                "review": "A decent spot in downtown Urbana.  Old tables, low and high tops scattered around.  A bar filled with locals and a beer garden that will have some cover bands every once in a while.  The bar is nothing special, just the regular stuff you would expect from a dive.Lots of sandwiches on the menu that are good, not great.  Pork tenderloin, Italian Beef, a burger, and a steak sandwich.  There are also daily specials, like a shark or walleye sandwich on Fridays that might be the most interesting fish sandwich in Chambana.  The place will get packed for lunch, but the service is on top of everything.  Always an enjoyable spot when I meet my Aunt here for lunch.  Though nothing to go out of your way for.",
                "reviewer_id": "aF4FWUbU0Tq6jH0FZKSQlw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9212105636502911,
                    "positive_probability": 0.07878943634971021
                },
                "stars": 3
            },
            {
                "review": "Yay  Bunny's  friendly staff, and a heated patio,  what a relief for winter months when you still want to sit outside  and have a conversation, regulars frequent this bar and they generally have the best people show up close to closing time.  I have only had the grilled cheese so far  but it is the best around!    This bar  also will have live local music frequently",
                "reviewer_id": "CJKc1_t8c6KQGSIhqC-pSQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29024680863471614,
                    "positive_probability": 0.7097531913652877
                },
                "stars": 4
            },
            {
                "review": "Best Lunch in Town!  The Walleye on Friday's is awesome.  The historical photos on the walls are cool too.  And of course, Guinness.  What else do you need?",
                "reviewer_id": "d1I7WgowWgblUJ9uWgRn6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.41377173539970835,
                    "positive_probability": 0.5862282646002929
                },
                "stars": 4
            },
            {
                "review": "We come here on occasion anytime we're in the mood for cheap food and drinks. I always recommend it when people complain that Urbana restaurants are expensive. Bunny's is super cheap and always has great specials. The past two weekends, they've even had live entertainment! While the food is just typical bar food and they stop serving most of the menu rather early, it's nice to know that it's available. Their beer selection isn't great. They have six taps, and 5 have some variety of mass produced light lager with one serving guinness. They do have more variety in bottles. The past couple of weekends, they've had fat tire and sierra nevada pale ale in bottles but that's probably going to be the most variety you'll find there.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0020774838437306784,
                    "positive_probability": 0.9979225161562658
                },
                "stars": 3
            },
            {
                "review": "I love this place. It's cozy, the food is cheap and tasty bar food. Perfect if you are craving cheap drinks and fried things.",
                "reviewer_id": "f_S4zZc7_azOf0MKEbcBFg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6408826507596573,
                    "positive_probability": 0.359117349240343
                },
                "stars": 4
            },
            {
                "review": "Bunny's is a classic town dive bar. Nothing too special to talk about here. Dont sit outside unless you want to enjoy some second-hand smoke. Menu is what you would expect with classic bar food. Their fries are actually quite good (thicker then 'classic' fries but thinner then a wedge) and their friday fried walleye sandwich is a reason to come back. Prices were very good (I paid 5.50 for sandwich).Overall, their food is solid but you need to enjoy the the sub-par atmosphere and wait staff in order to pick it over a place like Crane Alley",
                "reviewer_id": "GLS1EKLFw81n-3ogxZ_m-w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8360670479034478,
                    "positive_probability": 0.16393295209656042
                },
                "stars": 3
            },
            {
                "review": "Dive right in! It's my favorite dive in Urbana but since Gremer is gone it's not quite the same. Had to move westward to the other side of the tracks to see my favorite bartender.",
                "reviewer_id": "GPY2xy99Omc4TfbQwyAceg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23873356871351156,
                    "positive_probability": 0.7612664312864864
                },
                "stars": 2
            },
            {
                "review": "This is a nice townie dive bar in the middle of Urbana, sort of hidden away.  Lunch is cheap, beers are cheap, and the service is friendly.  Great place to have a beer on a normal weeknight or early weekend evening.That said, don't bring a woman on a weekend night.  Unless you want them to be disrespected, have their ass pinched, etc.  The crowd here moves toward the sleezy side at some point on weekend nights.",
                "reviewer_id": "IXFGCmgnB8YY-jtPCaNYeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2944657074651484,
                    "positive_probability": 0.7055342925348558
                },
                "stars": 4
            },
            {
                "review": "Ah Bunny's, the land of cheap booze, comfy bar stools, friendly patrons, and most importantly, clean bathrooms.  It's never overrun with students (because most don't know that it exists), and they have heaters on the patio so you can even enjoy fresh air when it's cold out.Plus, where else can you knock one back with your local law enforcement?",
                "reviewer_id": "jFB4m2Na8fTIhc3TAYoeYw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25281364189691236,
                    "positive_probability": 0.7471863581030843
                },
                "stars": 4
            },
            {
                "review": "Greasy bar food at it's finest. I was craving nachos. They didn't have them. It was a sad day, but I got another greasy meal in place of my much desired nachos. The food was fine, prices, were awesome, seating was scary. Asses to elbows. We couldn't move without accidentally feeling someone up or getting ourselves violated. Small price to pay for a quick lunch.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18078032825446663,
                    "positive_probability": 0.8192196717455309
                },
                "stars": 3
            },
            {
                "review": "They have AMAZING burgers!! For a bar I'd say the food is a little more then average! However... The staff...sucks! So rude! Its a place they have a lot of regulars but when someone like myself walk in they act as if you don't exist! If you don't care about poor service this is the place for you!",
                "reviewer_id": "jv-KI5l6q6WKwWP4PhMG2A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8740701186212863,
                    "positive_probability": 0.12592988137871383
                },
                "stars": 2
            },
            {
                "review": "Very good chili cheese dog, especially the chili. Service was ok, for a Saturday afternoon. I will come back and try some more.",
                "reviewer_id": "lDg_yaShiGMT6K7fWFVAaQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3060201584418789,
                    "positive_probability": 0.6939798415581221
                },
                "stars": 4
            },
            {
                "review": "First i got some wings cause i am addicted to hot wings.  They were not the very best i have had but they were good.  The wings were nice and meaty with the right amount of sauce.  My double bacon cheeseburger was very good but they were frozen patties just cooked on the grill.  I got deep fried mushrooms instead of fries which were cooked very well but kind of small.  The \"bloody gary\" was excellent but expensive for just one cause it had alot of ice in the glass.  Its called a bloody gary because its garys recipe.  The drink has beef broth in it which gives it a different taste.  Overall i enjoyed the meal but kind of expensive.  They need to clean up the outdoor eating area by remodeling some things but nice to have an area that big.",
                "reviewer_id": "MSXniNUBguYT2TzbASGlCg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.441483160540924,
                    "positive_probability": 0.5585168394590857
                },
                "stars": 4
            },
            {
                "review": "On the west wall between the bar and the bathrooms (before you enter the hall) is a framed handwritten letter from Hugh Hefner thanking Bunny's for all the fun times he had there and acknowledging it is the inspiration for the Playboy Bunny. I dunno about you, but I think that's pretty cool.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4755806270445073,
                    "positive_probability": 0.5244193729554907
                },
                "stars": 5
            },
            {
                "review": "Bunny's is a weekly spot for me for lunch.  The lunch fare is very reasonably priced, the place is packed but quick, and the help is very friendly and accomodating.  Their cheesburger might be the best in town, under 5 bucks and you can load it up with lettuce, tomato and the usual condiments, including a pickle slice. Hidden off of Main Street, it has a collection of regulars on the bar stools drinking beer, but I would not hesitate to bring a child or senior citizen in for a sandwich.  One TV is likely to have a Cubs game playing and the other TV might have CNN.  This is a hangout for courthouse employees and City of Urbana staff, as well as the crowd that works in downtown Urbana.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13674404372884233,
                    "positive_probability": 0.8632559562711596
                },
                "stars": 3
            },
            {
                "review": "Looking for a fun hole in the wall dive bar in Urbana? Who isn't, right? Well this is your place. Come here to see some of the older populations obsess over the slot machines here because I guess it is legal to have slot machines! Some of these people literally sat there for over an hour straight since that's how long we were there and they were there until even after we left! Just sitting in those chairs, pulling the lever, over and over and over again...Quite the people watching place if you ask me which I love.The drinks are cheap here, they have a big outdoor patio and BBQ they use in the warmer months which seems fun, and it is definitely a laid back atmosphere where clearly no one really cares about anything. A mix of different types of people, and granted we were there on a weekday night on one of the coldest nights of winter, and this place still had people in it, so that should say something about this charm of a dive bar for sure!",
                "reviewer_id": "Qe_1COeOqBrCQ4IhLw9Glw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1782989101918841,
                    "positive_probability": 0.8217010898081101
                },
                "stars": 3
            },
            {
                "review": "A very cute old fashioned bar in downtown Urbana. I love sitting outside with my boyfriend and just putting back a few beers.  They also have really good burgers and they have the toppings as self serve which I personally really enjoy.They also have slot machines and other gabeling machines. I'm not very good at them but I still enjoy trying to play them.",
                "reviewer_id": "qND0y_3FE2MIRkwocUBu_A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0738979781409171,
                    "positive_probability": 0.9261020218590804
                },
                "stars": 5
            },
            {
                "review": "Cheap drinks, a melting pot of patrons, and the best deep fryer in town -- what's not to like?",
                "reviewer_id": "Ujrg8-TO4r55Yh8QkC0DEQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6528537916595435,
                    "positive_probability": 0.34714620834045856
                },
                "stars": 4
            },
            {
                "review": "Cheap drinks and great food!  The bosco sticks are a must have!  The bartenders are friendly and they remember your face.",
                "reviewer_id": "uPjjcNgxbUK3otgj5X42zA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7464125475842498,
                    "positive_probability": 0.25358745241575165
                },
                "stars": 5
            },
            {
                "review": "Love this place! Great pizza & cheap PBR on tap. Ladies room is always clean and nicely kept. We are here regularly & always have great service.",
                "reviewer_id": "vcQfQJo3vdbCBeqeqo5rUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09975888354293061,
                    "positive_probability": 0.9002411164570671
                },
                "stars": 5
            },
            {
                "review": "I can't believe that I have lived here all of my life and I have just recently gone here to eat.  It's a bar with bar food but on a somewhat better scale.  I had the fish sandwich which is about the same as any other fish sandwich.  I was not blown away by it by any means.  But I was however blown away by their chili!!!  I have never had chili that I can honestly say is as good if not better than mine.  Since I have only been here twice I am not sure if it was better than usual for some reason but I can say it was pretty darn good chili!The chips they serve with the fish sandwich are bland and tasteless.  The cole slaw has horseradish in it.  Some people in my group loved it while others did not. Me included.  Someone tried the shark and they thought it was good.  I don't think I would go out of my way to eat here but with a group and the boss paying then heck yes I would go back.",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8692098063222489,
                    "positive_probability": 0.13079019367774236
                },
                "stars": 3
            },
            {
                "review": "I eat lunch at Bunny's at least once a week.  Bunny's has the best burgers in Champaign County without a doubt. The one I get is called the Broadway Burger, double meat, and all I have to say is \"Swiss\", \"Cheddar\", or \"American\". It comes with a bag of chips so if you want fries you have to order them but this burger doesn't need fries, Load up the burger at the condiment rack with lettuce, tomato, onions, pickles, whatever, and you have the best burger around. I know, I've eaten a burger at just about every place in all of Champaign County, and this is the best.",
                "reviewer_id": "X1df_uFxGpD3DRpsYOHhaA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8193266088160087,
                    "positive_probability": 0.1806733911839939
                },
                "stars": 4
            },
            {
                "review": "We decided to take a trip off campus to downtown Urbana for a Friday night out after one of our favorite spots on campus was much too crowded.A friend has been to Bunny's before and suggested it might be a good option for a quieter, cheaper night out. The inside was nicer than I expected for a tavern, so that was a pleasant surprise. Lots of locals inside, I think we were the only students there. They have slot machines which I elected to try and lost $3.They have a decent selection of bottled beer, but only a few common ones on tap, Guinness included so I was happy to be able to get one of those.The bartender seemed nice, although I don't think he knew how to properly pour a Guinness. Not a big deal.I didn't feel that Bunny's was by any means inexpensive though, at least for me. Both of my beers were $4.50, my friends Jim Beam and coke was $3.50. The campus bars are probably cheaper though if you're really just looking to save $.Overall an A-OK experience, I'd come back again and would like to try the food.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7531479484766865,
                    "positive_probability": 0.2468520515233056
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "27q7XsLrKPNwr8i5RcCOvQ",
            "RSk-BYX8s5027cKo_aELrw",
            "-0GkcDiIgVm0XzDZC8RFOg",
            "rm2OnyNDnlWkSNUSxETsGg",
            "l8B35OwrDUQTg5ojQu0tEA",
            "9p3O_KoH3muITR-9WgrSnA",
            "1T2rnvl67Gk9Uc0gzsCKQA",
            "Aln3dngHMyG6OyPBe7fucw",
            "05FJCAvUFOAk8B_nIOqt7A",
            "MVH3JOKpQvMTP4jxwBUhkA"
        ]
    }
}