{
    "1d5XAAH39FKenV3_9gcFIw": {
        "keywords": {
            "bigrams": [
                "steak_shake",
                "late_night",
                "cleaning_table",
                "beat_prices",
                "food_places",
                "food_shakes",
                "love_steak",
                "take_order",
                "fast_food",
                "burger_place"
            ],
            "unigrams": [
                "food",
                "steak",
                "shake",
                "place",
                "shakes",
                "table",
                "chili",
                "service",
                "burger",
                "server"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": true,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": true,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "1d5XAAH39FKenV3_9gcFIw",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1709 S Neil St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "00:00"
                }
            },
            "latitude": 40.0950526,
            "longitude": -88.2452533,
            "name": "Steak 'n Shake",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/_DDperv1z_wNLfR2r7P59A/ms.jpg",
            "review_count": 27,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Unfortunately, this particular steak n shake can't make a good milkshake. I love the food and shakes. So don't order the chili from this Steak n Shake. ",
        "reviews": [
            {
                "review": "This was my first stop on my \"back home in Champaign so have to hit all my favorite food places\" tour.  I love Steak n Shake, so much that I have to get it at least once every time I'm in town.  Sadly, they don't have one within 1000 miles of Phoenix yet.The food is great, especially the double steakburger (instead of ham, they call it steak you see) platter special that also includes a generous helping of shoestring fries and cup of delicious chili (some of the best around!) To make it better, both me and my grandma ate for under $10... which is cheaper than a lot of bad fast food places.I'm not a big milkshake person, but everyone I know loves them here as well.  Took off one star because the tomato was kind of bad and my waitress was grumpy... but the food is always great!",
                "reviewer_id": "15cUUq1KnmjYOPoEbbydqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011182806982177366,
                    "positive_probability": 0.9988817193017825
                },
                "stars": 4
            },
            {
                "review": "You can't beat the prices here, but the place is always crowded. And the service was just AWFUL",
                "reviewer_id": "17f0wrjVsBh7TR-PsU6hjA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20801392099849503,
                    "positive_probability": 0.7919860790015042
                },
                "stars": 2
            },
            {
                "review": "wow, the mint oreo milkshake, the apple/cranberry salad, and the chili mac blew my mind. My boyfriend and I shared all three and it was the perfect amount of food. I wish there was a steak n' shake in California!!Our server was extremely helpful and prompt. We were in and out within 45 minutes, and it did not take long for the food to come.",
                "reviewer_id": "2g4y_xXf_tddha1oS8TcTg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004221922020054147,
                    "positive_probability": 0.9957780779799437
                },
                "stars": 5
            },
            {
                "review": "I've been here on several occasions. Like most Steak 'n Shakes, the food is below average to average. The service is on par with the food. What strikes me as odd is the way there is always a huge kitchen staff but the wait staff can be so slow at time. It makes me wonder how much more efficient could be. Usually, it's really difficult to flag down a server to get another drink or to even take your order. Even after your order is placed, it can take up to 20-25 minutes for the food and drinks to come out. On top of that, it feels cramped in the place. I'm not a huge fan and will only go when others want to go, but even the food isn't great. I'd prefer a burger from Zelma's or Wendy's or Chili's over Steak 'n Shake.",
                "reviewer_id": "3tqlK4acUbM5Kgnk1h5DRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007485647496227197,
                    "positive_probability": 0.992514352503779
                },
                "stars": 2
            },
            {
                "review": "Waitress took forever to take our order. Party of 8. Waitress stood only at one end of the table, giving the people closest to her the orders to pass down to the others even though she could've easily walked to the other side of the table. Food itself was surprisingly good. Restaurant was dirty all over-nasty & gross. My younger guy refused to sit in the chair because it was so dirty. I had to wipe it off. Thank God for Clorox wipes! Waitress mopped the floor while we were eating leaving s strange chemical smell in the air again while we were eating. Then she put a \"wet floor\" sign behind a man sitting in s wheelchair, blocking him from being able to get out. The person with him had to get up and move it. Plus milkshakes took longer to get than the food itself!",
                "reviewer_id": "5_svW8GK-7zVU9zhcqHHuw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02499163214403849,
                    "positive_probability": 0.975008367855956
                },
                "stars": 1
            },
            {
                "review": "Really felt bad for my server.  He seemed to be the only competent person in the whole place.  Manager let this server walk around with his iPod shuffle and headphones plugged in.  He kept pausing his music so he could take orders, and he never took the earphones out.  The locals who appear to be most of the patrons here are first class middle Illinois people.  Pretty much the epitome of all things you'd expect from hillbillies.  Food was quick, cheap, but the staff (aside from my server) was well beyond incompetent.  I felt REALLY bad for the other tables who had to wait seven minutes before the server came to their tables.  Anyway!  Steak and shake food is still awesome, and awesomely cheap. Kudos to the \"chef!\"",
                "reviewer_id": "5hCyiu3vy6O1kQNcmBcCjA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.24247867077225604,
                    "positive_probability": 0.7575213292277377
                },
                "stars": 4
            },
            {
                "review": "Boyfriend & I got 2 meals for $11.That's about all I can say about this place. The food is basically fast food diner style. I probably would only go here if I wanted to be waited on. Or if I was 16 and wanted to go on a date (there were several cute little couples here, on Valentines day!).",
                "reviewer_id": "67KYMQXVpzdk0UKC0XOpCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21351746185596554,
                    "positive_probability": 0.7864825381440367
                },
                "stars": 2
            },
            {
                "review": "Growing up in the home town of Steak N Shake, I've got high standards. This location doesn't come close. The staff had always been fairly helpful (I always do takeout) but the food is so poor! Frisco Melt is always more bread, less meat, cheese and sauce. Huge let down. Fries are always kind of soggy. Shakes a little un-mixed.",
                "reviewer_id": "7F6tjYlUwgoc2E41WWIGmg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4792087072343572,
                    "positive_probability": 0.520791292765644
                },
                "stars": 2
            },
            {
                "review": "Normally I don't frequent Steak N Shake, but I do like their chili on occasion. The last three times I have gotten it a little later at night (anywhere from 8pm-midnight), it is nothing more than flavored water. The later it gets, the more watered down it seems to be. Last week I got a bowl of broth with maybe 20 beans and 6 chunks of beef. Tonight I ended up with a Western BBQ Double when I ordered a double with pickle and mustard.Quality control is obviously an issue that needs to be dealt with at this location. To be fair, the manager I just spoke to was super nice, took my name and informed me if I come back she will put me down for a free burger (the one I wanted), a bowl of chili and a milkshake. This was really going above and beyond on her end and it was appreciated that she listened to me without interruption while I told her my two experiences and apologized. If she has the power and ability, I believe she will make some changes for the better. It's worth another try anyway; so maybe an update to my post is in my future if they actually give me good service.",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5118891607533477,
                    "positive_probability": 0.4881108392466457
                },
                "stars": 3
            },
            {
                "review": "Went to this location today and let me start to say the Manager was great, greeting us at the door and said let us clean off a table for you.Then as they were cleaning the table 2 people walked in and were seated at our table. So we just sat by the door. And another waitress said what do you guys need. We said the manager was cleaning off a table but it just got given away. She said oh you want a table! And instead of cleaning a table that was just vacated she tried to sit us at a table that was left open to allow for wheelchair at next table to have room.The Waitress was VERY RUDE! So we left! I will never come to this location again!",
                "reviewer_id": "BcZ97MTsYZiec0nhmp2B_Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9941793914569907,
                    "positive_probability": 0.005820608543004807
                },
                "stars": 1
            },
            {
                "review": "Ok, I'm only gonna comment about the service not the food cause I mean, can't expect too much from a chain restaurant.So, I went there with my roommate late at night to enjoy a late dinner. We waited at the front to get seated . . .  10 mins later, no \"hello\", no \"I'll be with you in a moment\", no getting seated. litlerally standing there getting ignored.we choose to sit our selves, looked throught the menu, waited another 5 ~ 10 mins, NO ONE to even say \"hi\" or serve us water.We then, choose to just order to go, so we waited at the front of the register. . .  5 ~10 mins, we make eye contact, but NO ONE to taking our order.I mean, it was 11pm at night and they weren't busy.So roommate and I got so upself, we choose to leave. As we were leaving, we passed by a man who went in the store. We see from the window, HE'S GETTING SEATED ASAP!!What is with this service! Never Every going there again!!",
                "reviewer_id": "bqXUCc9hfAdb8u4MUGhdLA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7653508375987633,
                    "positive_probability": 0.23464916240123165
                },
                "stars": 1
            },
            {
                "review": "I will avoid this place at all costs, but sometime it's the only thing open late at night.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2788001573237258,
                    "positive_probability": 0.7211998426762734
                },
                "stars": 1
            },
            {
                "review": "Awesome malts, shoestring french fries and burgers. Have to make a pilgrimage whenever I'm in town.",
                "reviewer_id": "byK_d9VKQoUv7SS1sYzz5A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3352582137457112,
                    "positive_probability": 0.6647417862542913
                },
                "stars": 5
            },
            {
                "review": "I'm a huge fan of Steak n Shake's happy hour which is from 2-4 am and pm on weekdays.  They have half price shakes and drinks, which is a really good deal.  Unfortunately, this particular steak n shake can't make a good milkshake.  They always taste odd here (too much syrup or poorly blended?).  I've been here at least 3 times, and they're always bad.  So, now to satisfy my cravings I tend to drive up to the prospect one.  The food, on the other hand, is usually about your average steak n shake fare, so long as you stay away from the shakes, you might enjoy your experience (but who really would want to go to steak n shake and not get a shake?).",
                "reviewer_id": "cSqolAOfIDsKu3tujDrHBw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9921780999300371,
                    "positive_probability": 0.007821900069953475
                },
                "stars": 2
            },
            {
                "review": "I love steak and shake. I loved it in SC (until the only one within a 70 mile radius closed) and I love it here. Where do you go when you're up late working on engineering homework and the cafes are closed but you need sustenance? Steak and shake! Where do you go after the bars when you're hungry but not quite drunk enough for merry ann's? Steak and shake! The food is a little more expensive, but it's tasty and the place is clean. The waiters are very friendly and accommodating. Also, if you go at the right time, you can see what not having a waffle house can do to a town (steak and shake kind of catches crazy people)! PS they will put hot fudge on your milkshake.. what else can a girl want?",
                "reviewer_id": "DJbX0XH6Kn3Nm5uo58lu9A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0059169376937102626,
                    "positive_probability": 0.9940830623062944
                },
                "stars": 4
            },
            {
                "review": "Unlike the other reviewer I have never tried their milkshake, so I can't comment on that. The burgers however, are really good, specially the mushroom special ones. To be more precise, I've tried both their \"Grilled Mushroom 'n' Onion Double Steakburger\" and their \"Portobello 'n' Swiss Steakburger\". In fact, this is my favourite burger place in town, which is conveniently located on the way to the Savoy 16 cinema. And it's kind of cool to get waiter service in a burger place.BTW the prices are reasonable. Not as \"Green street cheap\", but not too pricey either.",
                "reviewer_id": "I3qt_NaZfu3j5RfCQTiq4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07780802013855655,
                    "positive_probability": 0.922191979861439
                },
                "stars": 5
            },
            {
                "review": "I love the food and shakes. The half price happy hour cannot be matched and the new breakfast options are decent as well. Can't beat the prices and quality and being open 24/7 is convenient.Cheddar burger and the southwest burger are delicious and every kind of shake is great.However this location suffers from bad service and incompetent employees. there is also a lock attached to one of the lights. Still good enough for 4 stars.",
                "reviewer_id": "IE6J-ZG0WY0Yx3w7EgFdRQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5766000133448027,
                    "positive_probability": 0.42339998665520434
                },
                "stars": 4
            },
            {
                "review": "Back in the 60's and early 70's this was \"the\" place to cruise when I lived in Champaign after reading the reviews It looks like the place has gone to crap.I used to love the chili 3 way and a steak burger,I stopped in at the Steak N shake in Memphis,Tn on the way to visit wife's relations it also sucked, flavor was mediocre and the portions undersized for the price and the car hops are gone.I was wanting to stop in when my 50th class reunion comes up next year in my '54 Ford just like old times,guess I'll stay in Phoenix and go to Culvers or Freddies.",
                "reviewer_id": "Ij82_DOUO_zqni57y20F-g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6304654018216298,
                    "positive_probability": 0.3695345981783635
                },
                "stars": 1
            },
            {
                "review": "My children love SNS so we have made several trips here.  Our service has always been pretty good.  We've only had a negative experience once, and our server brought it to the manager's attention without our asking which was nice.  The manager was very nice and apologetic over the length of time it took to receive a 3 stack of pancakes (60 mins). and comp'd our entire meal.  I don't know if anyone goes to SNS with high expectations, but it's always been average or slightly above for us.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02675596594061158,
                    "positive_probability": 0.9732440340593932
                },
                "stars": 4
            },
            {
                "review": "I went to this location for the first time in a long time because a friend and I were hungry and it was real late.  Kudos to any food establishment thats open 24/7 and they get a star for that in an of itself.  our server was friendly enough although it was kind of a long wait to be seated.  The place was packed with what I think was high school kids and they had like 2 people working the entire floor so I blame management on that.  aside from the fries and shake, the burger I got tasted like it had been in the microwave since vietnam, after having the beef shipped from Somalia.  It was a horrible sandwich and I felt sorry for the poor cow that had to give its life to be turned into whatever the hell they tried to serve me.  Its sad because I remembered liking steak n shakes food.  Maybe this was an off night for the cooks?",
                "reviewer_id": "MibR-2dhTV8AW9Rl62B6mQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7895715175071802,
                    "positive_probability": 0.2104284824928262
                },
                "stars": 3
            },
            {
                "review": "They screwed up my order at 4:50am on multiple accounts. Cheeseless cheeseburgers, fudgeless fudge shakes and cold fries. Not cool.",
                "reviewer_id": "s3p3db5ai1FZ2LFL20RXuw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33650872995412906,
                    "positive_probability": 0.6634912700458707
                },
                "stars": 2
            },
            {
                "review": "This is the only Steak 'N Shake I've ever been to, so I don't really know how to compare it to others.  I have never observed any heinous uncleanlinesses, despite the fact that the decor is primarily white and is lit by the most migraine-inducing possible flourescent lights.So, it gets 2 stars instead of 1 for being well kempt and having a waitstaff that is WAY more patient with late night hysterical student milkshake procurement than I could ever have imagined possible, but loses that third star because said milkshakes, once procured, taste like they have had 10 pumps of sugar syrup injected in and the frenchfries I ordered to go with said milkshakes tasted like they had been fried in grease that was maybe 36 hours past due to be replaced from the ol' fryer.",
                "reviewer_id": "sleEMt44E1StWrjz3mcujQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0003495099826195117,
                    "positive_probability": 0.9996504900173843
                },
                "stars": 2
            },
            {
                "review": "Probably the worst Steak 'n Shake I've been to.. The one by my house is amazing, however the food at the one in champaign is horrible. The lettuce in my taco salad wasn't cut up, the guacamole in our burger was super spicy, and the chili spaghetti was god awful.. We ate two bites and were done with it. Yeah, never going there again..",
                "reviewer_id": "uqGsutQ7RYF6EXl05z0epg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.821518198340173,
                    "positive_probability": 0.1784818016598245
                },
                "stars": 2
            },
            {
                "review": "The food is on-par with other Steak & Shakes in Central IL.  This review is not about the food.  Its about the service.  I would chose any other Steak & Shake in the area than this one.  They are always crowded, under-staffed and slow.  The seating is strange, too many 2 top tables that they don't use for 2 people...The wait staff seems to be overworked or under-managed most of the time.  Always waiting to be seated, waiting...for food or shakes, waiting to get the bill, waiting at the front to pay.  Its a pain in the neck and I LOVE the food so I deal with it, but I hate this particular restaurant.",
                "reviewer_id": "vNhHiztGh3yrcqvZ5Pk5AA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6983932802688148,
                    "positive_probability": 0.3016067197311892
                },
                "stars": 2
            },
            {
                "review": "The drive through is a little slow but that's not uncommon for around here.  I sometimes go through the drive through in the morning to grab some shooters for everyone at work.  We really like the bacon, egg and cheese shooters. They are little and make you think that you are eating less of an unhealthy breakfast sandwich.  So you feel pretty good about yourself to start the day.I noticed they had a taco salad for $3.99 on the menu and I just had to try it.  I really liked it.  It was the right size and price!!However, the chili here has a lot to be desired.  I have had chili at Steak n Shake before and it was OK but here it was gross.  It was really thick and chalky.  Like it was heated up many, many times.  So don't order the chili from this Steak n Shake.",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6391884456199037,
                    "positive_probability": 0.3608115543800921
                },
                "stars": 3
            },
            {
                "review": "This place us worth coming to just for the shakes. My favorite is the mocha shake. The servers at night are over-worked and the wait time for shakes can be long if you are in a big group. That being said the shake us worth the wait.",
                "reviewer_id": "xkOQUAqnU-u6qSj9pBtukA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27797946426779735,
                    "positive_probability": 0.7220205357322009
                },
                "stars": 3
            }
        ],
        "similar_restaurants": [
            "3AtlNePpVHC-D1a49LqFtA",
            "M2boe4Te0rQ5RasVJkPXng",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "9SFWEreW7wAXB3zYu28r_Q",
            "gY7617TMFGmPQR2A70L2vA"
        ]
    },
    "2g4mMfy5COvUlzZWfuQkKQ": {
        "keywords": {
            "bigrams": [
                "taco_bell",
                "taco_bells",
                "fast_food",
                "horrible_horrible",
                "lot_items",
                "jv_folders",
                "subpar_food",
                "biscuit_taco",
                "broken_tables",
                "specific_location"
            ],
            "unigrams": [
                "food",
                "taco",
                "bell",
                "drive",
                "location",
                "lot",
                "minutes",
                "order",
                "times",
                "cheese"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": true,
                    "lunch": false
                },
                "Good For Groups": false,
                "Good for Kids": false,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "2g4mMfy5COvUlzZWfuQkKQ",
            "categories": [
                "Fast Food",
                "Mexican",
                "Tex-Mex",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "1003 University\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "03:00",
                    "open": "07:00"
                },
                "Monday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Saturday": {
                    "close": "03:00",
                    "open": "07:00"
                },
                "Sunday": {
                    "close": "01:00",
                    "open": "07:00"
                },
                "Thursday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Tuesday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Wednesday": {
                    "close": "02:00",
                    "open": "07:00"
                }
            },
            "latitude": 40.11634,
            "longitude": -88.22085,
            "name": "Taco Bell",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/E75SS0FUgxdK08PrJE2Xzg/ms.jpg",
            "review_count": 16,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The food is Taco Bell - you know what you are getting. Have waited in the drive through for over 15 minutes multiple times. I was expecting an egg\" patty with some nacho cheese inside a stale \"biscuit\". \"",
        "reviews": [
            {
                "review": "Have waited in the drive through for over 15 minutes multiple times.  Would recommend going to one of the many other taco bells that are close",
                "reviewer_id": "2t79vv-IudhX2SOhb3fhPQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6648424393181772,
                    "positive_probability": 0.3351575606818248
                },
                "stars": 1
            },
            {
                "review": "First off, taco bell is a disgusting mockery to Mexican food. Also, a person at this location tried to write the numbers down on a woman's credit card. That's pretty messed up that your can't trust the employees here with your credit cards. If you have to eat here, at least use cash!",
                "reviewer_id": "44GzCA_7s9Xq3kzl2xD1TQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6799382576572929,
                    "positive_probability": 0.32006174234270285
                },
                "stars": 1
            },
            {
                "review": "Honestly, worst Taco Bell ever.I love Taco Bell.  Its delightfully campy and delicious in a $3 way.  The wait  at this specific location is outrageous.  Sometime 30 min + in the drive thru with 4 cars.  No trays inside so you have to put your food directly on the table, and then they want to talk to me about my hair. I don't want to chat with you about my hair, I want you to clean all the trays people have used so I don't have to eat off the table tops which I'm assuming have also not been cleaned properly.",
                "reviewer_id": "55UYpeF0R_dnQicWlJ9AEw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8516069956154587,
                    "positive_probability": 0.14839300438454822
                },
                "stars": 1
            },
            {
                "review": "Horrible horrible horrible horrible, nearly 40 minutes stuck in the drive-through. No apology when I got to the window. They just don't care. Possibly the worst drive through in the country.",
                "reviewer_id": "6ZTh_FXDQOeMlKdAoHG8EA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9776028216992085,
                    "positive_probability": 0.02239717830079206
                },
                "stars": 1
            },
            {
                "review": "This is a Taco Bell alright.I used to eat here every Sunday for a while when I lived in the dorms and the kitchen  was closed.  My standards were not terribly high, but I was never disappointed with the soft tacos or nachos.I've been back a few times lately.  If you grew up eating Taco Bell, sometimes the craving comes back.On this location:The side door area kind of smells like urine but it is right next to the bathroom.  I've never used the drive through so I can't comment.Going in the middle of the day on the weekend I have never had a problem.  The food is Taco Bell - you know what you are getting.  I am partial to the beefy crunch burrito right now.  It's a burrito!  With spicy Fritos on it!  There are days when that's what you want.One time I had a very disorganized order, and the lady working the register organized it into value meals to save me some money.  I really appreciated that.I usually get my food to go.  Last time they forgot one of the tacos, but when I mentioned it they immediately made it up for me.  Then I took 12 Fire sauce packets as usual and left to enjoy it.",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9380570751355618,
                    "positive_probability": 0.061942924864448065
                },
                "stars": 3
            },
            {
                "review": "I am reviewing this specific location and not the chain in general.  Really, do not waste your time going here and just go to another location for your Taco Bell needs.  As any TB frequenter knows, there are some of those visits during off peak hours where they have their JV folders on duty and the result is your food is just not put together well.  This location seems to only hire JV folders.  Another thing that is upsetting about this location is that their rate of getting orders correct is at best 1 in 4.  They constantly put beef on my bean burritos and put onions on the 7 layers.  If you enjoy interaction with crack heads, then this place is for you.  I have gotten harassed by other patrons who just yelled random comments at us, and this was during the day.  Also, one of the workers was definitely under the influence during one visit.  Just drive the extra 3 minutes and go to another location.",
                "reviewer_id": "cAsYfm9UkDFDjPRLR5zfWg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11084000592322249,
                    "positive_probability": 0.8891599940767807
                },
                "stars": 1
            },
            {
                "review": "I've been here way too many times now, and felt it was time to review.  The service here is generally just okay.  They often forget to give me my drink or Doritos, but fix it without any hassle when asked.  The food itself I've never had an issue with; always pretty good.  Location is pretty convenient, even more so now that the 22 Illini bus stops right out front. Up until about a week ago, they had a bunch of \"out of order tables\" (broken tables), but recently they installed new menus, removed broken tables, and removed the railing for the wait line, so it's looking a little better, but the restaurant still isn't in that great of condition.All-in-all, for being cheap and reliably good food, i'll give it 3 stars.",
                "reviewer_id": "cSqolAOfIDsKu3tujDrHBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35631800087369897,
                    "positive_probability": 0.6436819991262994
                },
                "stars": 3
            },
            {
                "review": "Just had the free biscuit taco that they were giving out today. What I got, far exceeded my expectations. I was expecting an \"egg\" patty with some nacho cheese inside a stale \"biscuit\". What I got was eggs that resembled real eggs in both taste and texture and cheese that also resembled real cheese in both taste and texture! What a surprise! The biscuit was soft and pillowy. Who'd a thunk.....edible biscuit taco?",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7280788104344669,
                    "positive_probability": 0.271921189565531
                },
                "stars": 3
            },
            {
                "review": "Restaurant review:There are so many mexican restaurants/fast food places to visit around the UIUC campus. I stopped by here on the weekend for lunch after work and was surprised there was no line. The cashier was quick to take my order after I figured out what I wanted and the food came out as I ordered without any issue. This is what pulls up the rating to 3 stars as the food has sharply declined from taco bell and is now a lot more expensive. Crunchy tacos are no longer 0.79 cents but 1.29 now. A lot of the other items have doritos, fritos, etc which is interesting, but it does not carry over to tasting good. All and all as fast food I think I will pass from eating at Taco bell now with the higher prices and subpar food items. The parking lot is also very small which is another issue. Pro: Large selection of fast mexican food, quick service, friendly cashiersCons: Subpar food, very small parking lotHidden gem:Happier hour 2 - 5 PM 1 dollar regular freeze or medium drink. Value menu, although a lot of items are no longer one dollar.",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31811142850659596,
                    "positive_probability": 0.6818885714933964
                },
                "stars": 3
            },
            {
                "review": "One of the most inspiring Mexicanesque meal journeys of my lifetime. The \"cheesy gordita crunch\" is an exquisite meal masterpiece. Incorporating the softness of a delicate flatbread, crunchiness of a handmade tortilla shell, and freshness of the \"carne,\" \"lechuga\", and \"queso\" call for two thumbs up and then some. Bravo Taco Bell, bravo. Authenticity has never been truer. Enrich your senses and appease your appetite in an expeditious manner while experiencing a meal of a lifetime. 5 stars. Period.",
                "reviewer_id": "lKqRJB4-uDuRtrdkO6KHgg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010545279159472043,
                    "positive_probability": 0.9894547208405294
                },
                "stars": 5
            },
            {
                "review": "Really don't get the negative reviews on here. Best Taco Bell I've ever been to. Best, friendliest employees, always accurate order, always perfect. Taco Bell, you have my heart.",
                "reviewer_id": "maO0KD6TJNusZt2ceZ1uvw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3603415199754327,
                    "positive_probability": 0.6396584800245683
                },
                "stars": 5
            },
            {
                "review": "Very very slow drive through. Waited way too long at the speaker.  Maybe about 15 minutes then decided it didn't work so I proceeded to exit the drive through.  Once you enter this drive through there is no way out.  I was blocked by a truck at the window for another 5 or 10 minutes.  So basically I spent at least 20 minutes in this drive through and did not get any food.  Which is OK with me but I was getting the food for my Mom who had a procedure done at Carle and was starved!!",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9883938361517631,
                    "positive_probability": 0.011606163848234315
                },
                "stars": 1
            },
            {
                "review": "I've been going here for 2 years now, I've never had a problem with them. Drive thru can be a bit slow, but their chicken burrito, grillers and quesadillas are hot and delicious, so worth the wait. Everyone's very courteous and I can see them working hard to make the food in the kitchen.",
                "reviewer_id": "WGK7ejWVp4omzygiMzqbHA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2109381339882341,
                    "positive_probability": 0.789061866011767
                },
                "stars": 4
            },
            {
                "review": "I've been to a lot of Taco Bells before, so I know what to expect from them. But this place was worse than average. For example, my Crunchwrap was made very sloppily and with less meat and cheese than average.",
                "reviewer_id": "YoS_VTXsYXicWFW_kPDUtQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9504433234563868,
                    "positive_probability": 0.049556676543613266
                },
                "stars": 2
            },
            {
                "review": "I have eaten at this specific Taco Bell many times before. The service is excellent, the staff are friendly, and they have never messed up an order! You can really tell that the employees here are not mad or rude like you often see at fast food joints, and are simply pleased to serve their customersAs far as their drive thrus are concerned, I have used their drive thru before and I haven't had the lengthy wait times many have complained about, but I guess I could have just gotten lucky!Overall, if you live in the CU area, this is definitely one of the better Taco Bells to visit!",
                "reviewer_id": "zkci3GQmLzyJJOWydv9NVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04569366730107435,
                    "positive_probability": 0.9543063326989268
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "gVSokyUWqy14UEp_JNVL7Q",
            "PYG1nrz2yYDSQk3W-vYwAA",
            "efJQBC6yfKzUvn0Fk08vbw",
            "dXLRevtIEnAvjUhPM_zTEg",
            "4MeniYcsZrwc_Cq6WSd3zQ",
            "RRCF1uUIkmLcQdZauqZJAQ",
            "LN0mZ37BeruC0XjyhES-ug",
            "3AtlNePpVHC-D1a49LqFtA",
            "cF2s9dlQ0ZiSDUdH-odoKQ",
            "M2boe4Te0rQ5RasVJkPXng"
        ]
    },
    "3AtlNePpVHC-D1a49LqFtA": {
        "keywords": {
            "bigrams": [
                "value_menu",
                "fast_food",
                "service_slow",
                "rush_midst",
                "ordered_salad",
                "compete_mcdonald",
                "seating_upstairs",
                "highly_constipated",
                "things_impossible",
                "fries_takes"
            ],
            "unigrams": [
                "wendy",
                "menu",
                "value",
                "food",
                "old",
                "cheap",
                "fast",
                "service",
                "didn",
                "eat"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false
            },
            "business_id": "3AtlNePpVHC-D1a49LqFtA",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "608 S Sixth St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "09:30"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "09:30"
                }
            },
            "latitude": 40.110804794513,
            "longitude": -88.2302965968847,
            "name": "Wendy's",
            "neighborhoods": [],
            "open": false,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/f8eyoEWtQ5S3uLYXA6QCxw/ms.jpg",
            "review_count": 8,
            "stars": 2,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "I don't like this Wendy's too much. When the cashier came she was friendly but was rushing to multitask while her coworkers chatted away. When you go to a fast food place, it's quite customary for all items on the value menu to be between $1 and $2. ",
        "reviews": [
            {
                "review": "Wendy's always delivers at a high level.  Their value menu is a little over priced but everything else is up to snuff.  Great for lunch on the go.",
                "reviewer_id": "AttSWPB137v7Om8V1inovA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3611215966386817,
                    "positive_probability": 0.6388784033613172
                },
                "stars": 3
            },
            {
                "review": "This has got to be the worst  Wendy's I've ever been to. First off, the prices for the value menu are just too high. When you go to a fast food place, it's quite customary for all items on the value menu to be between $1 and $2. The lowest priced item on the value menu was $1.50. Most items on it were $2.50. There was only one customer in front of me but service was as slow as taking a highly constipated dump.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8799752643743645,
                    "positive_probability": 0.12002473562563198
                },
                "stars": 1
            },
            {
                "review": "I don't like this Wendy's too much. The Wendy's from where I'm originally from is really old but was renovated too look Starbucks-esque, has decent service, and is cheap. This Wendy's is brand new, but the layout looks really old and everything is more expensive. The last time I went in there I waited by the abandoned cash register for 5 minutes while two workers chatted nearby. They didn't acknowledge me in anyway. When the cashier came she was friendly but was rushing to multitask while her coworkers chatted away.EDIT: They have a value menu now that is still kind of expensive, but I still give this place 2 stars.EDIT 2 (April 2014): This Wendy's now has the regular dollar menu (small frosty, crispy chicken, chili, nuggets, etc.). I'm guessing they did this to compete with the McDonald's that will be opening around the block in a few months. It looks like they have replaced some of their old workers with new ones that are more friendly. I go here every once in a while now. 3 stars",
                "reviewer_id": "EOjgKjLbfCssAqcGuBCm3w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9623566413121603,
                    "positive_probability": 0.03764335868784032
                },
                "stars": 3
            },
            {
                "review": "In a rush in the midst of studying for a final I ordered a salad and a baked potato -- to go. The service was fast, \"great!\", I thought!  But after making the trek all the way back to the library on the other end of campus I unfortunately discovered that they didn't give me any flatware to eat with. When I order two things that are impossible to eat without a fork TO GO forgetting flatware is unacceptable.",
                "reviewer_id": "HWBu3XE98jKHitb79Sdl3Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014766145491440643,
                    "positive_probability": 0.9852338545085552
                },
                "stars": 1
            },
            {
                "review": "It gets one star for being slower than most Wendy's and opened only until 12. This is a college campus, people are up all night, it needs to be open atleast until 2. Terrible marketing if you ask me. Value menu sucks, worst Wendy's I've been to. I mean what can someone expect from a Wendy's anyway? Oh, I don't know LATE night food   and cheap prices for cheap food. Well this one has neither. Awful business.",
                "reviewer_id": "TSLmSiKo3SUfIgCCB4cJvA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7525770714211171,
                    "positive_probability": 0.24742292857887832
                },
                "stars": 1
            },
            {
                "review": "I ordered a medium fries to go...takes 10 minutes...there were 4 people in the back and the manager was just standing around. For the sake of the school year..I hope they pick it up",
                "reviewer_id": "vE5J5zkcL29uEcp83La6xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.44932120902048206,
                    "positive_probability": 0.5506787909795173
                },
                "stars": 1
            },
            {
                "review": "Burgers are fresh and tasty. Doesn't have that stale taste of fast food. Plenty of seating upstairs. It's a nice lunch spot for me and my friends.",
                "reviewer_id": "YQh7V0JN03KezF38TaVCVw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7827746515396068,
                    "positive_probability": 0.21722534846039152
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "9SFWEreW7wAXB3zYu28r_Q",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "PYG1nrz2yYDSQk3W-vYwAA"
        ]
    },
    "6LtZI1tpMHPZv5nVHAF6rA": {
        "keywords": {
            "bigrams": [
                "getting_sprite",
                "got_daily",
                "order_yes",
                "wrong_meal",
                "staff_disappointing",
                "return_location",
                "relieved_noticed",
                "way_building",
                "lids_cups",
                "overall_dirty"
            ],
            "unigrams": [
                "sprite",
                "got",
                "went",
                "meal",
                "daily",
                "cup",
                "asked",
                "time",
                "restaurant",
                "back"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Attire": "casual",
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Price Range": 1,
                "Take-out": false,
                "Takes Reservations": false
            },
            "business_id": "6LtZI1tpMHPZv5nVHAF6rA",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1812 N Neil St\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.1374307,
            "longitude": -88.2435916,
            "name": "McDonald's",
            "neighborhoods": [],
            "open": true,
            "review_count": 6,
            "stars": 1.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "I ordered a Daily Double meal like usual. Instead of getting a Sprite, I got a Coke. I went back into the restaurant FOR THE THIRD TIME to get my meal. ",
        "reviews": [
            {
                "review": "Dirty, stinks, slow service and very rude employees.  They seriously do not want to be there.  I'm stuck because it's the only one with a playplace in Champaign, but it is a terrable experience everytime.",
                "reviewer_id": "21rgESVI2FOWWOiV9dVinQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40462839138011863,
                    "positive_probability": 0.5953716086198834
                },
                "stars": 1
            },
            {
                "review": "We wanted to go through the drive thru but it was wrapped all the way around the building.  So we parked and went inside. This location was overall dirty. When we went to fill our drinks there were several hairs in the lids for the cups. The food was cold and the fries were soggy. I will not return to this location.",
                "reviewer_id": "2d6bYq_7cfi8zp0lswZjOQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7506683886963464,
                    "positive_probability": 0.2493316113036553
                },
                "stars": 1
            },
            {
                "review": "If you like your playground slide to smell like urine, this is the place. If you like flies with your fries, good spot. If you want three ice cubes in your gallon sized soda, enjoy!",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7606089760848193,
                    "positive_probability": 0.23939102391517988
                },
                "stars": 1
            },
            {
                "review": "Like most people, I went to the drive thru. I ordered a Daily Double meal like usual. I went to the 1st window and the cashier said, \"You got Daily Double, no onion, pickle or mustard?\" No, I got the Daily Double with all of the fixins-- thanks for assuming *rolls eyes.* I get my order and I realized that I got the wrong drink. Instead of getting a Sprite, I got a Coke. I quickly walked back over and asked them if I could quickly get my Sprite. The worker was less than nice and took his sweet damn time getting me a Sprite. All along I saw what I believed to be a regular Sprite right in front of me. I asked him if that's mine and he's like, \"uhhh...no.\" So I get my cup, totally relieved-- then I noticed that the cup felt light. I opened the cup to see that it wasn't even filled all of the way and with little ice and no bubbles. Hmm...a clear liquid with no bubbles; does that sound like Sprite to you? No, and it wasn't. It was water (not even cold too). So now I am pissed because I told this punk politely for Sprite at least TWICE. So I go into the restaurant and get it replaced. Then the manager asked me if I got my order and I said yes. Now I'm thinking that my meal is also wrong. I go back into my car to find they did give me the wrong meal. I went back into the restaurant FOR THE THIRD TIME to get my meal. All awhile customers are pitying me saying, \"They really screwed that up, didn't they?\" No fucking shit.By the time I ate my burger, I lost my apetite.The competency of this staff is beyond disappointing. I am definitely going to another McDonalds if not another restaurant because of this.",
                "reviewer_id": "lnI3o0mHyYjVPKadZdskeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012521018443297787,
                    "positive_probability": 0.9874789815567062
                },
                "stars": 1
            },
            {
                "review": "I know McDonald's isn't haute cuisine, but the food here is crappy compared to other locations.",
                "reviewer_id": "ZRWDnvo07YZxxtrDYWf02A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4611091351252928,
                    "positive_probability": 0.538890864874708
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "3AtlNePpVHC-D1a49LqFtA",
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "9SFWEreW7wAXB3zYu28r_Q",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "DWZ1_iy-cTeehK5FTiqH-g"
        ]
    },
    "9w1FCHEGc2CWBl0nzX-SUg": {
        "keywords": {
            "bigrams": [
                "nasty_nasty",
                "ridiculously_delicious",
                "tastes_haven",
                "great_service",
                "good_quality",
                "changed_oil",
                "tasty_hot",
                "hate_gays",
                "company_evidently",
                "products_good"
            ],
            "unigrams": [
                "nasty",
                "fresh",
                "food",
                "good",
                "oil",
                "hot",
                "planet",
                "tastes",
                "great",
                "waffle"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": true,
                    "brunch": true,
                    "dessert": true,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true
            },
            "business_id": "9w1FCHEGc2CWBl0nzX-SUg",
            "categories": [
                "Fast Food",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "1401 W Green St\nUrbana, IL 61801",
            "hours": {},
            "latitude": 40.1097387,
            "longitude": -88.2273147,
            "name": "Chick-fil-A",
            "neighborhoods": [],
            "open": false,
            "review_count": 3,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This location runs a tight ship. Super fast really hot food that is ridiculously delicious. Their business is the production of tasty, hot, fresh chicken and waffle fry products and they are good at it. ",
        "reviews": [
            {
                "review": "This location runs a tight ship. Super fast really hot food that is ridiculously delicious.  Their business is the production of tasty, hot, fresh chicken and waffle fry products and they are good at it.  Anything else is beside the point.  Plus, I don't know how or why, but their Dr. Pepper is better than anywhere else on the planet.",
                "reviewer_id": "bq7NqilNqH3_kYW1pSaHRw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9124308580473814,
                    "positive_probability": 0.08756914195262147
                },
                "stars": 5
            },
            {
                "review": "Good quality food and great service.",
                "reviewer_id": "FFsuViuxEt6rvWPyTMo02Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.437799670717042,
                    "positive_probability": 0.5622003292829578
                },
                "stars": 4
            },
            {
                "review": "Nasty, nasty, nasty. Lines are long, their product tastes like they haven't changed the oil in months. This company evidently hates using fresh cooking oil as much as they hate gays.",
                "reviewer_id": "Q1iT-u0F-9m0p2dESh3dVw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5643367132942831,
                    "positive_probability": 0.43566328670571475
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "PYG1nrz2yYDSQk3W-vYwAA",
            "McjqmrsudvpnVxtYJKSUtQ",
            "vxFeYTFre83stnrcLAj84A",
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "3AtlNePpVHC-D1a49LqFtA",
            "cF2s9dlQ0ZiSDUdH-odoKQ",
            "gY7617TMFGmPQR2A70L2vA",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "SQASst3NU4tA-t4cmWLILA"
        ]
    },
    "DWZ1_iy-cTeehK5FTiqH-g": {
        "keywords": {
            "bigrams": [
                "left_witnessed",
                "friendly_ready",
                "coffee_bad",
                "total_joke",
                "review_food",
                "table_sitting",
                "nearly_hour",
                "seated_food",
                "barrel_got",
                "servers_friendly"
            ],
            "unigrams": [
                "food",
                "place",
                "coffee",
                "time",
                "talking",
                "sad",
                "manager",
                "back",
                "cheese",
                "bad"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Attire": "casual",
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Noise Level": "average",
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false
            },
            "business_id": "DWZ1_iy-cTeehK5FTiqH-g",
            "categories": [
                "Food",
                "Burgers",
                "Fast Food",
                "Ice Cream & Frozen Yogurt",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "2009 N Kenyon Rd\nUrbana, IL 61802",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "00:00"
                }
            },
            "latitude": 40.133231,
            "longitude": -88.198592,
            "name": "Steak 'n Shake",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/YgsplyF-L0mkkfqRL8E2GQ/ms.jpg",
            "review_count": 7,
            "stars": 1.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This is a review on just their coffee. This place has wonderful servers who are friendly and ready to take their time helping every customer. This place could be good if the management got its act together. ",
        "reviews": [
            {
                "review": "This place is sad. From the time we walked in until the time we left I witnessed so many things wrong the health board would shut them down. First a waiter eating a bag of potato chips on duty at the bar talking to 2 girls.  Then the guys cooking the burgers starts talking to them. He puts on one of the girls sunglasses and continues to cook. Then he gives them back and plays with he key chains. Then cooks again. Never washing his hands and never wearing gloves. Then I see our waiter come out of the back eating food as he is getting our drinks, meanwhile no manager in site. Finally after about 20 mins the manager Lewis comes out of the back for just a bit to talk to a couple waitresses and drinking margaritas the night before. This place is a total joke!!!!",
                "reviewer_id": "2d6bYq_7cfi8zp0lswZjOQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0021892116067922926,
                    "positive_probability": 0.9978107883931975
                },
                "stars": 1
            },
            {
                "review": "This place has wonderful servers who are friendly and ready to take their time helping every customer. Unfortunately, the management has a problem with scheduling enough employees to work. There is always just one trying to serve the whole floor every time I go there. And I've never once seen any of them get a break. Over worked employees.... Its sad. This place needs some serious help.",
                "reviewer_id": "6zoKHExCjxIttyuIp_sXLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01662955795686513,
                    "positive_probability": 0.983370442043138
                },
                "stars": 2
            },
            {
                "review": ":| It's not that this place is specifically bad. I think Steak 'n Shake is just not my style. The burgers are too floppy and sad and astoundingly greasy. Shakes are so sweet it hurts.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7356155695538139,
                    "positive_probability": 0.2643844304461848
                },
                "stars": 2
            },
            {
                "review": "First, the good news. The food was tasty. Every other part of the meal was a disaster. My burger was missing everything but meat and cheese. The cheese fries had no cheese and getting the attention of our server was nearly impossible. We tried talking to the manager but he was too busy talking with his friends. In all it took nearly an hour to feed two adults and three kids. Most of it spent waiting. This place could be good if the management got its act together.",
                "reviewer_id": "EvM5jc-TI2s8SobWs9eM7Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5840733013336313,
                    "positive_probability": 0.4159266986663593
                },
                "stars": 2
            },
            {
                "review": "This is a review on just their coffee.The coffee is bad. It has been burnt both times I have visited in the early mornings, despite my hope that the first time was an isolated incident. They sell the 'Seattle's Best' brand, which I would imagine is not inherently bad coffee, but something in their process is off, as it is not good coffee in my book: too burned and too bitter for how disappointingly not strong it is. Also, the coffee only comes in small cups. I wanted a 20 oz. jar of rocket fuel, but settled for 12 oz. of undrinkable ash.Service was friendly and fairly fast. I could not bear to give this less than 2 stars based upon only reviewing one menu item, but if this was a coffeehouse serving this hot garbage, it would be a one star.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005741067571708394,
                    "positive_probability": 0.9942589324282949
                },
                "stars": 2
            },
            {
                "review": "I'm leaving a 1-star review only because Yelp won't let me go with 0-stars.  I also cannot leave a review for the food due to us picking up & leaving before we could get a food order in due to the lack of organization in this place.  The table of 6 sitting next to us mentioned they had been waiting for close to an hour, and 5 of the six were just about done with their food and one person was still waiting.  We said forget it, and went next door to Cracker Barrel and got seated & our food very quickly.  It appears that the other reviews for this location are similar to what we experienced.  Poor management, poor attitudes, and I can only imagine what goes on with the food preparation.  Save your hard earned money and avoid this Steak 'n Shake at all cost.",
                "reviewer_id": "pnW4cDs9yHTuuihTaubK8Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9474512656740965,
                    "positive_probability": 0.05254873432590475
                },
                "stars": 1
            },
            {
                "review": "We ate breakfast there yesterday and it was terrible. Got there. At 9:15 and they didn't have any coffee made.  Didn't look like the floors had been cleaned from the night. Wasn't many people there, but had to wait over 20 minutes for our food and then it wasn't what we ordered. Usually don't complain but......",
                "reviewer_id": "Tj95i5M-c0HQvsB6anIDkw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18172937812202394,
                    "positive_probability": 0.8182706218779776
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "0P0XckSv_2_ZNKoYlhT4Gw",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "3AtlNePpVHC-D1a49LqFtA",
            "M2boe4Te0rQ5RasVJkPXng",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "1d5XAAH39FKenV3_9gcFIw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "a4JU2JqAbT0p8_A8s_v8Kw"
        ]
    },
    "L3S29vAyPOxmDZ04AilwnQ": {
        "keywords": {
            "bigrams": [
                "bagged_lettuce",
                "working_counter",
                "parked_parking",
                "sized_work",
                "work_trucks",
                "trucks_parked",
                "sandwich_leave",
                "take_shortcut",
                "pepper_jack",
                "home_sat"
            ],
            "unigrams": [
                "sandwich",
                "subway",
                "work",
                "take",
                "parked",
                "taste",
                "bagged",
                "ordered",
                "lettuce",
                "counter"
            ]
        },
        "metadata": {
            "attributes": {
                "Alcohol": "none",
                "Delivery": false,
                "Drive-Thru": false,
                "Good For Groups": false,
                "Good for Kids": false,
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": false,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true
            },
            "business_id": "L3S29vAyPOxmDZ04AilwnQ",
            "categories": [
                "Fast Food",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1401 S Neil St\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.0997492,
            "longitude": -88.244739,
            "name": "Subway",
            "neighborhoods": [],
            "open": true,
            "review_count": 5,
            "stars": 1.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "I do not recommend this sandwich unless you are looking for a bland, flavorless sandwich. This Subway is the closest to my work so I go here when I want a quick sandwich. He said the manager hadn't ordered a supply truck for the week. ",
        "reviews": [
            {
                "review": "This is the worst Subway in Champaign-Urbana! Filthy, and the staff was bitching about the fact that he had to sweep the floor! I'll never be back, too many other options in town and close to this location. Ewwwwwwww!",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04934456758168979,
                    "positive_probability": 0.9506554324183109
                },
                "stars": 1
            },
            {
                "review": "Worst service I have ever received at a Subway.",
                "reviewer_id": "_Y-x3GQDSVHKSigTbSM9VA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.36702988064582476,
                    "positive_probability": 0.6329701193541756
                },
                "stars": 1
            },
            {
                "review": "I stooped in on my way home on a Mon. night at 7 PM to pick up a sandwich. The place was empty. I ordered a tuna sub. The nice guy behind the counter told me they were out of tuna salad. And mayonnaise. And onions. He said the manager hadn't ordered a supply truck for the week. They will be out of those items until next week. What kind of a manager is that? I ordered a \"specialty,\" a BMT. I got it home and sat down to eat. The sandwich was very tasteless, unless you count the nasty bagged lettuce taste when you take a bite. Why do restaurants use bagged lettuce when it's so easy to cut head lettuce? Shortcuts. And if they take a shortcut with something that easy to prepare, they take shortcuts on everything. If I get a bagged taste at any restaurant, it's my last visit,",
                "reviewer_id": "PbNJ09Y1E1hjx9mORJrYzg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7771884386745208,
                    "positive_probability": 0.22281156132548896
                },
                "stars": 1
            },
            {
                "review": "This Subway is the closest to my work so I go here when I want a quick sandwich.  The last few times I have gone there have been big over sized work trucks parked in the parking lot.  The lot at this location is way too small and it's hard to maneuver around the vehicles.  I parked in the very last spot so no one would block me in and sure enough one of those over sized work trucks parked next to me in a no parking area.  I had to wait until he was done with his sandwich before I could leave.  I will avoid this Subway until they get this problem resolved.",
                "reviewer_id": "W4ojW7f30haCertr4CzFJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9979132974957637,
                    "positive_probability": 0.0020867025042363278
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "SQASst3NU4tA-t4cmWLILA",
            "i7lY2Ip8dEIkyuI75vNO4Q",
            "fXpuT4mNzxzUZbt--vqzIg",
            "yZwl-dXM4SpEDEiihrfZnw",
            "jv-VfERRGsx0-MF7kLj8XQ",
            "j9N_fG1PVCSY-3HY1TRQ5Q",
            "leH24AjTrmcImAbsdh4HFQ",
            "Uw1DZhEtTmLzMcXmdpR8Pw",
            "79hY0d7j45ZRjTAB2d0jQQ",
            "mSTjlawGZcbg8YBQx9UxFg"
        ]
    },
    "M2boe4Te0rQ5RasVJkPXng": {
        "keywords": {
            "bigrams": [
                "worth_checkin",
                "despite_recent",
                "usually_mixed",
                "issue_wendy",
                "radii_corners",
                "good_wendy",
                "displeasure_workers",
                "opening_standard",
                "lot_drive",
                "make_point"
            ],
            "unigrams": [
                "wendy",
                "good",
                "parking",
                "drive",
                "food",
                "turn",
                "staff",
                "lot",
                "tight",
                "wasted"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false
            },
            "business_id": "M2boe4Te0rQ5RasVJkPXng",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "505 N Cunningham\nUrbana, IL 61802",
            "hours": {
                "Friday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Monday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Saturday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Sunday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Thursday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Tuesday": {
                    "close": "02:00",
                    "open": "09:00"
                },
                "Wednesday": {
                    "close": "02:00",
                    "open": "09:00"
                }
            },
            "latitude": 40.1172246,
            "longitude": -88.2051296,
            "name": "Wendy's",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/pwqodpXEaVwAeinwgwSQ5Q/ms.jpg",
            "review_count": 3,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "So I come in here and it seems that the boss is displeased with the way things are running and is voicing her displeasure to their workers. Alright, awkward. The food is good. ",
        "reviews": [
            {
                "review": "So I come in here and it seems that the boss is displeased with the way things are running and is voicing her displeasure to their workers. Alright, awkward. Despite its recent opening, this seems like your standard fare of Wendy's.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21613523116955183,
                    "positive_probability": 0.7838647688304483
                },
                "stars": 3
            },
            {
                "review": "The food is good. The specialty lemonades and tees are usually mixed at the proper ratios. Mistakes are fairly rare but it's worth checkin your food before you leave if using the drive through. The one major issue with this Wendy's is it's ridiculously over complicated and unnecessary parking lot and drive through layout. Not only does it result in wasted space and not enough parking spots, but the radii of the corners and lanes are far too tight for most cars to make without a 3 point turn. It's a brand new building and unfortunately will need renovation soon. Otherwise a good Wendy's with friendly staff.",
                "reviewer_id": "we86SYw-dL7szBlSIwlXvQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7064009680374981,
                    "positive_probability": 0.2935990319625107
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "3AtlNePpVHC-D1a49LqFtA",
            "1d5XAAH39FKenV3_9gcFIw",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "9SFWEreW7wAXB3zYu28r_Q",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "cF2s9dlQ0ZiSDUdH-odoKQ"
        ]
    },
    "McjqmrsudvpnVxtYJKSUtQ": {
        "keywords": {
            "bigrams": [
                "customer_service",
                "burger_king",
                "bothering_jobs",
                "management_change",
                "bad_experience",
                "king_town",
                "people_treat",
                "location_awful",
                "location_nightmare",
                "stale_cold"
            ],
            "unigrams": [
                "service",
                "location",
                "food",
                "average",
                "king",
                "burger",
                "customer",
                "sure",
                "town",
                "stale"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Attire": "casual",
                "Delivery": false,
                "Good For Groups": true,
                "Good for Kids": true,
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false
            },
            "business_id": "McjqmrsudvpnVxtYJKSUtQ",
            "categories": [
                "Fast Food",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "1708 Philo Rd\nUrbana, IL 61802",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "05:30"
                },
                "Monday": {
                    "close": "23:00",
                    "open": "05:30"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "05:30"
                },
                "Sunday": {
                    "close": "23:00",
                    "open": "07:00"
                },
                "Thursday": {
                    "close": "23:00",
                    "open": "05:30"
                },
                "Tuesday": {
                    "close": "23:00",
                    "open": "05:30"
                },
                "Wednesday": {
                    "close": "23:00",
                    "open": "05:00"
                }
            },
            "latitude": 40.0982205,
            "longitude": -88.1907117,
            "name": "Burger King",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/BiYYFjb_0EyYMJnHAjOCjw/ms.jpg",
            "review_count": 3,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "While I typically like Burger King's burgers, the customer service at this location is a nightmare. Not sure if there was a management change since theses other reviews were posted, but for the past 6-9 months I've frequented this location at least biweekly and I've always had great customer service. Food is fresh, service even better. ",
        "reviews": [
            {
                "review": "Not sure if there was a management change since theses other reviews were posted, but for the past 6-9 months I've frequented this location at least biweekly and I've always had great customer service. Food is fresh, service even better. I'll be back. Anyone who has previously had a bad experience here should try it again, you're likely to be surprised.",
                "reviewer_id": "1FL7xwrA9cVdhsfPz72pDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12399073924558994,
                    "positive_probability": 0.8760092607544122
                },
                "stars": 4
            },
            {
                "review": "While I typically like Burger King's burgers, the customer service at this location is a nightmare. I rarely frequent this location just because of their awful attitudes. I don't need to pay people to treat me like I'm bothering them to do their jobs.",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8109006529897849,
                    "positive_probability": 0.1890993470102155
                },
                "stars": 2
            },
            {
                "review": "Quite possibly the worst Burger King in town. The service is fairly average, but the food is far below average. As soon as I got home and ate my food, it tasted stale and cold.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5764493513474912,
                    "positive_probability": 0.4235506486525083
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "vxFeYTFre83stnrcLAj84A",
            "9w1FCHEGc2CWBl0nzX-SUg",
            "PYG1nrz2yYDSQk3W-vYwAA",
            "i7lY2Ip8dEIkyuI75vNO4Q",
            "1d5XAAH39FKenV3_9gcFIw",
            "fXpuT4mNzxzUZbt--vqzIg",
            "3AtlNePpVHC-D1a49LqFtA",
            "cF2s9dlQ0ZiSDUdH-odoKQ",
            "M2boe4Te0rQ5RasVJkPXng",
            "HUif3t3SUkfb4T1cTXzMHA"
        ]
    },
    "PYG1nrz2yYDSQk3W-vYwAA": {
        "keywords": {
            "bigrams": [
                "fast_food",
                "love_chipotle",
                "mexican_food",
                "mexican_restaurant",
                "burrito_bowls",
                "customer_service",
                "authentic_mexican",
                "fajita_burrito",
                "yum_yum",
                "bad_experience"
            ],
            "unigrams": [
                "chipotle",
                "food",
                "mexican",
                "burrito",
                "love",
                "line",
                "fast",
                "better",
                "good",
                "location"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "loud",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "PYG1nrz2yYDSQk3W-vYwAA",
            "categories": [
                "Fast Food",
                "Mexican",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "528 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1103747782313,
            "longitude": -88.2306922227144,
            "name": "Chipotle Mexican Grill",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/3s5vNitzHhPAlwYAtjF7NQ/ms.jpg",
            "review_count": 52,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "It's Chipotle. Chipotle is the best. It's a Chipotle. ",
        "reviews": [
            {
                "review": "Its a Chipotle, so there isn't much to elaborate on.  Don't go from noon to 1pm when school is in session, as the line can get ridiculous.  But otherwise I've never had a bad experience at this location.",
                "reviewer_id": "1Q2Ea4vyB90zRqwAHjfCDg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.553405310808664,
                    "positive_probability": 0.44659468919133416
                },
                "stars": 3
            },
            {
                "review": "Easily my favorite food joint on campus. It may not be 'real' Mexican food, but it certainly is delicious. The downside to that, is that there is always a line, but the staff is usually very efficient and courteous. It's hard to find a combination that is bad, but I definitely suggest more people try the fajita vegetables. It's a completely different flavor than a standard beans, much sweeter, but definitely delicious. Watch out for the Guac though; it's good but they charge you for it.",
                "reviewer_id": "2fG_DvJxtX-0wJEd1cI4hA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010536008456227984,
                    "positive_probability": 0.9894639915437675
                },
                "stars": 5
            },
            {
                "review": "Gimme a break, this is an imitation Mexican restaurant run by McDonalds.  I'm from Urbana and I live in a very competitive place for mexican food, San Diego, CA.  The best thing that can be said about the food is, (a) Its not expensive for the amount you get, (b) It's unlikely to cause indigestion, and (c) If you've never tried mexican before, this won't turn you away forever.Otherwise, compared to many other mexican fast-food restaurants, this one is highly forgettable.  Example : L.S. (CA West Coast), much better, a 5-star fast-food mexican restaurant.  Example : R. (National), much better, a little pricier than the one above and salsas not as good, a 4-star fast-food mexican restaurant, and a publically traded company.  Example : T.B. (National).  Ok, it's not really mexican, but I enjoy their \"imaginary\" mexican creations, such as the 7-layer burrito and their chalupas, 3 stars.",
                "reviewer_id": "3i6DhhRc3uQzxjtNNPX6_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09761107266872046,
                    "positive_probability": 0.9023889273312845
                },
                "stars": 2
            },
            {
                "review": "Service is quick and friendly. I like the two stories with the building. Things are a little bit more quiet upstairs. Their Chips and salsa are addicting. Simply put. mmmmm Tacos. . .",
                "reviewer_id": "3qFI4GeLEDUtWNRpLBY68Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06148377755975411,
                    "positive_probability": 0.9385162224402458
                },
                "stars": 4
            },
            {
                "review": "The food is not good , and the ingredients sitting out never look fresh. Go to a real authentic Mexican restaurant of you're craving Mexican food. This place will waste your time and horrify your taste buds. :0",
                "reviewer_id": "44GzCA_7s9Xq3kzl2xD1TQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5075409160244679,
                    "positive_probability": 0.4924590839755336
                },
                "stars": 1
            },
            {
                "review": "I love it!",
                "reviewer_id": "5Ki-hbA5LSB3fMXShp9yXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45408163265306123,
                    "positive_probability": 0.5459183673469388
                },
                "stars": 5
            },
            {
                "review": "Ok - it's no El Charro. But if I had to pick a chain restaurant on campus, I'd go with Chipotle. Especially now that Chipotle isn't owned by McDonald's anymore - I feel better about endorsing them. Their veggie burrito bowls are very filling and the majority of the ingredients are organic, naturally raised, sustainable, hormone free and sometimes, even locally grown! It is truly Food With Integrity, like their ads claim. And anyone who goes to Qdoba (greasy barf) is out of their mind.",
                "reviewer_id": "7zSppEZd2C6ASpNeBebxAA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19472665520616553,
                    "positive_probability": 0.8052733447938266
                },
                "stars": 5
            },
            {
                "review": "I really don't understand all the guilt in liking Chipotle! If you like it, you like it. Frankly I'd take a tasty inauthentic chain restaurant burrito over some of the local flavorless grease bombs any day. I think the success of Chipotle is down to their very focused menu. They only serve burritos, salads and chips. They have chosen a narrow scope and do it well.Like most chain restaurants, it usually tastes better the when they are busier. I have gone at off-times and had less-than fresh ingredients served to me. Frankly though if they start scraping the bottom of the container of meat I imagine you could politely ask to wait for a fresh batch.I'm not a fan of grease and I enjoy the fact that the meat seems lean but juicy. That way grease isn't squirting all over your plate as you attempt to eat the burrito. Their chips are generally very fresh tasting and warm. They have just the right amount of salt. I'd recommend the guacamole as it's certainly better than I ever imagined it could be.There are better sit-down restaurants to eat Mexican in town. But if you need something quick to eat and are near campus this is a great choice over somewhere like Taco Bell.",
                "reviewer_id": "8ufCKZCjsaqf-hhSs3K4eg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001670415027625418,
                    "positive_probability": 0.999832958497239
                },
                "stars": 4
            },
            {
                "review": "Why the fuck would I review Chipotle, a delicious but slightly generic burrito chain? I had to echo the chorus whom can't help but laugh at the portion sizes. Of course some may say we're just being \"Fat Americans,\" but I love the bang-for-my-buck gut bombs that Chipotle is famous for. The burritos at this location simply seem like a sample size compared to superior other locations; the employees seem to give less of  a damn than any other fast food location in the area. That's a great summation of this Chipotle.",
                "reviewer_id": "9yAsh0pQgH7451dHv2k4sw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23488723385214028,
                    "positive_probability": 0.7651127661478578
                },
                "stars": 2
            },
            {
                "review": "It's Chipotle. It fulfills a need--satisfying my cravings for psuedo-Mexican food. I do actually think their guac is really good, and the unique char on the chicken is what keeps me coming back. Of course there are better choices for Mexican, but how can you deny that specific craving?",
                "reviewer_id": "_hz_dF3yYAUdbD8rwqbVPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20708506872991506,
                    "positive_probability": 0.7929149312700834
                },
                "stars": 4
            },
            {
                "review": "I love the food at Chipotle Mexican Grill.",
                "reviewer_id": "_RaiOz3cxRTNPhHTwpW-aw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4651078742992829,
                    "positive_probability": 0.5348921257007173
                },
                "stars": 5
            },
            {
                "review": "Okay, so I know it's owned by McDonald's, and after watching Super Size Me, I will never eat at that place again. But wow, I don't care if it's going to clog the crap out of my arteries, I LOVE CHIPOTLE. Then after being in Florida for school for so long, my obsession with Chipotle became clear. Their chicken fajita burritos and their salsa are just soo good! It's also nice that you're able to get a Corona on the side if you want. MMmmm.UPDATE!Melissa M right below me just informed me that McDonalds no longer owns Chipotle. EAT UP!",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.016226780309493406,
                    "positive_probability": 0.9837732196905031
                },
                "stars": 5
            },
            {
                "review": "Chipotle is the best. We all know it. But the thing is, this Chipotle could run a lot more efficiently. There is a lot of time waiting in line because the efficiency of getting more food on the line isn't as fast as it should be, especially for a fast-food chain 2 blocks away from campus. Why still four stars? Because it's delicious! I still go here all the time because the food is so fresh-- it must get replaced very frequently because of the amount of people that go here, so it's in its freshest state. All in all, good place, but could use some better efficiency.",
                "reviewer_id": "C5clF8EHUHfe9CrnAVGWqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33170508110424035,
                    "positive_probability": 0.6682949188957568
                },
                "stars": 4
            },
            {
                "review": "Chipotle is delicious.  Way better and fresher than qdoba, but they also don't have as much variety (I'd go for fresher and better over variety any day).  Burritos run about $6.50-$7, plus you can go for the upsell with guac, chips, and a drink and end up with a ~$12 bill, which is a little much for a meal in a fast casual restaurant.  The burritos are pretty big, but I can't say that I'm completely full after them, however with the calorie count, I really shouldn't complain.  Biggest downside to this location is that it's almost always busy; you can expect a 10-30 minute wait during lunch and dinner periods, and sometimes just randomly throughout the day.  Also, they aren't open all that late, so you can't satisfy those late night munchies with a Chipotle burrito :-(",
                "reviewer_id": "cSqolAOfIDsKu3tujDrHBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05590018026043574,
                    "positive_probability": 0.9440998197395682
                },
                "stars": 4
            },
            {
                "review": "Tasty and fast! I got a chicken fajita burrito and they made it in just a few minutes. Staff was polite and rang me up correctly. Good stop for a lunch break!",
                "reviewer_id": "CW9eu3ONnfBr4psEamEa-w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.46927405579214815,
                    "positive_probability": 0.5307259442078543
                },
                "stars": 4
            },
            {
                "review": "I don't like burritos but I love Chipotle! Yes, it's fast food but I think what makes them different is their ingredients. They grill their meat to perfection, make their buttered rice from scratch and their salsas are amazing! I would easily choose Chipotle over La Bamba's anytime.",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07681994351129648,
                    "positive_probability": 0.9231800564887016
                },
                "stars": 3
            },
            {
                "review": "I obviously like chipotle food to post one here. The portion size in this chain is ridiculous. though I've been told to ask for more if I need more, they're just simply lazy to fill up the tray and try to make 10 dishes of an empty one and the look in their eyes when ask for more, avoid it if it at all possible . Rushing the customers when there is even no one else in the line is simply rude.",
                "reviewer_id": "DvEuYDvDsVz3zB1K4vh2-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0993694191158251,
                    "positive_probability": 0.9006305808841795
                },
                "stars": 2
            },
            {
                "review": "I go here all the time and the employees always get me \"the usual\". Always delicious. The line can be very long sometimes, though.",
                "reviewer_id": "dz8P0xADVZ-6_ri-2sY0rg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45142670201371843,
                    "positive_probability": 0.5485732979862818
                },
                "stars": 5
            },
            {
                "review": "I've only been to two Chipotles, so this may not mean much, but this Chipotle is great. The employees are really fast and nice, and the portions are HUGE. The customer service is stellar. I have only had one bad experience here due to a very unhappy employee.When I finally tried their sofritas, I was stunned. I did not expect tofu to taste so savory. I only got the sofritas to avoid the meat options, not because I had an independent motivation to get them. Now, I can confidently say that sofritas are good in themselves. Whatever they're putting on these, it's ace.I tire of Chipotle, but that's only because this is one of the very few places that you can reliably eat vegan on Green St. It's also really convenient that they serve beans because you can up your protein intake.The lines get insanely long, so you should order on the app. You can set your pickup time to 45 minutes or more, so prepare to order ahead.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2179016246242566,
                    "positive_probability": 0.7820983753757473
                },
                "stars": 5
            },
            {
                "review": "One of my peers is a native of Mexico and I asked him what he really felt about this place. His exact words were \"It's just like Taco Bell.\" It's nice to get a native's perspective on our Americanized Mexican food. I gotta say that the food is fairly delicious and filling though but it does cost a bit too much for it.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0278233734217569,
                    "positive_probability": 0.9721766265782453
                },
                "stars": 3
            },
            {
                "review": "Fast service and quality food make it delicious. Not quite as good as a lot of the other Chipotles I've been to, but still quite yummy regardless! You can never really go wrong with their food.",
                "reviewer_id": "EP9dBOhdRG8TmvsKn_D_CQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.385891907527661,
                    "positive_probability": 0.6141080924723397
                },
                "stars": 4
            },
            {
                "review": "This place is great. On point with all things Chipotle. Could be a little cleaner but the food is consistently good, staff nice, and they handle a busy large crowd excellent.",
                "reviewer_id": "EZ6UB9mX59z-RRy8TVkitQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.34288133256697534,
                    "positive_probability": 0.6571186674330259
                },
                "stars": 5
            },
            {
                "review": "Always get the fajita burrito with extra rice. My chipotle experiances have always been great except for this chipotle. The service is not super friendly, and when then put the meat on your burrito, they don't put alot. There is always a long line, which is usually acceptable except when the line has to fold into the eating area. This chipotles burritos are usally 3/4 the size of the ones i get made for me at other chipotle places. Still this chipotle is able to fix my chipotle fix.",
                "reviewer_id": "FaHrYSHUMR_uZ2q1dHRKng",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.65081723468544,
                    "positive_probability": 0.3491827653145599
                },
                "stars": 2
            },
            {
                "review": "I love Chipotle and lived in a town without one for a couple years. I was really excited to move to Champaign and finally be able to have Chipotle once a week for lunch again but this location just sucks. The employees are rude and move so slow. They give really skimpy portion sizes. The guac, rice, and tea taste different than all the others I've eaten at. This location goes against everything Chipotle stands for. It's such a shame.",
                "reviewer_id": "fcmmeyw62l9EuuGVU5QK8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1681359812823364,
                    "positive_probability": 0.8318640187176618
                },
                "stars": 2
            },
            {
                "review": "Chipotle may not be authentic Mexican, but it does set itself apart from other chains. The primary reason to go to Chipotle is the quality of the ingredients. Niman Ranch pork is ten times more juicy and delectable than the factory farmed version. It's also much more humanely raised and ecologically friendly. Chipotle braises the pork with pepper and other mild spices and the tender and flavorful result is what keeps me coming back all the time. There are lots of other options ranging from chicken to vegetarian, but in my opinion the pork is really the best. This location sometimes will give you a discount if you order just meat/cheese/rice and sometimes not...it's rather bizarre, but I think it depends on if the manager is around or not. I keep my receipts as a rather amusing record of how many times I have gotten the \"Ilini secret special.\"It's quite expensive as \"fast food\" goes and it gets crowded. I usually take mine to go, since every Chipotle I've visited has had a harried atmosphere that makes dining in unpleasant...but even if it upscale fast food, it's still fast food, so that's what I expect.",
                "reviewer_id": "HqaXK9toBpQdcz-0-rVwKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00019150760652491294,
                    "positive_probability": 0.9998084923934605
                },
                "stars": 4
            },
            {
                "review": "I went there because I ordered it online they messed up my order. The girl kept claiming I didn't order when I did. She didn't have the receipt in her hand even though I had a copy saying that I paid and what I wanted. The order was suppose to be for three I showed up ten minutes early and the worker kept telling me to look at the clock and it's not 3 o clock. Bad people working there and very rude to customers.",
                "reviewer_id": "i8MfLjmrms-n79EDoPcdhA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018343835999129338,
                    "positive_probability": 0.9816561640008776
                },
                "stars": 1
            },
            {
                "review": "Please don't hate, but I like Chipotle... Sure it's owned by McDonalds, sure it's not authentic Mexican food, but still it's very tasty. Nothing special about this particular location: it looks like any other Chipotle restaurant (maybe a little nicer?). The nice thing about it, though, is that I get the same burrito that I would buy in NYC for $2 cheaper...",
                "reviewer_id": "igrgFZl9wDohSem0UyoP6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07058836237651483,
                    "positive_probability": 0.9294116376234862
                },
                "stars": 4
            },
            {
                "review": "Champaign Chipotle sucks. Honestly, I love Chipotle. I've had it in numerous places, always enjoyed a big juicy burrito, but this one... The worst of the worst. My burrito was half-sized, and most of the ingredients were overhelmed by rice and beans. Barbacoa was tough and dry... Rice was dry too, Corn was pale and weird. Pretty much all of the ingredients tasted different!Never again.",
                "reviewer_id": "iTFVKYQC0MnoPx-3NnngqQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38984129985252863,
                    "positive_probability": 0.6101587001474701
                },
                "stars": 2
            },
            {
                "review": "Liked the food a lot. Exciting and exotic taste no matter how you choose to mix up the ingredients. However I'm not always happy with the service. Staff a little rude and inpatient. Maby just to busy? Also portion varies each time I go there.",
                "reviewer_id": "iZXnZSzTUWdXe_ZNIixgUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16359405199537502,
                    "positive_probability": 0.8364059480046281
                },
                "stars": 3
            },
            {
                "review": "My first time Chipotle was sometime last year. It was one of the best things, and I fell in love with Chipotle. The service is fast and the food is great. I love their chicken tacos and burrito bowls and they have tons of other great choices. If you love Mexican food, I would definitely suggest trying  it out!!",
                "reviewer_id": "kwQ7FNfDJ8Jz27EU-_wg0g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20313171428308074,
                    "positive_probability": 0.7968682857169214
                },
                "stars": 4
            },
            {
                "review": "Recently, the prices at this location have arbitrarily climbed (while the prices at other locations have remained static), and customer service has significantly decreased. The burritos, which were already smaller than usual at this location, have shrunk an inconceivable amount (I now get only about half a scoop of meat compared with an ample scoop and a half at other locations), significantly reducing my satisfaction as a customer. I e-mailed Chipotle directly with my concerns and received a copy and paste response almost two weeks after my complaint. Way to go!",
                "reviewer_id": "LDgdBphmFUL3ybeNhd6HIQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008743313021246838,
                    "positive_probability": 0.9912566869787585
                },
                "stars": 2
            },
            {
                "review": "I'm giving Chipotle a 2 only to differentiate them from Qdoba, which is definitely worse, but in a just world this would be a 1.5. The food is only nominally Mexican, meat is dry and not so flavorful, prices not all that reasonable, and the salsa tasteless. There's really no reason to go to either Qdoba or Chipotle with La Bamba and (even better) Los Amigos around.",
                "reviewer_id": "lF64A6ts6_iTByscgixXOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3910325195853942,
                    "positive_probability": 0.6089674804146105
                },
                "stars": 2
            },
            {
                "review": "Gut bomb.Filled with more rice and beans than anything else, so not even really worth the price.",
                "reviewer_id": "p5ht6rQC0NkgdtgY2OlYxg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.41714056121648174,
                    "positive_probability": 0.5828594387835182
                },
                "stars": 2
            },
            {
                "review": "It's a chain so obviously if you have been to a chipotle you know what you are going to get. Great food that isn't bad for you. The location in champaign on green street is always busy with a line to the door. It gets a little frustrating but if I'm craving chipotle I will wait in the line because there is nothing better than a steak burrito with white rice, black beans, pico, and lettuce!",
                "reviewer_id": "qND0y_3FE2MIRkwocUBu_A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9120750203059855,
                    "positive_probability": 0.08792497969401203
                },
                "stars": 4
            },
            {
                "review": "It's a Chipotle. So the food is what you'd expect from any other Chipotle. Don't go at lunch or dinner time because the line winds around the eating area.",
                "reviewer_id": "qR6jQSCWN94STCjsnTU8vQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7728574458052897,
                    "positive_probability": 0.2271425541947123
                },
                "stars": 3
            },
            {
                "review": "Awesome like always!!!! Great healthy food!",
                "reviewer_id": "rgjdVmK5nYVOxrK6YeQJNQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4954744471834872,
                    "positive_probability": 0.5045255528165128
                },
                "stars": 5
            },
            {
                "review": "This Chipotle looks like any other, serving up your fresh, stereotypical Mexican cuisine.  Service: The workers here are a bit terse and pretty inefficient compared to the Chipotles in Chicago.  But then again, there is much higher traffic in Chicago...  Thank goodness I didn't come when school already started...!Food: The quality here is just as good as any other Chipotle :)",
                "reviewer_id": "Ro5cnJ71_VAm52MxJhUjpQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09358087121663329,
                    "positive_probability": 0.9064191287833676
                },
                "stars": 3
            },
            {
                "review": "I was a late bloomer when it came to Chipotle, and I now love it. I regret not eating it sooner. I wish they had more than one location, because if you don't live close to it and don't feel like going on campus at that certain time, you're out of luck. But it's across from an Urban Outfitters, double trouble.I'm a fan of the guacamole, and I think the chips are delicious. My weapon of choice is a chicken burrito, but the tortillas are a little too thin. Maybe my add-ons are just too much, but the thin tortilla never makes it to the end in one piece. Then everything kinda turns into a clusterfuck. But nonetheless, it's very tasty. Line can be long but usually moves fast, friendly staff. Two thumbs way up, holiday fun for the whole family.",
                "reviewer_id": "SWUxYaStkCB-w1k9r2uGSw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11823209233550648,
                    "positive_probability": 0.881767907664488
                },
                "stars": 4
            },
            {
                "review": "Ok, I don't know WHAT they're putting in these tacos or that chicken meat (I think they sprinkling crack on it!) but its soooo addicting and delicious! Now, if I can just get em to speed up the service and quit jippin folks on the meat Annnnnd for all the students to part like im Moses when I come through I'll be in heaven! Yaaaas!!! Love it!",
                "reviewer_id": "Vn0oU-A390Jw-Eh5BXRA6w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.970195626481366,
                    "positive_probability": 0.02980437351863622
                },
                "stars": 5
            },
            {
                "review": "mmmm....I love the Burrito Bowl....I think you get more for your money.  They have their signature Rice with Lime & Cilantro now with Brown Rice.  And I love the Guacomole....Mmmmm.",
                "reviewer_id": "vNhHiztGh3yrcqvZ5Pk5AA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49896398923101637,
                    "positive_probability": 0.5010360107689827
                },
                "stars": 4
            },
            {
                "review": "Let me start this off by saying I LOVE Chipotle.  I could eat it everyday if I could afford that.  I've been to them in Champaign/Chicago/etc.  They're great and deserve five stars.The problem with this Chipotle in particular- THE LINE.  Holy hell.  Everytime I would think to myself, \"I want Chipotle\" I'd look in and see a line wrapping around the building.  Of course I waited in it, but it took forever.  This isn't a one time occuring thing either- there is always a LINE.  I think it's because of the online orders, backing everything up. Either way, the food and everything is still excellent, it's just a long wait.",
                "reviewer_id": "xB73tG8hVIOBTtZ7uYv7hA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006121010408340001,
                    "positive_probability": 0.9993878989591639
                },
                "stars": 3
            },
            {
                "review": "Visited here for the first time a few days ago. I've been to Qdoba many times over the years, but had always avoided Chipotle due to the much longer waits.  I generally avoid campus eateries when students are here, but since it was much less crowded on campus a friend of mine and I decided to take advantage.I wanted to get a chicken burrito (as did my friend), but we were told it would be at least an additional 5 minute wait, so my friend chose steak and I decided to try the carnitas.  I was expecting something very flavorful, but I felt it was rather bland. I chose black beans, medium salsa (wish I had gone with hot now, because medium had no heat or taste at all), and cheese.  Perhaps it would have been better with chicken, but I would have taken a steak queso burrito from Qdoba any day.  I will probably give it another chance if I have the urge to go on campus, but the hype I had heard before going outweighed my actual experience.  Extremely loud, but you kinda expect that on campus.",
                "reviewer_id": "xBejh2J752GEd7fdpMXP1A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015645123852673797,
                    "positive_probability": 0.9843548761473307
                },
                "stars": 3
            },
            {
                "review": "First, let me say that I have Celiac Disease, and so so dining choices are limited. As such, I love Chipotle for their burrito bowls with steak. However, with the recent price increase for steak, I switched to chicken, and have been having Celiac-related issues ever since. I suspect that the chicken breast used in the chicken has broth injected to keep it moist, which may or may not contain gluten. I write this so that people sensitive to gluten can be on their guard, and so that Chipotle can re-evaluate their choice of supplier.",
                "reviewer_id": "YsS_L3UEeY77eHbjVvuAjg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01991170016924701,
                    "positive_probability": 0.9800882998307533
                },
                "stars": 4
            },
            {
                "review": "Worst chipotle experience I've ever had, which sucked, because I love chipotle. Poor / lethargic / disinterested customer service. No chips or fajita veggies. Skimped portions served. Wish I had a better experience because I inevitably feel guilty for being so harsh, but maybe it'll kickstart a more enthusiastic team?",
                "reviewer_id": "zefGFgOpAkK9T5mc_jvgxA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.70978389018574,
                    "positive_probability": 0.2902161098142611
                },
                "stars": 1
            },
            {
                "review": "Yum yum yum, kept hearing about chipotle as soon as I moved here and now I know why. Every ingredient is fresh, and their selection of lime rice is unique and tasty you can get either white or fried. The only thing holding this specific location back is their own success. There hasn't been a time I've gone where the line wasn't stretched past the door. If they could implement more efficient ways of moving the line besides online ordering (which is nice) this is easily a 5 star location.",
                "reviewer_id": "zYajNAnxfJuY6OHyromWjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29052169080881474,
                    "positive_probability": 0.7094783091911804
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "cFivwA18popY5GH2tJtXlQ",
            "ivZo1goh7HXdep03NfA7Cg",
            "cT9uP_Lr5bz6jhIqZPlLcw",
            "iYaDjwYdtqhLMY_tQFRlKA",
            "_dOcOVjrFcIKbMWX1VTdBA",
            "dXLRevtIEnAvjUhPM_zTEg",
            "kLHPR_eUmAsOl-XLJSSO2Q",
            "gVSokyUWqy14UEp_JNVL7Q",
            "RRCF1uUIkmLcQdZauqZJAQ",
            "UBriZt4m5BzkvNqnCeuGmw"
        ]
    },
    "SQASst3NU4tA-t4cmWLILA": {
        "keywords": {
            "bigrams": [
                "hours_closing",
                "chicken_teriyaki",
                "half_raw",
                "lunch_time",
                "raw_chicken",
                "right_lunch",
                "town_probably",
                "typical_subway",
                "find_piece",
                "takes_forever"
            ],
            "unigrams": [
                "subway",
                "hours",
                "chicken",
                "lunch",
                "sub",
                "sandwich",
                "time",
                "eat",
                "closing",
                "half"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB": false,
                "BYOB/Corkage": "no",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "loud",
                "Outdoor Seating": true,
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "SQASst3NU4tA-t4cmWLILA",
            "categories": [
                "Fast Food",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "616 E Green St\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.1105931,
            "longitude": -88.2296109,
            "name": "Subway",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/E2oH_sPeuIzrcmq6QzY43w/ms.jpg",
            "review_count": 9,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "They served me a half raw chicken sub! They also start putting away the seating hours before closing time to discourage more customers. But it is one of the healthiest places to eat and I've always liked Subway, so they get points for that. ",
        "reviews": [
            {
                "review": "I ask for extra olives they put 5 total olives on my sub... And I asked how much do chips cost and they just added it without telling me.... Bogus",
                "reviewer_id": "aFwg0H_4UAXjF5ZiMRM9PA (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23336211760694464,
                    "positive_probability": 0.7666378823930561
                }
            },
            {
                "review": "I ask for extra olives they put 5 total olives on my sub... And I asked how much do chips cost and they just added it without telling me.... Bogus",
                "reviewer_id": "aFwg0H_4UAXjF5ZiMRM9PA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23336211760694464,
                    "positive_probability": 0.7666378823930561
                },
                "stars": 1
            },
            {
                "review": "So one afternoon, stopped by to eat a chicken teriyaki sandwich. Looked pretty good.I have this weird thing of chopping my subs into one bite sizes, so was doing that as usual.after I have half of my sub, I find a piece of chiken..... pink inside.They served me a half raw chicken sub!I mean, I noticed this cause of my weird hobby of chopping my sandwich but if I didn't, I probably wouldn't of noticed. . .  don't wanna think about that.I went to show them that and, they remade me a new chicken teriyaki sub (which was nice) but. . .  I totally lost my appitite and was scared of imagening finding another half raw chicken in my sandwich.There's other subway's in town so probably go to those, never back to this one.",
                "reviewer_id": "bqXUCc9hfAdb8u4MUGhdLA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8506347972121453,
                    "positive_probability": 0.14936520278786358
                },
                "stars": 1
            },
            {
                "review": "The students here are filled to the brim with boredom. I wanted to get myself some sweet tea but they had none. When I brought this up to them, they just didn't care and didn't feel like refilling it.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3185936855178919,
                    "positive_probability": 0.6814063144821072
                },
                "stars": 1
            },
            {
                "review": "On several occasions I've gone in a few hours before closing and they were out of multiple items. Aside from that, they have some good deals and the food is pretty fresh.",
                "reviewer_id": "EOjgKjLbfCssAqcGuBCm3w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.43558672403072723,
                    "positive_probability": 0.5644132759692713
                },
                "stars": 3
            },
            {
                "review": "Another one of those places I go to just because I need to grab a quick eat. Although it's just your  typical subway, the service here is better than what I'm used to at Subways where they just grunt at you about which condiments you would like.",
                "reviewer_id": "m8u49f6BQbnLBPujd6twaQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7617782439062083,
                    "positive_probability": 0.23822175609379193
                },
                "stars": 3
            },
            {
                "review": "Great place for subs while running between classes! Although, there's always a long line right around lunch-time, so get there early or plan on getting a late lunch.",
                "reviewer_id": "NUHLBuQahAhHg9duYTDYLA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19254243729619408,
                    "positive_probability": 0.8074575627038039
                },
                "stars": 3
            },
            {
                "review": "It's great during lunch hours when everything's packed. They work real quick, you're normally out in less than 5 minutes.When it's not lunch time, though... it seems like the employees become really lazy and lethargic. It takes them forever to do anything. They also start putting away the seating hours before closing time to discourage more customers. I mean, there have been occasions when I've walked in about 2 hours before closing and I swear I saw resentment and boredom in their eyes. Oh noes, not another customer. :(But it is one of the healthiest places to eat and I've always liked Subway, so they get points for that.",
                "reviewer_id": "rcHxbGd8_1LeQZk4dRNZaw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45950998401138826,
                    "positive_probability": 0.5404900159886129
                },
                "stars": 3
            },
            {
                "review": "I'm biased b/c i worked here for two years while on campus. But this subway is much cleaner than the one on John St.  However, dont count on them staying open as late as they say on the door. Serving drunk college students is the worst job ever, so they often close before the already drunk pre-bar crowd",
                "reviewer_id": "yvTtxvyU58xefHe-CNhfqQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4366682002696346,
                    "positive_probability": 0.563331799730361
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "yZwl-dXM4SpEDEiihrfZnw",
            "jv-VfERRGsx0-MF7kLj8XQ",
            "j9N_fG1PVCSY-3HY1TRQ5Q",
            "leH24AjTrmcImAbsdh4HFQ",
            "Uw1DZhEtTmLzMcXmdpR8Pw",
            "uhzZM-WwNsaVuvGRjv3mXw",
            "mSTjlawGZcbg8YBQx9UxFg",
            "elwuxXreWA3IVAW5qNOw3g",
            "Fb3Pl0PO_ojEyChkM_SApA",
            "i7lY2Ip8dEIkyuI75vNO4Q"
        ]
    },
    "XMLbJeauBC6DANgNsJO6CQ": {
        "keywords": {
            "bigrams": [
                "fish_chicken",
                "big_portions",
                "guy_counter",
                "mess_fries",
                "customer_service",
                "jj_fish",
                "fish_shrimp",
                "fried_chicken",
                "coming_back",
                "big_jj"
            ],
            "unigrams": [
                "food",
                "fish",
                "chicken",
                "good",
                "fried",
                "fries",
                "friendly",
                "back",
                "wings",
                "price"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wi-Fi": "free"
            },
            "business_id": "XMLbJeauBC6DANgNsJO6CQ",
            "categories": [
                "Fast Food",
                "Fish & Chips",
                "Chicken Wings",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1114 N Market St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "10:30"
                },
                "Monday": {
                    "close": "23:00",
                    "open": "10:30"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "10:30"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "23:00",
                    "open": "10:30"
                },
                "Tuesday": {
                    "close": "23:00",
                    "open": "10:30"
                },
                "Wednesday": {
                    "close": "23:00",
                    "open": "10:30"
                }
            },
            "latitude": 40.126987,
            "longitude": -88.238622,
            "name": "Big J J Fish & Chicken",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/Q3XRDFhbhiW8jCEQwHdjTQ/ms.jpg",
            "review_count": 15,
            "stars": 4.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "When I came into JJ Fish the first time, I felt like I was back at home in Chicago. And best of all DELICIOUSLY FRIED food. Big jj fish & chicken have the best fried fish chicken &shrimpnice friendly guys work there ",
        "reviews": [
            {
                "review": "This was a very pleasant surprise for me and my mom. We both got the JJ sampler and it was way too much food, we could have shared one, but it was outstanding. The price is really good, the portions generous, the grease level and everything is actually very low and the catfish and hush puppies are to die for. My mom, who ate the chicken, said it was very good too and we both enjoyed the coleslaw and fries as well. Overall, no complaints, only compliments to the owners and cooks here. I will be going back when I feel like fast, fried but high quality down to earth food.",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.532175708759405,
                    "positive_probability": 0.4678242912405915
                },
                "stars": 5
            },
            {
                "review": "Great gyros sandwichWhole wingsBretty good friesFriendly serviceMade to orderLike all greasy goods, don't let it get cold. When it's hot, though, it's great. Big portions, too!",
                "reviewer_id": "cz9L3et-Q6ondk4qtRKDEg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3220359986053227,
                    "positive_probability": 0.6779640013946768
                },
                "stars": 5
            },
            {
                "review": "New to the Champaign area I was craving some wings. I could easily have gone to the chain wing stops, or tried something off the beaten path. I'm so glad I did! The wings are massive and meaty, dripping with the sauce of your choice (or on the side, if you prefer). The mild sauce isn't too hot, and has a hint of sweetness.I called my order in and walked out of the establishment in 15 minutes with a huge bag of wings! 10/10 will devour again.",
                "reviewer_id": "DmYGpszKAFWQ8A1viee0vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4481610336480983,
                    "positive_probability": 0.5518389663518972
                },
                "stars": 5
            },
            {
                "review": "I liked this place although the food seems dry and it is halal. Although nice food for fish and fries were tasty.",
                "reviewer_id": "EM3qgcLfUzPU2boJIL77eQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5106506715472876,
                    "positive_probability": 0.4893493284527099
                },
                "stars": 4
            },
            {
                "review": "Big jj fish & chicken have the best fried fish chicken &shrimpnice friendly guys work there",
                "reviewer_id": "eXf9lWsf0-1YClZxRc5_4A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5081894091709762,
                    "positive_probability": 0.4918105908290213
                },
                "stars": 5
            },
            {
                "review": "For the price and the portion sizes, this is as good as it gets in Champaign. So glad I discovered this spot. Their subs are huge and the wings are to die for! Apart from the delicious sauce the best part is that the wings are actually huge and meaty which isn't something you come across even at expensive wing places. The fried chicken is pretty good and crispy as well. The desserts are cheap and pretty decent. The guy behind the counter has always been really friendly. All in all it's been a wonderful experience everytime.",
                "reviewer_id": "goz54FSSoQkvWnElKz__iw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00456901752097212,
                    "positive_probability": 0.9954309824790232
                },
                "stars": 5
            },
            {
                "review": "Very friendly staff. Nice big portions. And best of all DELICIOUSLY FRIED food. I'm going be coming back",
                "reviewer_id": "I1Wv4Z_2nCMtxQ4l9dNQiA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.36928940856864373,
                    "positive_probability": 0.6307105914313558
                },
                "stars": 5
            },
            {
                "review": "Been wanting to check this place out 'cuz I miss the fry-up places in Detroit and Chicago.  Big JJ is pretty dang good.  I got the catfish fillet sammie.  Tasty fish, a tad on the thin side though, covered in a cornmeal batter.  Everything was right about it.  I'd for sure come back when cravings for fried chick'n or fish overwhelm me.They have a decent list of sides, and since I somehow didn't notice fries came included in sandwich price; ordered the fried okra.  Yum!  Can't go wrong there.  Had enough leftover fries n' okra to share pre-dinner \"apps\" with some housemates.Prices here are super reasonable.  It seems mostly a take-out business, as there is very little seating.  It's a tad shabby 'round the edges, as a good you-buy-we-fry shop should be.  Counter guy super nice and friendly.",
                "reviewer_id": "iWcr-TRqIuIXqMpd_MrdrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3517506600989863,
                    "positive_probability": 0.6482493399010051
                },
                "stars": 4
            },
            {
                "review": "Since moving to Champaign from Chicago, I've really come to miss what I would call the \"greasy brown paper bag\" restaurants.  A paper bag filled with a mess of fries and sandwich that are so greasy they leak right through, leaving a dark stain on the bag.When I came into JJ Fish the first time, I felt like I was back at home in Chicago.  The people inside waiting for their food were talkative and friendly, the guy behind the counter was a bit of a jokester with a sly smirk and a warmth to his demeanor.  The air was thick with fried chicken, fish, and grease.For $2.99, I got a freshly-cooked fish sandwich served up hot with cheese, tartar sauce, and a whole mess of fries.  The food was very tasty, but wasn't anything terribly special outside the context.  Given the price, though, and the fact that I got to have a humorous conversation with the cashier, it made it worth coming back a week later to do the same.  Later, I'd like to give the chicken a shot, since it seems to be what most everyone else in there orders.  They must know something I haven't yet discovered.A slice of local Chicago culture a hundred miles outside the city limits.",
                "reviewer_id": "NKbyFkybUzRt4nug1n7nqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0020782270801897053,
                    "positive_probability": 0.9979217729198295
                },
                "stars": 4
            },
            {
                "review": "This place is amazing!!! Eaten there many times and I feel the food gets better everytime!! The fish and shrimp are to dye for!! So delicious!! Service is super quick and the people are very friendly!! Definitely make you feel like home with the best comfort food. Will continue to go there when I am in town!!!",
                "reviewer_id": "rkC0rLl2GpTMsQnPu53mDA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45288448859662517,
                    "positive_probability": 0.5471155114033778
                },
                "stars": 5
            },
            {
                "review": "excellent food and even better customer service.... didnt think when i stepped in that the food would be that great. i was wrong, and damn, the food was fantastic, and the prices, ha cheaper than you could imagine!",
                "reviewer_id": "u0rXaNMS1nEcMewsruQ9XA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6376479644843706,
                    "positive_probability": 0.36235203551562783
                },
                "stars": 5
            },
            {
                "review": "These mutha-suckas! I ordered chicken and it smelled like it had been cooked in Pennzoil. I returned it and shared that they needed to change their oil because it's old. The smurf behind the counter quickly became agitated, and told me it was NOT burnt. I never said it was burnt, I told him it was old and they shouldn't serve carcinogens to the public.He became furious and started slamming things and told me to get the F@ck out. I remained calm, which wasn't easy and told the manager, his brother, I would be happy to leave once I get my money back.  I also explained that I was going to tell all who would listen about how poorly I was treated and never support this chicken shack again!! Please drive past these disrespectful, poultry hooligans and do not support their business,",
                "reviewer_id": "uIRo2g1MN6aSyIaf3xUEbQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010000700137814823,
                    "positive_probability": 0.9899992998621949
                },
                "stars": 1
            },
            {
                "review": "For a fast food restaurant, this place was great. Excellent customer service, short wait time, and fresh, delicious food. Both the fish and the shrimp that I had were really good. I'd definitely recommend this place for someone who wants quick food, in large amounts, at a cheap price.",
                "reviewer_id": "yQZo0tJzB3uBG22d6e_0xA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6812442276152939,
                    "positive_probability": 0.3187557723847051
                },
                "stars": 5
            },
            {
                "review": "Phone in your orders because they're cooking your food to order.My last year of undergrad, I called in so many times the guy knew my voice (when I changed my phone number, he still recognized me).I could eat a half dark meal every day.",
                "reviewer_id": "zlFnsrynYyPu7VuO6CGBmA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28032702723414915,
                    "positive_probability": 0.7196729727658508
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "p7pGpir_7sZZrxmOUV3Leg",
            "PYG1nrz2yYDSQk3W-vYwAA",
            "M2boe4Te0rQ5RasVJkPXng",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "-3GT67Nuddlp4E_Udb3GKw",
            "yZwl-dXM4SpEDEiihrfZnw",
            "9w1FCHEGc2CWBl0nzX-SUg",
            "gVSokyUWqy14UEp_JNVL7Q",
            "3AtlNePpVHC-D1a49LqFtA",
            "SQASst3NU4tA-t4cmWLILA"
        ]
    },
    "Zb2Bqf6MSiSbwIz0GyK7Qw": {
        "keywords": {
            "bigrams": [
                "fast_food",
                "fish_fillet",
                "typical_fast",
                "food_clean",
                "hurry_someplace",
                "causes_problems",
                "find_wrong",
                "parking_lot",
                "probably_ask",
                "cups_lids"
            ],
            "unigrams": [
                "order",
                "mcdonalds",
                "fish",
                "food",
                "parking",
                "restaurant",
                "don",
                "typical",
                "back",
                "lent"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Attire": "casual",
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true
            },
            "business_id": "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "601 N Cunningham Ave\nUrbana, IL 61803",
            "hours": {
                "Friday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Monday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Saturday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Sunday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Thursday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Tuesday": {
                    "close": "06:00",
                    "open": "06:00"
                },
                "Wednesday": {
                    "close": "06:00",
                    "open": "06:00"
                }
            },
            "latitude": 40.1179012,
            "longitude": -88.2042525,
            "name": "McDonald's",
            "neighborhoods": [],
            "open": true,
            "review_count": 5,
            "stars": 2,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Typical McDonald's restaurant. If only they would get your order 100% correct. Back in Cali, you could get Fish Fillets for $1.29 every Friday during Lent. ",
        "reviews": [
            {
                "review": "Large soda is now more than $1.00, although other locations any size is still only $1.00. They have styrofoam cups and the lids don't fit correctly so the first sip you end up wearing it. Every. Damn. Time! Drive thru is very slow; don't stop if you are in a hurry or have someplace to go. Otherwise, it's your typical fast food joint. Meh-I've had much better!",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4813710987408543,
                    "positive_probability": 0.5186289012591434
                },
                "stars": 1
            },
            {
                "review": "Typical McDonald's restaurant. This one has been remodeled. If only they would get your order 100% correct. This is probably too much to ask of them. Causes problems when you order, get back to work and find out it is wrong AGAIN !",
                "reviewer_id": "AaCVSshJ8XUazw8B0yz1xw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6313980809663631,
                    "positive_probability": 0.36860191903363587
                },
                "stars": 3
            },
            {
                "review": "This McDonald's isn't that great. It was the first time I ever asked for a burger only for them to tell me that they ran out of it. Also, the Fish Fillet promotions during Lent suck. Back in Cali, you could get Fish Fillets for $1.29 every Friday during Lent. Here, it's $3 for a Fish Fillet; not much of a bargain there.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7206737928005993,
                    "positive_probability": 0.27932620719939927
                },
                "stars": 1
            },
            {
                "review": "This has got to be the worst McDonalds in the area.  They have certain rules that no other McDonalds has and says its because of the owner.  I have waited 15 minutes in line for my food before and when they took my order...they were super rude.  I didn't even get a HI, when they took my $$$$    ???",
                "reviewer_id": "EP9_bUnduZCaoh5GKEyMMA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9404117883143776,
                    "positive_probability": 0.0595882116856205
                },
                "stars": 1
            },
            {
                "review": "Newer mcdonalds restaurant. Parking lot is a bit long and narrow, so most  of the parking spots are a few extra steps from the door. Otherwise, good fast food in a clean environment.",
                "reviewer_id": "SEkFUnFPCwaCEu3w8fUq8A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3772456667078927,
                    "positive_probability": 0.6227543332921083
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "3AtlNePpVHC-D1a49LqFtA",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "9SFWEreW7wAXB3zYu28r_Q",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "DWZ1_iy-cTeehK5FTiqH-g"
        ]
    },
    "cF2s9dlQ0ZiSDUdH-odoKQ": {
        "keywords": {
            "bigrams": [
                "dairy_queen",
                "money_serve",
                "least_buy",
                "orders_turned",
                "place_walk",
                "gotta_love",
                "know_works",
                "drive_better",
                "staffed_new",
                "ready_order"
            ],
            "unigrams": [
                "dairy",
                "pretty",
                "order",
                "place",
                "food",
                "blizzards",
                "queen",
                "going",
                "know",
                "drive"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "quiet",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false
            },
            "business_id": "cF2s9dlQ0ZiSDUdH-odoKQ",
            "categories": [
                "Fast Food",
                "American (New)",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "911 W University Ave\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Monday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Saturday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Sunday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Thursday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Tuesday": {
                    "close": "22:30",
                    "open": "10:30"
                },
                "Wednesday": {
                    "close": "22:30",
                    "open": "10:30"
                }
            },
            "latitude": 40.116138,
            "longitude": -88.220314,
            "name": "Dairy Queen",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/DNUwH6stHCAlB6d5NPeYZA/ms.jpg",
            "review_count": 7,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Its pretty cool to get ice cream at a drive thru, but you had better be ready with your order when you pull up or they treat you like an asshole. Just your run-of-the-mill fast food place. The food is pretty consistent with what you'll get at other DQ locations. ",
        "reviews": [
            {
                "review": "Staff have always provided good service. I like their blizzards and their cheese curds are actually very good, believe it or not!",
                "reviewer_id": "44GzCA_7s9Xq3kzl2xD1TQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5779082677822579,
                    "positive_probability": 0.4220917322177423
                },
                "stars": 4
            },
            {
                "review": "Gotta love dairy queen  - glad this one has a drive through!",
                "reviewer_id": "ajRNWxjcTHKnpGf5HXzGOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38381913794398015,
                    "positive_probability": 0.616180862056019
                },
                "stars": 5
            },
            {
                "review": "The burgers are pretty overpriced. My favorite thing here is the orange julius. At least buy that if you're going to visit Dairy Queen.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3267214432235368,
                    "positive_probability": 0.6732785567764624
                },
                "stars": 3
            },
            {
                "review": "Its pretty cool to get ice cream at a drive thru, but you had better be ready with your order when you pull up or they treat you like an asshole. Yes, I know how it works, but when there are 60 ways to get any of their 30 items, sometimes I need a little time to sort out exactly what I want to give you money to serve me.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6218586422091364,
                    "positive_probability": 0.378141357790862
                },
                "stars": 2
            },
            {
                "review": "Just your run-of-the-mill fast food place.  Staffed by new people constantly, it's not the best place to walk up to the counter and ask for a recommendation.As far as Dairy Queens go, though, this one is just fine.  My orders have always turned out right, and the blizzards always well-mixed.  If you're looking for a quick, guilty treat, you can get it here.",
                "reviewer_id": "p5ht6rQC0NkgdtgY2OlYxg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3678689984387393,
                    "positive_probability": 0.6321310015612626
                },
                "stars": 3
            },
            {
                "review": "The food is pretty consistent with what you'll get at other DQ locations. The manager/owner guys are really friendly and awesome here, though. I come here often enough that they know what I'm going to order before I order it.",
                "reviewer_id": "YbkPwGiLcrdA2Vx4cjsIeg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20201338572693245,
                    "positive_probability": 0.7979866142730687
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "uJczFcnoK8f9uWgtb0hFGw",
            "gY7617TMFGmPQR2A70L2vA",
            "M2boe4Te0rQ5RasVJkPXng",
            "3AtlNePpVHC-D1a49LqFtA",
            "SQASst3NU4tA-t4cmWLILA",
            "1d5XAAH39FKenV3_9gcFIw",
            "DntkMrzlbFPdOdxJtEWLBw",
            "9w1FCHEGc2CWBl0nzX-SUg",
            "ljsTa0MiQyVfKrgq2FOKdg",
            "PYG1nrz2yYDSQk3W-vYwAA"
        ]
    },
    "fXpuT4mNzxzUZbt--vqzIg": {
        "keywords": {
            "bigrams": [
                "close_building",
                "incorrectly_good",
                "meat_cheese",
                "terrible_employees",
                "depressingly_soggy",
                "customer_service",
                "soggy_footlong",
                "vegetables_incorrectly",
                "block_away",
                "skimp_lot"
            ],
            "unigrams": [
                "place",
                "incorrectly",
                "suggest",
                "sauce",
                "footlong",
                "eat",
                "rude",
                "care",
                "talk",
                "work"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Delivery": false,
                "Good for Kids": true,
                "Take-out": true,
                "Takes Reservations": false
            },
            "business_id": "fXpuT4mNzxzUZbt--vqzIg",
            "categories": [
                "Fast Food",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "701 S Gregory St Ste A\nUrbana, IL 61801",
            "hours": {},
            "latitude": 40.106437,
            "longitude": -88.221653,
            "name": "Subway",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/94AGRcBENNyjwByjPP2B7w/ms.jpg",
            "review_count": 3,
            "stars": 1.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This place has the worst help ever. Rude! Also, if you correct them when they are putting your vegetables on incorrectly, good luck! ",
        "reviews": [
            {
                "review": "They skimp out on a lot of ingredients here. Never enough meat, cheese, etc., but if you want lettuce or sauce, they'll give you tons of that. I've never had such a depressingly soggy footlong. I suggest you go to the Jimmy Johns a block away.",
                "reviewer_id": "gCarnije8roJtcM6VR0rkw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17537889452253816,
                    "positive_probability": 0.8246211054774649
                },
                "stars": 2
            },
            {
                "review": "Pretty much the worst place to eat in UIUC. Bad customer service, terrible employees. Talk more than they work, doesn't seem to care about anyone who walks in.",
                "reviewer_id": "RqDFjGr_GUd-S75BdRLnoQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9096172977038622,
                    "positive_probability": 0.09038270229613878
                },
                "stars": 1
            },
            {
                "review": "This place has the worst help ever. Rude! Also, if you correct them when they are putting your vegetables on incorrectly, good luck! Only go here because it is close to my building.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6835812760284966,
                    "positive_probability": 0.3164187239715047
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "i7lY2Ip8dEIkyuI75vNO4Q",
            "SQASst3NU4tA-t4cmWLILA",
            "L3S29vAyPOxmDZ04AilwnQ",
            "yZwl-dXM4SpEDEiihrfZnw",
            "McjqmrsudvpnVxtYJKSUtQ",
            "j9N_fG1PVCSY-3HY1TRQ5Q",
            "Fb3Pl0PO_ojEyChkM_SApA",
            "WuYyJjMOQ9-mYArlNWlaig",
            "uhzZM-WwNsaVuvGRjv3mXw",
            "VKagKVAGMtIeWaMw1zZLbQ"
        ]
    },
    "gVSokyUWqy14UEp_JNVL7Q": {
        "keywords": {
            "bigrams": [
                "taco_bell",
                "fast_food",
                "answered_order",
                "pack_box",
                "sour_cream",
                "guy_came",
                "order_speaker",
                "making_food",
                "messed_order",
                "part_order"
            ],
            "unigrams": [
                "drive",
                "taco",
                "food",
                "order",
                "bell",
                "service",
                "times",
                "back",
                "guy",
                "fast"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "gVSokyUWqy14UEp_JNVL7Q",
            "categories": [
                "Fast Food",
                "Mexican",
                "Tex-Mex",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1707 S. Neil Street\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "03:00",
                    "open": "07:00"
                },
                "Monday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Saturday": {
                    "close": "03:00",
                    "open": "07:00"
                },
                "Sunday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Thursday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Tuesday": {
                    "close": "02:00",
                    "open": "07:00"
                },
                "Wednesday": {
                    "close": "02:00",
                    "open": "07:00"
                }
            },
            "latitude": 40.096139,
            "longitude": -88.245141,
            "name": "Taco Bell",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/kFAM1twfNHN7a9GNm-xD3Q/ms.jpg",
            "review_count": 12,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "When the other guy came up to the window I asked him why nobody answered the order speaker when I tried to order. The other time, the staff were just smoking right outside the front door, which of course was blowing into the restaurant (you guys here about the smoke-free illinois act? Last night at about around 11:30 I drove through the Taco Bell in savoy and the woman working the drive through was the nicest and most efficient fast food employee I had ever seen. ",
        "reviews": [
            {
                "review": "Went here at 1:05am on the morning of January 6, 2010.The neon sign said \"DRIVE THRU OPEN,\" but nobody answered at the order speaker.  I drove up to the second window and knocked on it until some dude opened it and looked at me like I was going to sell him a fucking vacuum.  I asked if they were open, which compelled him to just turn his head and yell to the other guy in the back to come take his place.When the other guy came up to the window I asked him why nobody answered the order speaker when I tried to order.  High as a kite, he looked me straight in the eye and said, \"Ohh, dats cuz I shut off my headset fo awhile.\"He gave me a large water when I asked for one, which was great, but he didn't put the lid on all the way and I immediately spilled 10 ounces onto my crotch right before the big presentation.This place needs to by mystery shopped.Where's the oversight?  Whoever owns this joint is paying good money for the help to shut all the lights, untuck their shirts and smoke weed out back all night.  God forbid a customer of this 24-hour drive thru restaurant should interrupt the party.Quit smokin' dat chronic by the grease dumpsta an git yo dumb ass back in da kitchen.",
                "reviewer_id": "-mqE7uZSnGEAb_quhfcyJQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9999861598903933,
                    "positive_probability": 1.3840109610954273e-05
                },
                "stars": 1
            },
            {
                "review": "Tried to get drive thru at 1:50am today. I guess they didn't want to make any more food because despite seeing workers walking around no one answered the drive thru.",
                "reviewer_id": "8ufCKZCjsaqf-hhSs3K4eg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6672291187387699,
                    "positive_probability": 0.33277088126123067
                },
                "stars": 1
            },
            {
                "review": "This Taco Bell used to be pretty good, but their customer service has been in a steady decline and Taco Hell would be a more accurate business name. After not receiving part of my order, I called to inform that I wanted to come back later to get it. I also informed that when I was there it seemed very frenetic and hurried which was very unusual. It was then that I was told they lost their store manager, several associates and other various workers because of some 'controversy issue'. Sounds like they have some pretty serious issues, the first being competent help!The manager I spoke to flat out said it would be several weeks before they got back up and running they way they should as they are trying to get people trained. Question - Why stay open? Why not close your doors for a week and get your shit together? Won't you do more damage to the business by serving only half our orders or making them incorrectly or even making us wait for an unreasonable amount of time to even give you our order in the first place?Perhaps this summer they can work their way back to the friendly, fast service they used to have; although I'm not holding my breath. In the meantime, I suggest going to the store and getting items for homemade tacos.",
                "reviewer_id": "99Qos7AunXZnaDogiP847w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010310714072427998,
                    "positive_probability": 0.9896892859275807
                },
                "stars": 1
            },
            {
                "review": "The drive thru workers are always so polite! This location has never once messed up my order and that's awesome. The wait is usually minimal and they're quick to apologize if it takes a bit longer.",
                "reviewer_id": "bAxtV8UYjzlugoQnRe2X0w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45170266276369897,
                    "positive_probability": 0.5482973372363042
                },
                "stars": 5
            },
            {
                "review": "Not one of the better taco bells around.  It looks so beautiful, but they just fall a little short on food quality and service.  I've been here a few times and both times they put way too much sour cream in my burritos (burritos shouldn't be 1/3 sour cream... ewww), and were a little slow on the assembly times.  The staff just don't really seem to care about their jobs.  The first time I went their they guy making my food had his pants down to his knees, and although his shirt was long, it still didn't get down that far... not the guy I'd want making my food.  The other time, the staff were just smoking right outside the front door, which of course was blowing into the restaurant (you guys here about the smoke-free illinois act?).     All-in-all, not so great.",
                "reviewer_id": "cSqolAOfIDsKu3tujDrHBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3565573946372164,
                    "positive_probability": 0.64344260536279
                },
                "stars": 1
            },
            {
                "review": "I have no idea about these bad reviews. I haven't met a single employee here that was less than stellar. Out of a the tons of times my wife and I have been here they have messed an order up two times. Corrected em both without a single blink. One of the times the guy came running out of the store after U.S. Because he caught the mistake before us. 5 stars easily.",
                "reviewer_id": "DJhCX7TvKetUR8aBYZAT_g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4175780944886504,
                    "positive_probability": 0.5824219055113515
                },
                "stars": 5
            },
            {
                "review": "Have been here only once recently, during the middle of the day. Had one of the nicest cashiers. The food is what you would expect.",
                "reviewer_id": "HaRkvzZeWypGBqo5RorbiQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4486276245140443,
                    "positive_probability": 0.5513723754859554
                },
                "stars": 5
            },
            {
                "review": "this has got to be the slowest service in a drive through I've ever seen.  period.  this is after three visits.  the staff is slow and don't seem to care at all.  I sat in the drive through and  literally watched ten cars go through the Hardee's drive through next door in that time.",
                "reviewer_id": "iAjaSKsA1ADUdUaz_REuQg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9389277797703787,
                    "positive_probability": 0.06107222022962512
                },
                "stars": 1
            },
            {
                "review": "2nd best in Champaign, indoor is the nicest but have had suspect orders going through drive thru. 1. Springfield Taco Bell2. Taco Bell by st. Mary's and Kirby on Neil.3. Taco Bell by carle hospital.4. Taco Bell by Olive Garden and McDonald's. That one is the worst.",
                "reviewer_id": "S7Iz8wMuxzrDN2uXEHZlnQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12934350943145873,
                    "positive_probability": 0.8706564905685427
                },
                "stars": 3
            },
            {
                "review": "Friendliest service I have ever seen at a fast food place! I've very rarely ever had any mistakes in my order, and they fix them promptly with a smile.",
                "reviewer_id": "tsdGnnqAm0bfoHpcu7adQw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8325533809831789,
                    "positive_probability": 0.1674466190168197
                },
                "stars": 5
            },
            {
                "review": "I don't like to write reviews for fast food but I feel that I must purely based on one person. Last night at about around 11:30 I drove through the Taco Bell in savoy and the woman working the drive through was the nicest and most efficient fast food employee I had ever seen. Kudos to T bell for hiring this lady. She was quick clear and even friendly. So often are we forced to deal with surely food service employees and this lady made my midnight taco run just a great experience. It's a Taco Bell man, I'm not really going to review the food.",
                "reviewer_id": "twF_2RKnDgJqmKMU3K9A5w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2586463464547047,
                    "positive_probability": 0.7413536535453004
                },
                "stars": 5
            },
            {
                "review": "Service was horrible. Ordered drive thru 15 min at the window.  Got home. 6 min drive, and all tacos were cold. Called and phone is fax line. Worse the screwed up the order.....is watched him pack a box then unpack the box, pack another box then repack the first box.",
                "reviewer_id": "U2mdVa6rOU6SD3Ap2LHMAA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9351630492486401,
                    "positive_probability": 0.06483695075135645
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "2g4mMfy5COvUlzZWfuQkKQ",
            "PYG1nrz2yYDSQk3W-vYwAA",
            "efJQBC6yfKzUvn0Fk08vbw",
            "dXLRevtIEnAvjUhPM_zTEg",
            "LN0mZ37BeruC0XjyhES-ug",
            "_dOcOVjrFcIKbMWX1VTdBA",
            "cT9uP_Lr5bz6jhIqZPlLcw",
            "sPI0AqWHMeJB_UeZ5FRscg",
            "1ZMcQNF-hHL0nJSnh5_a4w",
            "4MeniYcsZrwc_Cq6WSd3zQ"
        ]
    },
    "gY7617TMFGmPQR2A70L2vA": {
        "keywords": {
            "bigrams": [
                "dp_dough",
                "drunk_food",
                "hot_box",
                "late_night",
                "mac_cheese",
                "ranch_buffer",
                "experience_place",
                "cheese_stix",
                "waited_waited",
                "dough_calzone"
            ],
            "unigrams": [
                "calzone",
                "dough",
                "calzones",
                "order",
                "dp",
                "zone",
                "food",
                "place",
                "time",
                "delivery"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": true,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": false,
                "Has TV": false,
                "Noise Level": "very_loud",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "gY7617TMFGmPQR2A70L2vA",
            "categories": [
                "Fast Food",
                "Pizza",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "33 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "02:45",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "01:45",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "02:45",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "00:45",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "02:45",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "01:45",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "01:45",
                    "open": "11:00"
                }
            },
            "latitude": 40.109908,
            "longitude": -88.2412049,
            "name": "DP Dough",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/wR5nlCvPsT4SCu4gA7gw_g/ms.jpg",
            "review_count": 32,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Because that is exactly how you hold/eat a calzone. However, the second time a had DP Dough calzone, I ordered one. Will definitely order again! ",
        "reviews": [
            {
                "review": "somebody is really pissy about his forks and knives........ you could eat it with your hands, like a lot of people.  just a suggestion?   i've had dp dough a million times and it's awesome.  and as for the owner...... he could buffer my zone anytime he wants to.  mmmm mmmm mmmmmm.",
                "reviewer_id": "1rlKa1Q81m4Xph27r6TOAA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8743740871163623,
                    "positive_probability": 0.1256259128836366
                },
                "stars": 5
            },
            {
                "review": "Although I have been ordering DP Dough for over 7 years, they have really turned me off recently. Their calzones are delicious, but their customer service has been dismal the handful of times I ordered from them this summer (2014). They have been rude, or noticeably annoyed/bothered when I placed an order for delivery over the phone and chose to pay with a credit card. Their drivers delivered to the wrong address multiple times, even after I clarified where I was following the first few mistakes. One driver barely said a word to me after I greeted him with friendly words, and ended up handing me a fairly burnt Ranch Buffer. The food is spectacular, I have never had a calzone from any other business even come within range of competing, but you will have to deal with pissed off, overworked college students to experience it.",
                "reviewer_id": "21CdZJje9RKZAsXhTmqvdA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7538764677058892,
                    "positive_probability": 0.24612353229411818
                },
                "stars": 2
            },
            {
                "review": "I can see this place being one of those \"I'M DRUNK, GIMME SOME FOOD\" staples for UIUC students and visitors alike. Had I been drunk when I tried it, this might have been a 5-star review. But here's the lowdown from a sober perspective.Sis & I ordered online, (there were all sorts of deals through the website and through a 3rd party... it was all a little confusing, but the 3rd party actually ended up giving us the better deal) one Safety Zone and one Spin Zone. Delivery time was right on track with what they told us (about 45 minutes). The calzones were in their own labeled boxes, and sis handed me mine (Spin). I opened the box, and then opened the calzone (which was already split in half), and yelled out in horror, \"OH DEAR GOD ITS FULL OF MUSHROOMS.\" You see, I hate mushrooms. I thought I was going to have to make an angry phone call, but it turns out they had put my calzone in the box labeled Safety, and my sister's calzone in the box labeled Spin. An easy mistake, but they really should be more careful about these kinds of things.The food was alright. The crust was a little soggy, and I could have crisped it up in the oven, but I was just so hungry. There could have been more ricotta, but thats my personal preference. 3 stars about sums it up.",
                "reviewer_id": "2SfK5gFyg_y-bpXrTDQ43w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0015184425939680462,
                    "positive_probability": 0.998481557406035
                },
                "stars": 3
            },
            {
                "review": "I never had a calzone before so I was actually a bit nervous on what to expect.  After biting into a hot D.P Dough Calzone, I was hooked.  The calzones are great, and the dipping sauces are even better.  It's not too expensive, costing around $6-7 for a HUGE calzone that can easily be split up into two meals.  The calzones are packed with fresh ingredients, and you can even make your own calzone including up to 5 ingredients of your choice (more at an extra cost).  Most people pass over it too, and while it doesn't look impressive, I definitely recommend paying the extra 60 cents for the garlic parmesean dough.  It adds a ton of flavor.  Much better than the original dough used for the calzones.    Even more surprising, the cookies are absolutely amazing, and HUGE.  I would prefer these over the renowned Insomniac Cookies anyday.  They only cost about $1.50 each, but seriously, the cookie is huge.  Something like a 6-7 inch cookie.  Some days even bigger.  For only a $1.50, it's like 3 to 4 times the size of an insomniac cookie and tastes just as good in my opinion.  They even have a special where you can get two free cookies with two calzones.  Don't skip on the cookies!My only complaint is that one of the workers (who seems to be there all the time) is just always disgruntled and has been rude to customers.  Cheer him up, and there's really nothing to complain about.",
                "reviewer_id": "7JQ8n15WeW4D5AnNulQOCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004174288230538416,
                    "positive_probability": 0.9958257117694647
                },
                "stars": 4
            },
            {
                "review": "Extremely friendly staff! The calzones were pretty tasty too..I ended up getting the ranch buffer which had a really nice Franks hot sauce kick to it. Can't wait to go back!",
                "reviewer_id": "9KL-MU-SUXv1enJMfh7xpA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21277034075016243,
                    "positive_probability": 0.7872296592498371
                },
                "stars": 5
            },
            {
                "review": "This place is the worst. Their customer service was shotty and was acting aggressive when asked to repeat an order. There call service sucks and is assholes fuck them they suck",
                "reviewer_id": "CRDhlvAp10jSXrnkzLY_KA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8118637789421006,
                    "positive_probability": 0.18813622105789676
                },
                "stars": 1
            },
            {
                "review": "Previously this would have been a 4-5 star review but the last two times that I have ordered during the lunch hour  my calzones have been burnt and the fries have been over done (nice word for burnt). I used to love ordering from DP Dough because the food was awesome. Once they get a new cook then I may re-evaluate their resturant but unfortunately right now they are no longer one of my favorite resturants.",
                "reviewer_id": "DGrAXATmf7U21yEUJR4cCg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9157831190617016,
                    "positive_probability": 0.08421688093829957
                },
                "stars": 2
            },
            {
                "review": "I ordered the Hot Box Special, with a Spinner 'Zone (spinach calzone), fries, and a can of Cherry Coke. The total came to $9 with tax.I got a lot more food than I expected, but with less flavor than I would have liked. I was stuffed after eating 2/3 of the calzone, half of the fries, and all of the sauce. There was only a smidgen of spinach (mostly cheese and dough), and since I like tomato sauce, not enough of it. The soda was a splurge since I don't drink it often, but it's really not necessary.I would recommend saving a few dollars by not getting the combo, and instead getting just a calzone and an extra container of sauce for $0.60. That would put it on par with about 3 slices of decent pan style cheese pizza folded up. Think twice about paying more for toppings, because they were inconsequential in my order.Bottom line: I'm not planning on ever going back, but I don't feel sick or cheated, either.",
                "reviewer_id": "E7egcGNMlA2Jh7teIROrlA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9215780259816675,
                    "positive_probability": 0.07842197401832726
                },
                "stars": 2
            },
            {
                "review": "Reasonable drunk food at reasonable prices, plus they deliver. I would never get DP Dough sober, but some love it as late night study food.",
                "reviewer_id": "eIQwlepZ2qgvv3ZnCPfucA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5053062248461286,
                    "positive_probability": 0.4946937751538713
                },
                "stars": 3
            },
            {
                "review": "Restaurant review:Wow this place is simply delicious. I don't know why there are negative reviews. Yes if you order in store, you will have to wait as the calzone's are made to order so expect a while wait. Otherwise this place is well worth it. The calzones, are cooked fresh to order, plenty of ingredients for the stuffing and simply delicious. The best is the hot box deal which gets you a classic calzone, can of pop or bottle of water, and a choice of side. I went with the combat which had pepperoni, mushroom, green pepper, and sausge with spices/mozzarella. I felt there was a perfect mix of ingredients, not too little and not too much. I did not find that it was dry at all and the marina was a great side. I also went with the cajun fries, nothing special here a little soggy by the time I had to eat it. They also have other promotions where you can get a calzone and cheese stix for 10 dollars which is enough for 2 people to share. I did have to wait 10-15 minutes for my order with no one else in the shop so I would recommend ordering online or call ahead. Staff was friendly otherwise.Pro: Fresh made to order calzone, the hot box or zone/stix is a great deal, free parkingCons: Very long wait time if you decide to order in store, your best bet order onlineHidden gem:Everyday specials like the hot box and zone/stix are the way to go.",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05852588699329769,
                    "positive_probability": 0.9414741130067028
                },
                "stars": 4
            },
            {
                "review": "Perhaps some day, I'm going to bring my children to my alma mater, the U of I. I'm going to show them the buildings and where I lived and all the things that I experienced as an undergraduate here. And when my tour winds to a close, I will take them to the place that supplied me with countless nights of late night munchies. The place that gave me something delicious to believe in, a place that never disappointed me when I opened the box. Some day, I'm going to take my kids to DP Dough.DP Dough itself is not really a restaurant - it is primarily for us cyber monkeys who do everything through the Internet, especially in ordering food. The restaurant itself has a small seating area that is almost always empty, and has exactly four seats.Now to the important part - the food. Every calzone that comes out of this place is first placed at the altar of the calzone gods and given a proper blessing. Only then does it become fit for human consumption, at which point it has spontaneously morphed from an ordinary calzone into a holy image of the calzone gods themselves. The dough is baked to a perfect crisp, and all that is contained within the dough is molded from the sinews of something superhuman. These calzones have never disappointed me, and it makes me happy to know that they never will. And unless they take down their altar to the calzone gods, my children will not be disappointed either.",
                "reviewer_id": "fYG-KkAay8x4YniEz_Uxpg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0040501934281355605,
                    "positive_probability": 0.995949806571875
                },
                "stars": 5
            },
            {
                "review": "As study-binge food goes, DP Dough is a good choice. No pizza, but their calzones are just as good and they have a huge variety of options. Their wings are baked instead of fried, which means its a slightly less guilty treat and they are actually quite delicious. The surprise here? Their fresh-baked cookies are actually better than the better-known Insomnia Cookies. Big and chewy, they make a great dessert after you binge on wings and calzones.",
                "reviewer_id": "HqaXK9toBpQdcz-0-rVwKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15903788048248108,
                    "positive_probability": 0.8409621195175155
                },
                "stars": 4
            },
            {
                "review": "I am crazy for a good calzone.These aren't anything to get worked up about.The fillings are fair (though I'd love to see green olives on the menu). The crust was very dense--too dense. Maybe not cooked well enough. All the other calzones I've ever had had a nicely browned, semi-crispy top. This one was almost the consistency of Wonder Bread. Top this with a super bland marinara sauce, and you've got a mouth full of disappointment. The cheese sticks were pretty tasty. If anything else about our order had been up to snuff, we would have thought of ordering these again.The apple pie sticks are a waste of your life. Just burn some cheap, whole-wheat toast and pour some canned apple pie filling on it.",
                "reviewer_id": "iJ3JSCx0Y-XTIcYMWLQQKg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.999765677122908,
                    "positive_probability": 0.0002343228770984858
                },
                "stars": 2
            },
            {
                "review": "DP Dough... My first impression of this place was not so nice. Fist time I had their calzone, I went to their place to pick it up. The place looked bit unsanitary and I noticed that not everybody was wearing gloves or had aprons.However, the second time a had DP Dough calzone, I ordered one. And yes, they do deliver to far destinations and work 24/7. So when you're hungry at 3am in the morning, DP Dough is what you should go for. I know that they have wide selection of calzones. However, I have tried only one kind, the \"Ranch Buffer\" couple of times. I remember it was pretty good (especially after several beers). I highly recommend trying it.",
                "reviewer_id": "iTFVKYQC0MnoPx-3NnngqQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3962709815428793,
                    "positive_probability": 0.603729018457118
                },
                "stars": 3
            },
            {
                "review": "Ben Wyatt would not approve. I ordered a firecracker calzone for delivery, paid 15% tip and my total was $10.92. It was just barely warm when I received it and the box was all soggy from the condensation. I had maybe 5 jalapenos in the whole 'zone. The sausage is super weird and leaves a terrible aftertaste. I think I've developed TMJ from the amount of effort I had to put into chewing the crust. This was my first and only time trying DP Dough. My mouth now tastes like a spicy armpit and I am not impressed.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4063686595975667,
                    "positive_probability": 0.5936313404024331
                },
                "stars": 1
            },
            {
                "review": "Don't understand the many negative reviews. DP Dough is fantastic and one of the only places in the area to get a good calzone. They frequently run deals ($5.50 calzones) through online ordering and you get A LOT of food. The calzones are incredibly fresh and filling. It has that \"drunk food\" reputation, and don't get me wrong it fits that bill as well, but it's fantastic in any state. Don't plan on dining in, however. They have a tiny awkward little counter that you hypothetically could eat at, but you'd be the first person I've seen doing it.",
                "reviewer_id": "MoiZy7jP2pGl1HObuvXjnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002572705723308861,
                    "positive_probability": 0.9974272942766982
                },
                "stars": 4
            },
            {
                "review": "DP is good cheap fast food. We order from my work all the time and the guys always get there before you expect them. Our large orders are always correct and the people are friendly. What more can you ask for.  I recently put in a delivery order for my home, they delivered it without any problem even though I am out of their delivery range. I was impressed and happy.",
                "reviewer_id": "mSS7qVG507owGXmgvDPxaA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4648960148623677,
                    "positive_probability": 0.5351039851376328
                },
                "stars": 5
            },
            {
                "review": "They falsely advertized a $1.99 Zone calzone deal through EatStreet.com on the U of I campus.  They posted flyers saying you need to order through the EatStreet site, but then bait-and-switch you with a price that's 50% higher on the website.  Skeezy time-wasting business-practices deserve one star and no patronage.",
                "reviewer_id": "n0u4JrMQlIYKWeQTCp0Gzg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.263612310121848,
                    "positive_probability": 0.7363876898781511
                },
                "stars": 1
            },
            {
                "review": "Good food. Awful service stick to delivery if you have to actually deal with anyone in the store it will certainly detract from your experience! They were very rude and made me feel guilty for asking them for service!",
                "reviewer_id": "patOau5_Kpk7X1lfnjDg1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.030738709950349167,
                    "positive_probability": 0.96926129004965
                },
                "stars": 2
            },
            {
                "review": "Today our order took an hour and a half to get here, and once it got here the chicken wings were soggy and cold. The calzones were undercooked. And on top of it all one calzone was missing, and we were offered only a refund or a calzone (2 hours after our order was placed).",
                "reviewer_id": "RarL3sbREEKqOeZOZNz9tQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8914051498854251,
                    "positive_probability": 0.10859485011457516
                },
                "stars": 1
            },
            {
                "review": "The zones' are definitely worth the price. A calzone and a soda special during lunch for $6.50. And it actually tastes pretty good. But I will never dine in again because of the cackling hyena that works behind the counter. The entire time she was laughing and talking about her life with more cackling. I even looked around a few times to make sure I wasn't in a scene from the lion king.",
                "reviewer_id": "RIm1bAmmLSJcmV874ryPMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.029926736343866583,
                    "positive_probability": 0.9700732636561314
                },
                "stars": 3
            },
            {
                "review": "To the Knife-and-Fork person (\"P.S. According to my friends, the \"DP\" stands for double penetration... and that will likely be your experience with this place.\"): So you're saying any experience with this place will be a gang bang? Nice try, but A) that doesn't even make sense, and B) NO pizza, calzone or wing place in a college town supplies forks and knives -- why would they? Would you eat a sandwich with a knife and fork? Because that is exactly how you hold/eat a calzone. What a petty thing to be critical of...Anyhow, I LOVE D.P. Dough. Their calzones are incredibly fresh, and there's a TON of variety. If you should decide to build your own, there are at least 25 different ingredients to choose from, as well as different crusts and dips. I've ordered delivery (to downtown Urbana, which is a far cry from their brick-and-mortar facility) from them several times now, and it's never taken more than 45 mins. The delivery people have always been super friendly, too.D.P. Dough has definitely been one of the better dining experiences I've had in the area -- certainly the best delivery experience.",
                "reviewer_id": "Ryc96UFlIPNiPr9Md3gzZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14931240864568038,
                    "positive_probability": 0.8506875913543163
                },
                "stars": 5
            },
            {
                "review": "I will never ever come back to this pathetic attempt at a D.P dough. I say this attempt because the DP dough in normal is simply fantastic. The food is great, the staff is amazing, and I've never ever had a bad experience. However this location is by far the armpit of the chain. Where do I start with this walking crap factory? How about the guy behind the counter. So if you want to blast music in your work place I'm very okay with that, especially if it's 90s alt rock. What I'm not okay with is an employee who doesn't even attempt to speak up when you ask a question. He stood there looked at me with the dumbest face and mumbled his response. What was my question? I asked, \"Do you guys still make the hot dog and Mac and cheese one\" his response, \"yeah\". Couldn't hear him but I assumed that's what he said. My girlfriend ordered the Reggie. And then he looked at me waiting for me to order and I said the hot dog and Mac and cheese one we just spoke about. He then mumbled the order total, couldn't hear him again so I just handed him my card. The wait. 20 minutes for 2 calzones. As we waited I watched the beautiful machine at work. 6-7 guys all of them college aged walking around some of them half asleep some of them couldn't care less what they were doing, if one of them was a manager I sure as hell couldn't tell. So we waited and waited and waited and waited. And finally the food came!!!The food. Okay so I'm pretty sure the people that work at this dp dough have never seen a calzone before because the thing was more breading than meat. The thing was flat, burnt, had holes in it, and it was guess what, not what I ordered. Instead of the hot dog and Mac and cheese I was given the pulled Pork and Mac and cheese... So this all could have been avoided if the guy working the counter A. Cared about his job B. Spoke up in a loud room C. Wasn't apathetic about his job D. Had any sense of manners E. Wasn't hung over or possibly stoned. Or F. All of the above. The answer is F and that's what I give this rotten hole of an establishment. I will never return and I will do everything in my power to dissuade people from coming to this place. I guess I was spoiled in Normal with, you know a DP dough that didn't suck complete and total ass.",
                "reviewer_id": "twF_2RKnDgJqmKMU3K9A5w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9995348378288808,
                    "positive_probability": 0.00046516217110377614
                },
                "stars": 1
            },
            {
                "review": "Some great drunk food! Got the buffalo zone and it was delicious or so I thought? We did order really late and it kind of took forever and what made me mad was that some of our friends ordered after us and got it before us!",
                "reviewer_id": "U6vVYCZapANVwvmiE4N9tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19026715015935095,
                    "positive_probability": 0.8097328498406511
                },
                "stars": 3
            },
            {
                "review": "I have probably been to DP Dough more than any other eating establishment in my life. This was mainly due to the fact that it was pretty cheap, close to my apartment, and satisfied every drunken desire that I had. Because I went there so often, I knew what worked for me and what did not work for me. I was a big fan of the Black & Blue (tastes like a burger with blue cheese), the mangus (pesto and pepperoni), the titan (pesto and pineapple), and the buffer zone (blue cheese, hot sauce, etc). There was only one or two times where I was not completely satisfied with any of these. My friends were all big fans of the Barbecue Chicken zone. I have eaten it twice. The first time I was less than satisfied because of all the hype, but the second time I was happy with my decision. For the most part, the calzones were delicious. There were a couple times where they may have been a little undercooked, but I preferred that over being burned to a crisp.As for cons, there are times where the service is very slow. This is mainly because as a \"drunk food\" establishment, people normally order between the hours of 1-3 AM, when this place is bumpin'. It will generally take 30-45 minutes when you order at this time to get your food so plan accordingly otherwise you will be forced to observe the happenings at Green Street Cafe. Other issues people may have with the staff. I would not say that any interaction I have had has been particularly friendly, but I always just took that as how the environment there was.DP Dough was a large part of my collegiate experience and I have no regrets about all the money that I spent there.",
                "reviewer_id": "uphXQHsSvH2NZCwCi5kvZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0678765197648006,
                    "positive_probability": 0.9321234802352113
                },
                "stars": 4
            },
            {
                "review": "DP Dough is a lifesaver.  They have a big selection of calzones, and on the off chance you don't see one you like, you can also custom design one (known as \"Construction Zone\" where you can have up to 4 ingredients).  Personally, my mouth just waters whenever I look over the menu and have to remember that these things are very filling so I can't order the 5 different calzones I'd like to try.  I'm trying to work my way through the list, but so far my favorites include the Testing Zone (breaded chicken, pesto, mozzarella) and a combination of the Veggie Zone and Parking Zone (broccoli, breaded chicken, mushrooms, mozzarella).All the calzones are made fresh the moment you order them, are absolutely delicious, and only cost $6.  They're definitely perfect for when you need got the munchies, are studying late at night, or when you discover you're actually really hungry after a night out at the bars, and even better?  They deliver late!!!Monday - Wednesday until 2amThursday - Saturday until 3amSunday until 1amThey do lose some points for their turnover time though.  It takes them upwards of an hour to get the food delivered to you - the reason for which is because they need to make and bake your order first before they can get it out to you.  The plus side to this though, is that your calzone arrives fresh and piping hot with the cheese in the middle still oozing out when you take a bite.",
                "reviewer_id": "urDog6OhPoNKPJFUDob7AA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.018469960963945816,
                    "positive_probability": 0.9815300390360434
                },
                "stars": 4
            },
            {
                "review": "*Sigh*I placed an order with DP dough, and they forgot to include a knife and fork both times.I think at the basic level, ordering an empanada (like a Pizza Hut P-zone) requires a fork and knife. Now when I've also ordered a side salad, doesn't it REALLY make sense to include a fork at the least?At the suggestion of a co-worker, I called the store to let them know. The guy working at the time claimed that my two-for-two experiences with no fork/knife were \"the only two times he's ever heard of a customer not getting them\". Yea right.Goodbye DP Dough. You may dump loads of money into lame T.V. commercials, but your just-plain-OK food coupled with horrible logic and an apparent deficit of plastic forks and knives is unacceptable.P.S. According to my friends, the \"DP\" stands for double penetration... and that will likely be your experience with this place.",
                "reviewer_id": "wXUGRiQf9R3ypeOB6B3pSw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9990455960933443,
                    "positive_probability": 0.000954403906649711
                },
                "stars": 1
            },
            {
                "review": "My boyfriend, in his haze of sickness, committed to bed rest on a limited diet, suddenly sat up and said, \"Have you had DP Dough?\"  I had no idea what he was talking about.Apparently calzones are the cure for all ills because he got up and told me to look up the menu and that we had to go - and he was right.  Oh my gosh, DP Dough's calzones are good! Namely because I haven't had many opportunities to try calzones!We ordered three calzones that lasted for two days:Combat 'Zone (pepperoni, sausage, green pepper, mushroom & mozzarella) which was a solid calzone but not my favorite.End 'Zone (steak, onion, green pepper and mozzarella) that I wanted to steal from my boyfriend because it was technically his.Maui Wow (ham, pineapple & mozzarella) my favorite! You must get this!Each calzone was made with white flour, and came with a nice cup of tomato sauce that I wished was twice as big.The menu is huge so I plan to go back for more 'zones, and to try them made with the garlic crust.",
                "reviewer_id": "XOnwygK-EerILmQSxP2K6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3120247601194573,
                    "positive_probability": 0.6879752398805487
                },
                "stars": 4
            },
            {
                "review": "We ordered delivery on a late-ish Saturday night through the online ordering system which was fairly easy to work.They have a wide variety of calzones and toppings to choose from. We ended up going with a \"double play\" which was 2 zones and cheese stix for about $16, although we added some options to our zones that increased their price by at least $1 each, also the tax, delivery fee and tip, this dinner ended up being pretty pricey at over $24.Delivery time itself was fairly quick, about 45 minutes. Our food was fairly hot and everything looked to be correct as far as what we ordered goes, which was a pepperoni & sausage zone as well as a maui wawi zone.I was not impressed overall, though. The zones themselves are a fairly large portion, with a crispy crust, but the insides were mostly cheese and the amount of meat wasn't nearly much as I expected. I also didn't like how the sauce comes on the side, more like a dipping sauce as opposed to a pizza topping. Not only did I run out of side sauce, but I feel like the entire inside of the zone was kind of bland due to being just meat and cheese. The meats were not that tasty, either, kind of lacking flavor, and probably not of high quality. The cheese stix we got with our order were just okay too, I did like the crispy bottom but they tasted quite similar to my zone.You can't deny DP Dough is ideal drunk food, but I didn't particularly care for it on a more sober Saturday night without any coupons or Hooked/local deals. I would have rather gotten a Papa Del's deep dish for comparable money.I think if this place narrowed their menu and focused more on simple, quality/fresh ingredients, I would probably give it another shot.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001487123282200927,
                    "positive_probability": 0.9985128767178084
                },
                "stars": 3
            },
            {
                "review": "I used to order from here about once a week.  One day they told me they don't deliver where I live, and were really busy and didn't know what to tell me.  I didn't plan on calling back until they put coupons on my door advertising delivering there.  When I called and ordered they told me it would take longer to deliver since I wasn't in their delivery area.  How does that make sense?  It is good, just hope you are in the delivery area, or its a good time for them to bring you what you order.  Heaven forbid a delivery place delivers when they are busy.",
                "reviewer_id": "ZAqdYbYE9K8vGmPc3lA8cg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05973356656321136,
                    "positive_probability": 0.9402664334367872
                },
                "stars": 1
            },
            {
                "review": "SO and I ordered again, and the calzones were much greasier this time and generally less tasty. We also tried the cheese bread sticks which neither of us liked.",
                "reviewer_id": "ZjxfO0xvmxZ7BiNUg7ejjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21608781614120323,
                    "positive_probability": 0.7839121838587987
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "EMjKhNWBprdlb5Obcia2uA",
            "AEqvyxNHm3YFzArBinr2_Q",
            "OkNhrobZUhpybZlpHAA_bQ",
            "yTlW8Xh1wPpvHBl3dGz9mA",
            "KGGYlneCtF4xQT9T5eKV5g",
            "qUWDPFWaW0fOY66lL0diqg",
            "M73ttBKGZsw1Jg0XbNuKsw",
            "RbThUOAzsx7am1xaft29zg",
            "R-0IVFEKseAL9wYgIhPy1w",
            "zMN8UGd1zDEreT58OCdnyg"
        ]
    },
    "i7lY2Ip8dEIkyuI75vNO4Q": {
        "keywords": {
            "bigrams": [
                "general_branch",
                "buffalo_chicken",
                "absolutely_terrible",
                "single_time",
                "love_subway",
                "chicken_sauce",
                "customer_service",
                "american_cheese",
                "felt_sorry",
                "throws_sandwiches"
            ],
            "unigrams": [
                "subway",
                "job",
                "time",
                "chicken",
                "rude",
                "branch",
                "sub",
                "customer",
                "people",
                "employees"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Delivery": false,
                "Good For Groups": false,
                "Noise Level": "loud",
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false
            },
            "business_id": "i7lY2Ip8dEIkyuI75vNO4Q",
            "categories": [
                "Fast Food",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "45 E University Ave Ste 101\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.11566,
            "longitude": -88.241458,
            "name": "Subway",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/40YGPv57DKbePWd_daxZvg/ms.jpg",
            "review_count": 7,
            "stars": 2,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "It's been the same 4 people every time I go. But seriously subway makes the worst chicken. I got a breakfast sandwich and they had one egg left. ",
        "reviews": [
            {
                "review": "I'm the President of Ditto Advertising and hardly ever leave a review but I stopped in after a meeting and Paul was very gracious to a very rude customer. He later went to find her to see if she was satisfied with the outcome and she made a scene in front of the hundred passengers.  Good job Paul for being the bigger person and representing Subway well.",
                "reviewer_id": "3a0FbXAGzJvHTlpwj8MxvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.031646798388920885,
                    "positive_probability": 0.9683532016110832
                },
                "stars": 5
            },
            {
                "review": "I went to this location at prime brunch time. They only had one worker who was openly talking to customers about how much her job sucked and she wanted to walk out. It made people feel uncomfortable and no one felt sorry for her. I got a breakfast sandwich and they had one egg left. The sandwich wasn't good and i waited at least 20 minutes. Overall VERY unsatisfied and will not return.",
                "reviewer_id": "5tWK_KgdvM5utpPdlQd8dg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4185267569623251,
                    "positive_probability": 0.5814732430376698
                },
                "stars": 1
            },
            {
                "review": "This Subway is absolutely terrible.  I like subway and it's food in general, but this branch is completely ruined by absolutely terrible service and quite possibly the worst employees I've ever seen at a food establishment.Now, I've been here about 20-25 times since it's only a block away from my work (and it's one of the healthiest things to grab nearby), and the same damn issues are present every single time.  I've now stopped going completely since I can't stand this branch.First off, they are always out of ingredients or bread.  I usually get the chicken breast foot long sub.  There had to be at least 10 occasions I went and they had no chicken breasts.  It's also not uncommon for them to be out of bread, and common ones too.  No wheat, no Italian?  There's been a few instances where all they had left was something obscure like Monterery Cheddar, and this isn't some off hour.  Its usually right during lunch!   I can understand once or twice, but you think they would take action to stop this from happening since it seems to happen ALL THE TIME?  Anybody ever think to make more bread???They have been out of tomatoes, out of peppers, onions out of cucumbers... It's ridiculous.  The worst part is they act rude instead of apologetic.  \"WE DONT HAVE THAT...\"  ok.... no need to yell at me there.... Honestly though, the worst part are the employees.  It's been the same 4 people every time I go.  The least worse of the bunch is the manager.  She is an older lady, and while generally nice, there have been days where she has been outwardly disgruntled, and talked to customers rudely, looking as she was almost ready to snap, but usually she is able to keep it shelled in... The other employees, *sigh...There's two younger girls who work there.  They have never been rude, but they work extremely lethargically.  They often keep asking what you want, and take a long time to put your sub together.  They really need to pep up, because they just act like it's killing them to be there...  Maybe it is killing them, but you work a customer service job, you got to perk up!The last employee that works there is a young male and he appalls me every single time with his actions.  I really have no idea how he still has a job.  His behavior is ridiculous. He is probably, and consistently, the most disgruntled employee in the entire world... He throws sandwiches together like they were no better than mush.  He doesn't change his gloves often so I have had far too many sandwiches with buffalo chicken sauce, oriental sauce, etc etc on my sandwich.... Yea, big no no.  Thank god I don't have allergies, but hot buffalo chicken sauce definitely does not taste any what appetizing smeared all over my cold cut either...It  doesn't stop there.  He rants about his job to every single customer.  No one even asks him, yet he is constantly letting you know how badly his job sucks and how he can't handle it.  It's like sheesh man, we all worked crappy jobs at some point, but that attitude sure isn't going to get you anywhere....  It's not even something like a dreary \"Man, I'm having a rough day...\"  It's more like a resentful \"God! why do so many damn people have to come in, I can't believe this shit... AGHH KILLLLL MEEEE PLEASE.\"No lie people.... that is what he does, and that is why I get so bothered by it.  In some ways, he acts like so much of a trainwreck it's almost amusing to watch his anger grow.  I've had my fair share of watching him throw stuff, bang his head off a wall, and even once scream \"F*** my life!!!!\" during the middle of making a sub after he dropped the bun on the floor.  Still, for as funny as it could be, it's just plain rude.  He has made fun of customers several times, and his constant whining gets on one's nerves way too easily.  He acts like he is the only one with problems in his life...All and all, I love the Subway chain in general, but this branch has serious issues.  The service is terrible, and the staff is rude and downright horrendous with the way they act.  I still love Subway, but I will never go to this branch again.",
                "reviewer_id": "7JQ8n15WeW4D5AnNulQOCQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9016071897853299,
                    "positive_probability": 0.09839281021467733
                },
                "stars": 1
            },
            {
                "review": "I showed up here when they were supposed to open at 7AM for breakfast but they didn't open till 7:08. I asked for a toasted breakfast sub with Black Forest Ham, American cheese, their yellow Egg concoction (about a week old usually), onions, cucumber, and peppers. I keep forgetting that subway American cheese is white, I should have just gotten their cheddar.The toasting was poorly done and the customer service was pretty bad. Needless to say I'm not impressed, in fact -to help potential patrons: I'd like to let you all know that the juices in store cost $1.49-$3.15 but you can get more variety juices from the vending machines for $1.25.",
                "reviewer_id": "er4OtwOrNz3CmFvpbDECZQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9997186216840166,
                    "positive_probability": 0.0002813783159770151
                },
                "stars": 1
            },
            {
                "review": "Nice outside seating! But seriously subway makes the worst chicken. I'm really not picky about what goes in my mouth but wow I almost threw away my chicken salad.",
                "reviewer_id": "F5RtyAOJXpHGtwGR100YrQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9563500245990586,
                    "positive_probability": 0.043649975400942065
                },
                "stars": 2
            },
            {
                "review": "Very dirty...trash all over the floor on saturday 02/14/15 about 12:00pm. Fresh out of the oven bread placed next to the trashy floor.Ordered a sandwich and the girl had to throw out the meat that was in the bin...\"it looked bad\"...wonder how long it was there. Very difficult to place the order because of the constant banter between the 2 employees.Horrible place compared to other Subway's in town.",
                "reviewer_id": "pisvCyFbHp11asyoxiv2Aw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7347821541710648,
                    "positive_probability": 0.26521784582893954
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "SQASst3NU4tA-t4cmWLILA",
            "fXpuT4mNzxzUZbt--vqzIg",
            "L3S29vAyPOxmDZ04AilwnQ",
            "yZwl-dXM4SpEDEiihrfZnw",
            "McjqmrsudvpnVxtYJKSUtQ",
            "j9N_fG1PVCSY-3HY1TRQ5Q",
            "79hY0d7j45ZRjTAB2d0jQQ",
            "Uw1DZhEtTmLzMcXmdpR8Pw",
            "leH24AjTrmcImAbsdh4HFQ",
            "WuYyJjMOQ9-mYArlNWlaig"
        ]
    },
    "ljsTa0MiQyVfKrgq2FOKdg": {
        "keywords": {
            "bigrams": [
                "time_got",
                "bbq_sauce",
                "relatively_clean",
                "put_fries",
                "pretty_good",
                "service_average",
                "pleasure_know",
                "problems_giving",
                "leave_work",
                "back_ask"
            ],
            "unigrams": [
                "mcdonalds",
                "time",
                "order",
                "large",
                "mcdonald",
                "fries",
                "sauce",
                "meal",
                "come",
                "back"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": true,
                "Good For": {
                    "breakfast": true,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "free"
            },
            "business_id": "ljsTa0MiQyVfKrgq2FOKdg",
            "categories": [
                "Burgers",
                "Fast Food",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "1605 S Neil St\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.0975069,
            "longitude": -88.2452826,
            "name": "McDonald's",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/itm90lVuG3GAXzwgg-b4Ag/ms.jpg",
            "review_count": 11,
            "stars": 2.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Service can range time to time, but that's expected with fast food. I would recommend the dollar menu, as you can get a McChicken, McDouble, large fries, and a large drink for only $5 total. I hate this McDonalds. ",
        "reviews": [
            {
                "review": "I only use the drive through at this McDonalds.  3 of the last 4 times I've been the order has been wrong.  I only ever order a large diet coke regardless of the meal and once was given a medium something else.  Even when I told her what I'd really ordered she gave me SERIOUS attitude about making it right, even though I had the receipt that showed I'd paid for a large.  Twice for breakfast I've ordered an egg mcmuffin meal and one time got a bacon egg & cheese the next time I got 2 yogurt parfaits.  I didn't realize either time until I got to work.  I called the last time it was wrong and they said \"well do you wanna come back\"  SERIOUSLY.  I'm guessing they can't leave after work stars and neither can I.  Done with this McD's.  There's a Hardee's half a block away and I'll just head there from now on.",
                "reviewer_id": "6nCuP3lx1ibS4sBCdzuGHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2501364276793408,
                    "positive_probability": 0.7498635723206504
                },
                "stars": 1
            },
            {
                "review": "McDonalds is generally McDonalds.  The food here is fine, but service/atmosphere is lacking.  They seem to have some sketchy clientele (almost saw a fight break out here once).  Also, they have very strict BBQ sauce quotas. Unless you buy mcnuggets or chicken selects, they make you pay for any bbq sauce you want ($0.25/pack); I think it's sort of ridiculous  that you can't get free bbq sauce with your chicken sandwich.",
                "reviewer_id": "cSqolAOfIDsKu3tujDrHBw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5359620571388026,
                    "positive_probability": 0.46403794286119937
                },
                "stars": 2
            },
            {
                "review": "It's not much different from most other McDonald's. Even if they are really busy, I still get my food fast and accurate. Customer service is average.",
                "reviewer_id": "EOjgKjLbfCssAqcGuBCm3w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3359077456232566,
                    "positive_probability": 0.6640922543767434
                },
                "stars": 3
            },
            {
                "review": "It's McDonald's. Enough said. Service can range time to time, but that's expected with fast food. Always make sure you have everything in your bag after ordering, and just go back and ask if not - no big deal. I would recommend the dollar menu, as you can get a McChicken, McDouble, large fries, and a large drink for only $5 total.Here's a tip - If you order any sized value meal, you can upgrade your drink to a large free of charge because all drinks are $1!!!",
                "reviewer_id": "g2iRQXHSHMGmOkJ8ilfpKg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7861475723035886,
                    "positive_probability": 0.21385242769641183
                },
                "stars": 5
            },
            {
                "review": "I had the number one. It took as long as it normally does for a human being to assemble a Big Mac, put some fries in a container and place it on a tray. The coke from the fountain was fine.After I finished the meal,I went back to the counter and ordered a \"mcflurry\" which was pretty good as well.Thank goodness for McDonalds. This is why America is awesome.I even used the restroom, which was relatively clean, considering how crowded the place was on a Monday at 2:30 in the afternoon.",
                "reviewer_id": "Kw9eJS6psAkpl5jGi5-h9A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0166442007469323,
                    "positive_probability": 0.9833557992530672
                },
                "stars": 4
            },
            {
                "review": "I know no one reviews McDonalds, but this drive through is seriously awesome. It has two lanes... and back home, only bums go to Mcdonalds...  but this mcdonald's poppin'!! It's where all the cool kids hang out, and I have no problems giving in to this guilty pleasure.",
                "reviewer_id": "m8u49f6BQbnLBPujd6twaQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8217432399162037,
                    "positive_probability": 0.17825676008379765
                },
                "stars": 4
            },
            {
                "review": "The worst quality McDonald I have been to. My McChicken only comes with one slice of bun.........The other side is missing. The server gave us the wrong nugget sauce and forgot to put our fries in the bag. Terrible service and  management.",
                "reviewer_id": "n5-f2vdFkJlWXnOP5IuyEA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8618457278668434,
                    "positive_probability": 0.13815427213315884
                },
                "stars": 1
            },
            {
                "review": "ok so we all know that mcdonalds is awesome. there's nothing i can complain about. EXCEPT that here, they tell you they gave you a straw in your bag but you look in it after you drive away and it's not there. Liars!",
                "reviewer_id": "pZ-LeYl4t_p-YU6IjBHGBQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7691944897110192,
                    "positive_probability": 0.2308055102889821
                },
                "stars": 3
            },
            {
                "review": "How do I hate thee? Let me count the ways.Seriously. I hate this McDonalds.I'm obsessed with McDonald's breakfast and I'm a fatty so I come here every morning before class. Out of the million times I've come here, I've gotten the right order THREE TIMES. I'm not exaggerating. I'm DEAD serious.I know it seems confusing why I would continue to come here after all those mess ups but I had no choice since I'm addicted to their breakfast and it's the closest to my classes.Idk if there's an issue with management or with the workers but they need to shape up.",
                "reviewer_id": "ues1RAiSph7sBzJYc1YebA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8945160823728326,
                    "positive_probability": 0.105483917627172
                },
                "stars": 1
            },
            {
                "review": "Newer store design, relatively clean and quiet store during my visit. Small, simple order took typical amount of time. I seem to always have an issue with the portion sizes of the fries when the fries are freshly cooked.",
                "reviewer_id": "UQRWsDmReeK28iYyCL7kfw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04140043324366414,
                    "positive_probability": 0.9585995667563387
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "3AtlNePpVHC-D1a49LqFtA",
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "ucqMmYA5hiXZO1uV0YN8Vw",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "9SFWEreW7wAXB3zYu28r_Q",
            "jS0mmzYf4mouMEcGzQ5Z-Q"
        ]
    },
    "ucqMmYA5hiXZO1uV0YN8Vw": {
        "keywords": {
            "bigrams": [
                "late_night",
                "green_st",
                "open_hours",
                "naturally_add",
                "able_handle",
                "weekend_nights",
                "haven_late",
                "long_time",
                "customer_service",
                "spirited_interior"
            ],
            "unigrams": [
                "mcdonalds",
                "order",
                "open",
                "mcdonald",
                "ordered",
                "wrong",
                "run",
                "fries",
                "food",
                "hours"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "loud",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "free"
            },
            "business_id": "ucqMmYA5hiXZO1uV0YN8Vw",
            "categories": [
                "Burgers",
                "Fast Food",
                "American (Traditional)",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "616 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Monday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Saturday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Sunday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Thursday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Tuesday": {
                    "close": "00:00",
                    "open": "00:00"
                },
                "Wednesday": {
                    "close": "00:00",
                    "open": "00:00"
                }
            },
            "latitude": 40.1104207856346,
            "longitude": -88.2297450104517,
            "name": "McDonalds",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/ovwojKThJZ0jbgPb0GiYbg/ms.jpg",
            "review_count": 10,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The store is also well run in my experience and even late at night when it gets busy, they seem to stay on top of things. Aside from that they're like any other McDonald's. Anyway it is McDonald's. ",
        "reviews": [
            {
                "review": "I was craving a McD's classic: McGangbang (McDouble + McChicken, get your head out of the gutter!). I had no idea they now have all day breakfast, so naturally, I had to add a hashbrown to my McGangbang. I do not regret it, it was glorious. See picture attached.",
                "reviewer_id": "2eICeRlxg8Mb51cTnw4r0A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7878939553100317,
                    "positive_probability": 0.21210604468996688
                },
                "stars": 4
            },
            {
                "review": "As far as I know, this is the only food place open 24 hours on Green St. Pretty fast considering how busy they get on weekend nights. Aside from that they're like any other McDonald's.",
                "reviewer_id": "EOjgKjLbfCssAqcGuBCm3w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5724117295680841,
                    "positive_probability": 0.4275882704319174
                },
                "stars": 3
            },
            {
                "review": "Service is kind of rude, the mobile app specials they advertise everywhere are only available weird hours (they're invalid noon to midnight), drink/ketchup dispensers are sometimes down/empty, and to top it off I saw bugs crawling around on the tables on two separate occasions (a fly once, a ladybug another time). The food itself is fine. It's still McDonalds, cheap and open all day and all night, but they really need to step up their game maintaining this place.",
                "reviewer_id": "h6nOw9rqcTkgpGokwB9jHQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08972212717033623,
                    "positive_probability": 0.910277872829664
                },
                "stars": 1
            },
            {
                "review": "What people have been waiting for: a 24-hour McDonalds on Green St. This is now open (in place of the old GameStop) as of Fall 2014. The new haven of late night drunk college students, this is a little above your typical McDonalds. Being a new facility, much of it is very nice and clean. It may not stay that way, but as of now it's very nice. The store is also well run in my experience and even late at night when it gets busy, they seem to stay on top of things. You may not want to, but you know you'll end up here eventually.",
                "reviewer_id": "MoiZy7jP2pGl1HObuvXjnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17510242690072755,
                    "positive_probability": 0.8248975730992761
                },
                "stars": 5
            },
            {
                "review": "Morning at 7 is disastrous: the lady at cashier is mad at us; she takes orders in wrong and stares at kids almost makes them cry, then they couldn't order straight.Just weird experience.",
                "reviewer_id": "OS9E3BZbQRtYQIOO2mBxQg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27473700227606485,
                    "positive_probability": 0.7252629977239354
                },
                "stars": 2
            },
            {
                "review": "Easily the shittiest service I've ever had. Claimed they would be cash only for \"10 minutes\" and I'm standing here as it goes an hour and counting. Then nobody is working at the front for 20 minutes and refuses to acknowledge waiting customers. Really showed me why I prefer the McDonald's a couple blocks away on Neil, as it is a REAL McDonald's.",
                "reviewer_id": "rbDQfxC1WjNvPyfVkCGksQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5225930301148486,
                    "positive_probability": 0.47740696988515036
                },
                "stars": 1
            },
            {
                "review": "Come on...who doesn't LOVE Mcdonalds, especially when it's open 24/7? I love the school spirited interior decorations and the bathrooms are so fancy. My only question is why do the fries taste so bad at this Mcdonalds? Out of all the Mcdonalds I've been to, something is wrong with the fries here. They're dry and kind of flavorless. Also how on Earth do you run out of soft serve??? I wanted to order ice cream and was told they ran out...how does that even happen? It's Mcdonalds...you never should run out of anything- it's like a huge endless fridge of food back there.",
                "reviewer_id": "srLzF7MXx-rqiizAQdfTVw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9280460107127022,
                    "positive_probability": 0.07195398928729892
                },
                "stars": 4
            },
            {
                "review": "Bad customer service. Wrong order, Impatient employee. The salad I ordered looked like shit. The chicken nuggets were good though. Anyway it is McDonald's.",
                "reviewer_id": "TsgNaMUMdiHPag9HI4oVfw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.060495473273099794,
                    "positive_probability": 0.9395045267269009
                },
                "stars": 2
            },
            {
                "review": "Messed up my order 3/4 times I've been there. I've never, ever, had an order messed up from McDonalds until this location(I'm 21, and I've been eating there a long time).I ordered a McChicken, McDouble got 2 McChickens. Ordered a black coffee, got 2 extra cream and sugar added for no reason. Ordered a Bacon Haberno Quarter Pounder, got a regular one instead.I mean, how does that happen. It's McDonalds, and in case you think I suck at ordering, the receipt had my correct order at least the first time because it was 2.69(McDouble's 1.30 or something)",
                "reviewer_id": "Xk4ecMv1529PWK7h2NYZ3g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023940321574652354,
                    "positive_probability": 0.9760596784253481
                },
                "stars": 1
            },
            {
                "review": "It is one of the nicest looking McDonald's I have gone to. They are able to handle masses of customers smoothly. The best part is that it is open 24 hours. Their fries are always hot.",
                "reviewer_id": "xkOQUAqnU-u6qSj9pBtukA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25753516176424446,
                    "positive_probability": 0.7424648382357567
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "ljsTa0MiQyVfKrgq2FOKdg",
            "3AtlNePpVHC-D1a49LqFtA",
            "M2boe4Te0rQ5RasVJkPXng",
            "1d5XAAH39FKenV3_9gcFIw",
            "jS0mmzYf4mouMEcGzQ5Z-Q",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "9SFWEreW7wAXB3zYu28r_Q",
            "A2T1l1RUrJ25YxfCbTN7-g",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "O_HxmcRtxdJluerS2RYqtA"
        ]
    },
    "vxFeYTFre83stnrcLAj84A": {
        "keywords": {
            "bigrams": [
                "infinitely_pretty",
                "order_wasn",
                "work_five",
                "right_work",
                "pretty_cool",
                "counted_back",
                "nice_small",
                "home_order",
                "food_fact",
                "back_change"
            ],
            "unigrams": [
                "drive",
                "arby",
                "correct",
                "service",
                "food",
                "don",
                "got",
                "came",
                "infinitely",
                "wasn"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Attire": "casual",
                "Delivery": false,
                "Drive-Thru": true,
                "Good For Groups": true,
                "Good for Kids": true,
                "Outdoor Seating": false,
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false
            },
            "business_id": "vxFeYTFre83stnrcLAj84A",
            "categories": [
                "Fast Food",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "509 N Cunningham Ave\nUrbana, IL 61802",
            "hours": {},
            "latitude": 40.117801,
            "longitude": -88.20475,
            "name": "Arby's",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/7N5YbsFtr8jBf3eyk5WwNg/ms.jpg",
            "review_count": 4,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Great drive up service,the gentleman actually counted back my change,with a smile.You just don't get that in fast food any more. This has got to be the friendliest Arby's I have ever seen. It's got that nice, small hometown customer service style to it. ",
        "reviews": [
            {
                "review": "This has got to be the friendliest Arby's I have ever seen. It's got that nice, small hometown customer service style to it. Like most Arby's, coupons can be reused infinitely which is pretty cool.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6321626958653088,
                    "positive_probability": 0.3678373041346895
                },
                "stars": 4
            },
            {
                "review": "Expect to be in the drive through for quite a while (20 min for us). Came through right after work around five. Ordered for my whole family and when I came home the order wasn't correct,  even though the receipt was correct. Very disappointed since we don't get to go food often and the fact that it's so expensive.",
                "reviewer_id": "p1TaXI9C1G8-mP6m9RdnWw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25199166659730343,
                    "positive_probability": 0.7480083334026925
                },
                "stars": 2
            },
            {
                "review": "Great drive up service,the gentleman actually counted back my change,with a smile.You just don't get that in fast food any more.",
                "reviewer_id": "sQnnY0rvbnaYWsd46b9yqQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6398006373669252,
                    "positive_probability": 0.36019936263307567
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "McjqmrsudvpnVxtYJKSUtQ",
            "9w1FCHEGc2CWBl0nzX-SUg",
            "3AtlNePpVHC-D1a49LqFtA",
            "1d5XAAH39FKenV3_9gcFIw",
            "cF2s9dlQ0ZiSDUdH-odoKQ",
            "M2boe4Te0rQ5RasVJkPXng",
            "Zb2Bqf6MSiSbwIz0GyK7Qw",
            "6LtZI1tpMHPZv5nVHAF6rA",
            "PYG1nrz2yYDSQk3W-vYwAA",
            "HUif3t3SUkfb4T1cTXzMHA"
        ]
    },
    "yZwl-dXM4SpEDEiihrfZnw": {
        "keywords": {
            "bigrams": [
                "favorite_sub",
                "sub_place",
                "jersey_mike",
                "customer_service",
                "sub_par",
                "love_place",
                "jimmy_john",
                "bread_dry",
                "two_different",
                "store_campus"
            ],
            "unigrams": [
                "sub",
                "sandwiches",
                "mike",
                "place",
                "sandwich",
                "subway",
                "way",
                "good",
                "bread",
                "worth"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Delivery": false,
                "Drive-Thru": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "free"
            },
            "business_id": "yZwl-dXM4SpEDEiihrfZnw",
            "categories": [
                "Delis",
                "Fast Food",
                "Sandwiches",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "505 E. Green Street\nSte 3\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Saturday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "10:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "10:00"
                }
            },
            "latitude": 40.1099251,
            "longitude": -88.2314617,
            "name": "Jersey Mike's Subs",
            "neighborhoods": [],
            "open": false,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/iHV153Cmy4Jy7vIj8elmuA/ms.jpg",
            "review_count": 13,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Big size literally was good enough for 2 meals Jersey Mike's has its own little atmosphere. Sandwiches here are the way sub's ought to be. Fresh sliced deli meats and cheese, great bread, and copious amounts of toppings. ",
        "reviews": [
            {
                "review": "Probably my favorite sub place on green street! If you're on campus at U of I, it's worth the walk over. Sandwiches are decent sized. White bread or wheat bread. Both are good. Meat is freshly sliced. Veggies always fresh. Order you sub Mike's Way--it's worth it!",
                "reviewer_id": "-DT5p9_ewd_jQOM3TAj2kQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3619129372464609,
                    "positive_probability": 0.6380870627535378
                },
                "stars": 5
            },
            {
                "review": "Good while they lasted.They are no longer at this location.",
                "reviewer_id": "7ZESoMS8JssvHjbrrIUuXg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5014333039707108,
                    "positive_probability": 0.49856669602928894
                },
                "stars": 4
            },
            {
                "review": "Definitely my favorite sub place. Whatever you do, make sure you get your sandwich \"Mike's Way.\" It is amazing and tops Jimmy Johns and Subway in my book, hands down. The staff has always been very friendly as well whenever I have been in here.",
                "reviewer_id": "_zJ1Rv0t6v9vayUh5gDd4Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7225485762105326,
                    "positive_probability": 0.2774514237894682
                },
                "stars": 5
            },
            {
                "review": "Worst sandwich store on campus. I tried two different sandwiches here on two different occasions and both times, the sandwiches SUCKED. The bread is too dry and tastes worse than storebought bread. The sandwiches are drowsed in olive oil/vinegar and do not taste very good.",
                "reviewer_id": "Dxhyi5b0obJZurIxrpTCVQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6060025414251674,
                    "positive_probability": 0.39399745857483126
                },
                "stars": 1
            },
            {
                "review": "Wow. Smallest water cups I've ever seen in my life (they're as big as shot glasses). The subs are fairly good, but they cost so much money that it's not really worth it.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04735218486789226,
                    "positive_probability": 0.9526478151321065
                },
                "stars": 3
            },
            {
                "review": "I've recently grown to love this place. And I'm definitely a fan of the customer service and atmosphere.It's nice that they prepare the sandwiches and cut the meats fresh in front of you.The first two times I went I was not impressed by the food.. I had the cheesesteak and also a wrap. Both of which are nothing extraordinary. Actually, the wrap was pretty pathetic portion-wise for how much they charged for it.My recent experiences have been nothing but stellar. I have got the NUMBER 9 every time. Roast beef, turkey, bacon, chesse, and Mike's way always makes it an amazing meal. The staff are super customer service oriented too. They were making the wrong order for me and just combined the two sandwiches like I asked - which resulted in a Mike's Gargantuan more or less. Another time, it was near closing and they forgot to put bacon on my #9 and my friend's. So, I told them and they literally gave me with a pound of bacon for my trouble.All in all, my experiences with Jersey Mike's makes it a wonderful option for sandwiches.",
                "reviewer_id": "I1Wv4Z_2nCMtxQ4l9dNQiA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0010508005262416808,
                    "positive_probability": 0.9989491994737519
                },
                "stars": 4
            },
            {
                "review": "I chose to try Jersey Mike's because ain't nothin' better than a good sandwich. It was on my way and not crowded at all: A+. I got the Super Sub (provolone, ham, prosciuttini and cappacuolo) on white and a small drink. It was just under $9. My first thought was this looks like a glorified Blimpie. They slice the rectangular loaves of meat to order and make the sandwich in front of you. The topping selection is okay. They had jalapenos so I was set. Upon trying my super sub, I was not impressed. Actually, my sandwich tasted just like a Blimpie Best. Half of it went into the garbage and I sincerely regretting not ordering the mini sub size. This place is not quite comparable to Subway, maybe a step above? The fountain Pepsi burned my throat and was AWESOME. Highlight of my meal. Based on my sub-par sandwich experience, I don't plan on coming back.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6747067572104991,
                    "positive_probability": 0.3252932427894987
                },
                "stars": 2
            },
            {
                "review": "Jersey Mike's has its own little atmosphere. The customer service is great and the workers are really friendly despite what other reviews may say. I've been here at least 3 times so far. I've tried the turkey & provolone and the Italian sandwich (only cold sandwiches). This is like a lower quality version of Subway to me and the sandwiches are pricer. A regular 6 inch is almost $6 compared to Subway at about $4+ The bread can be kind of dry. I suggest getting it \"Mike's way\" which is the addition of vinegar, oil, and some spices. Despite the sandwiches being a little sub par and not having much to offer they are still very fulfilling. For a female I definitely would recommend getting the regular. Something about this place, I'll be back.",
                "reviewer_id": "kwQ7FNfDJ8Jz27EU-_wg0g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.47081261507443395,
                    "positive_probability": 0.5291873849255747
                },
                "stars": 3
            },
            {
                "review": "You can keep your Jimmy John's, and your Subway too.  Dobt even come near me with your Quiznos either. Sandwiches here are the way sub's ought to be. Fresh sliced deli meats and cheese, great bread, and copious amounts of toppings.   I don't get here often but when I do, its a treat.",
                "reviewer_id": "lH1rXk40kv2suZan17llhg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9586136275192685,
                    "positive_probability": 0.04138637248072955
                },
                "stars": 4
            },
            {
                "review": "I've been eating subs for many, many years, I'm 67. When I first ordered here, I didn't know anything about their food, so I ordered a #13, original Italian, because that's my benchmark of a sub shop. My favorite sub in Chicago is Fontano's, a little grocery place near UIC campus. The JM sub ties Fontano's for excellence in a sandwich. Subway, Jimmy John's and Quizno's shouldn't even be mentioned in the same breath with JM's. The only problem is that the Champaign store is on campus, and right now there are very few places to park. But it's well worth walking a few blocks.",
                "reviewer_id": "PbNJ09Y1E1hjx9mORJrYzg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0054949897531866975,
                    "positive_probability": 0.9945050102468178
                },
                "stars": 5
            },
            {
                "review": "Terrible food. I ordered a Buffalo Chicken wrap and they gave me lettuce and chicken and squirted some Buffalo sauce on it. Nothing that cannot be done at home in less than 5 mins. It's worse than subway and more expensive.",
                "reviewer_id": "SUa2mMjTZk_azkOIIPjgDA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08182046878998225,
                    "positive_probability": 0.9181795312100157
                },
                "stars": 1
            },
            {
                "review": "Me & my husband love this place. Taste like sub place in Chicago. I get the Italian & my husband gets chipotle cheese steak their awesome! Big size literally was good enough for 2 meals",
                "reviewer_id": "VkVmMJUsJ74s94fQSP3yRQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6584502628226968,
                    "positive_probability": 0.3415497371773023
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "Uw1DZhEtTmLzMcXmdpR8Pw",
            "SQASst3NU4tA-t4cmWLILA",
            "uhzZM-WwNsaVuvGRjv3mXw",
            "elwuxXreWA3IVAW5qNOw3g",
            "j9N_fG1PVCSY-3HY1TRQ5Q",
            "mSTjlawGZcbg8YBQx9UxFg",
            "leH24AjTrmcImAbsdh4HFQ",
            "Fb3Pl0PO_ojEyChkM_SApA",
            "ey7-ihj-OjM4sEOwWTc06Q",
            "PYG1nrz2yYDSQk3W-vYwAA"
        ]
    }
}