{
    "0a4lX5VhCXJOwe-idxnVbw": {
        "keywords": {
            "bigrams": [
                "indian_food",
                "food_good",
                "indian_restaurant",
                "food_great",
                "lamb_vindaloo",
                "garlic_naan",
                "downtown_urbana",
                "champaign_urbana",
                "best_indian",
                "quality_food"
            ],
            "unigrams": [
                "food",
                "good",
                "indian",
                "chicken",
                "place",
                "naan",
                "service",
                "great",
                "sitara",
                "time"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": true,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wi-Fi": "no"
            },
            "business_id": "0a4lX5VhCXJOwe-idxnVbw",
            "categories": [
                "Vegetarian",
                "Indian",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "114 S Race St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "16:30"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "16:30"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "16:30"
                },
                "Sunday": {
                    "close": "21:30",
                    "open": "12:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "16:30"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "16:30"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "16:30"
                }
            },
            "latitude": 40.111959,
            "longitude": -88.208652,
            "name": "Sitara",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/JdTVxEEPPNTJt4ZxdBvONw/ms.jpg",
            "review_count": 103,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The food here is always good. Order something with naan; they are really good. The food was okay.\" \"",
        "reviews": [
            {
                "review": "Great Indian food! Really delicious, generous portions. They have a Thali special is an amazing array of Indian favorites that is offered vegetarian or no vegetarian for $7.99 and $8.99 respectively. The also have a pretty well executed menu to choose from with a lot of traditional north Indian dishes. I love Indian food for all its complexity and flavor and this place did not leave me disappointed. Definitely try it out for a quick and delightful lunch.",
                "reviewer_id": "-6l7CsWbTPJeFgflI-V4Fw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009438475913750832,
                    "positive_probability": 0.9905615240862498
                },
                "stars": 4
            },
            {
                "review": "I was so terribly sorry to visit this place that I decided to leave a review about it's pathetic customer service and unpalatable food.I have been here once before, and was disappointed with both the customer service and food quality. The server took forever to serve our order, and kept on messing with it. We ordered chicken and he brought something else, and so on for many other dishes. My friend was so disgusted that he left a big ZERO as the tip amount.But for whatever reason, we decided to give it a second try, assuming that it was a bad day. But what are the odds that the same incidents happened during the second visit as well. Imagine what are the odds for that. The server was arrogant. The table was full, and there wasn't enough space to keep the incoming dishes on the table. So we requested him to keep them on the nearby table for the time being, since it was empty. He insisted that we keep it on our table only. I asked him to free up space on the table if he could, and he started to stack the dirty plates one upon the other on the table itself, not to collect them but to leave them there only. The food was so horrible that I had to leave my dinner unfinished. This time I left a ZERO dollars as the tip.I am never going back to this place again.",
                "reviewer_id": "-FaQbOh9gQffjZ-ozy8Zwg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015390260456617967,
                    "positive_probability": 0.984609739543364
                },
                "stars": 1
            },
            {
                "review": "Tried this place for lunch on a Saturday. The staff was nice and the vegetarian options were yummy and inexpensive ($14 for two lunch entrees and naan). It's a great addition to downtown Urbana and it's nice to have an option for Indian food outside of Bombay.",
                "reviewer_id": "0glyAUxS2utznxoQ2eibdA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3083802412851879,
                    "positive_probability": 0.6916197587148082
                },
                "stars": 4
            },
            {
                "review": "Really good northern Indian food.  Not too spicy.  Plenty for the money.",
                "reviewer_id": "2cy_r-I5gx4FCindBHYBBQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.257199293252551,
                    "positive_probability": 0.7428007067474491
                },
                "stars": 5
            },
            {
                "review": "I like the Indian food here; the vindaloo is to die for, the nan is perfect and the lassi drinks will make you want a second stomach. The service seems decent and the food comes out at a good rate; I'm not a huge fan of the inside and the Bollywood dance videos on the TV's but that's not a hard thing to get over.",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05711913277773186,
                    "positive_probability": 0.9428808672222688
                },
                "stars": 5
            },
            {
                "review": "Went back again for take out. Portions were great and the flavor was above average. Ordered the lamb vindaloo, and got a heaping container of vindaloo and another good sized container for rice. And the garlic naan was very very good. When I stopped by to pick it up I asked one of the staff members why Somosa wasn't on the menu, he said \"it's on the dinner menu, you can ask for it any time\"Very helpful and friendly staff. Food is still good and at a fair price.",
                "reviewer_id": "4b_Yo9nopZRqRoTQRXp9EQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9108175196256331,
                    "positive_probability": 0.08918248037436528
                },
                "stars": 4
            },
            {
                "review": "Food was great but their service was bad. My party having called in, in advance, was made to wait 20 minutes until we got a table. Then we ordered food and it took a moderately long time for it to arrive. I understand they were busy so I am not basing my review off the time for the food to arrive to our table, but the fact that they didn't have our spots ready by the time we arrived. Going back to the food, I grew up in an    indian household having eaten indian food everyday and their food was amazing. Compared to all the other indian restaurants I've tried in the Chambana area (Bombay Indian Grill, Amber Indian etc.) This place had the best food. The food itself kind of made up for the service so it bumbed up my review from 3 to 4 stars. I recommend the Fish Makini with Garlic Naan or over just plain white rice. If your looking for a restaurant with great food and are in the mood for indian cuisine I really recommend you check this place out if they are not busy.",
                "reviewer_id": "58GtMEekuSshWefW9rY5vQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0037261976657523583,
                    "positive_probability": 0.9962738023342459
                },
                "stars": 4
            },
            {
                "review": "Welcome to my regular rotation, Sitara. I can't imagine another Indian restaurant in the area being better. I don't know why I waited so long to try here - the reviews are good, colleagues have recommended it, but for some reason I waited over a year. Got dinner to-go, and even tested out some items that might be questionable after the drive home. The naan was excellent (simple, but great), the veg app sampler was surprisingly good (not greasy, and the sauces added great zip), and the lamb vindaloo was still very tender. Now that I've tried out my \"tester\" dishes, I am ready to explore the menu. I'm hoping that they can bring a little more heat in the future.",
                "reviewer_id": "7cU03OKZgmjNLLLGpbBiOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08012452786581674,
                    "positive_probability": 0.9198754721341807
                },
                "stars": 5
            },
            {
                "review": "Its alright. Good place to sit down, good decor etc. Samosas could have been better. I feel the food is kind of the same as all the other indian places in C-U.",
                "reviewer_id": "7FtTK0f85orj5NUva-2iGw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3600651975310692,
                    "positive_probability": 0.6399348024689322
                },
                "stars": 3
            },
            {
                "review": "Love the decor and the food is even better to me than Bombay. Nice people working there. I love the lamb vindaloo for $9 at lunch.",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7288227514036335,
                    "positive_probability": 0.27117724859636866
                },
                "stars": 5
            },
            {
                "review": "We've been 3-4 times now.  This is one of the places that my wife and I go with her family when they're in town and we've never been disappointed.  It's one of our go-to spots in Urbana.  The tandoori chicken is extremely good - nicely flavored and tender.  Plus you get the fun presentation when it comes out on the sizzling metal platter, surrounded with onions and peppers.  We have tried a variety of dishes and they've always been tasty.  Some of the standouts are the lamb korma, the saag paneer, and the chicken makhani.  I also had a very tasty fish curry.  I like how the dishes come out in the small bowls - it also makes it easier to share and for everyone to try a little bit of everything.  The sauces are very rich and filling, so we almost always end up with leftovers.  The naan is fluffy and delicious.  The rice is good too, but it's hard not to get the naan every time.The service has also been fairly prompt - in the past we've gone and it's been almost empty, but last time the restaurant was fairly full, so I guess the word is getting out.",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.000184921966776e-08,
                    "positive_probability": 0.9999999199981421
                },
                "stars": 5
            },
            {
                "review": "Food was great. Naan is huge and delicious. Would have been a 5 star rating if they had had more tables as my fianc and I had I sit at the bar to eat dinner, which is pretty difficult when eating Indian food. We will be back again, and will most likely be our go to to-go takeout spot.",
                "reviewer_id": "9O1BDu1h57gw8C_ceEqUQQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49950030855307437,
                    "positive_probability": 0.5004996914469233
                },
                "stars": 4
            },
            {
                "review": "Came in for lunch and had the chicken vindaloo. The curry was good, had good flavor and the right amount of spiciness. I have tried all but 1 other of the Indian restaurants in the CU area and this is at the top of the list so far.1 star deducted for 2 reasons:1. Service was subpar. The glass of water I got was lukewarm. Had maybe 1 sip of water left in the glass and the server looked at my table, walked by a few times without refilling, went back behind the bar and was on his phone. About the 4th time he finally came back and finally refilled the water....with more lukewarm water.2. The vindaloo had broccoli in it. I've had vindaloo plenty of times and have had different places add a variety of veggies, but never crunchy broccoli. It was kind of random and kind of seemed like it was a random vegetable added to the dish to stay true to the menu that said \"a curry with assorted veggies\". Honestly it took away from the dish. I would most probably come back here and try another dish and hope that service is a little better.",
                "reviewer_id": "_BD1QxR67CF-pI0KDhCTxg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11286411926789372,
                    "positive_probability": 0.8871358807321085
                },
                "stars": 4
            },
            {
                "review": "The food here is great! Full of flavor and very fresh. The restaurant is also very nice and clean and the staff are extremely professional. I'd go here instead of Bombay, the food is better and the prices are a lot cheaper!!!",
                "reviewer_id": "ahGMDuCuQrRF8QTlxtiz6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11185441866168012,
                    "positive_probability": 0.888145581338318
                },
                "stars": 5
            },
            {
                "review": "Best place in Chambana to get delicious Indian food. Good prices, too!",
                "reviewer_id": "amxtfaoqV0JEwbJUFeCyLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31543625554633786,
                    "positive_probability": 0.684563744453662
                },
                "stars": 5
            },
            {
                "review": "First time here and I had an ok experience.  It's located two doors down from the Iron Post in Urbana.   The restaurant looks like a bar.... A really long bar with a dozen seats....not sure what the purpose of it was....I guess they didn't bother renovating from the previous tenants.  Then a bunch of booths and a few tables.... Think Black Dog but with more room.   I had my 1yr old with me and figured she'd love some chicken korma and rice.  She LOVES rice... But not here... korma is usually fairly mild (as stated in their menu) with lots of flavor, but this had a bit of a kick to it....my nose was running.  After three bites, she was spitting it out and pushing it away.   I also ordered some samosas, and they were really good, but again a bit of a kick and my daughter didn't like them.  We tried ordering a mango lassi from the menu, but the waiter said that they had a mango shake....i asked what the difference was and he just shrugged his shoulders and said, \"They're similar\".   Similar as in how?  He couldn't tell me.   He suggested mango juice, so I agreed and he basically sat a glass of mango concentrate in front of me.... Kind of gross.  From where we were seated, i had a decent view of the kitchen....I saw them putting a lot of things in the microwave....heard lots of beeping as dish after dish finished in there...not sure what they were nuking... Kind of made me uneasy.... I've been in enough restaurants, cooking classes and seen enough food network to know that microwaves aren't really used that often or at all?!   Anyway,  it was ok...but I'd opt for Bombay Indian Grill any day of the week.",
                "reviewer_id": "aSyHqB5QIybJb3npJUy78A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9953480717186436,
                    "positive_probability": 0.004651928281354018
                },
                "stars": 2
            },
            {
                "review": "Went here for the first time with coworkers at lunch on 9/25. It was an excellent experience. The three of us each had samosa as appetizers (they're not on the lunch menu, but just ask for them) and we shared three entres, along with plain and garlic naan.The samosa were excellent, with good flavor and a healthy kick - probably the tastiest samosas I've had in a while. The coriander chutney was deliciously fresh, and one coworker who accompanied me said it was reminiscent of the way she liked it back home in India.The naan (garlic and plain) was delicious, and our main courses - two chicken dishes and channa masala also met with our satisfaction. The two different chicken dishes had distinct flavors with a good level of spice and flavor. The channa masala was also delicious; we asked them to crank up the heat on this one, and they obliged.We were all pleased with our meal, and the price was fair for the quantity and quality of food. The entres are served in brass bowls with china plates.It's hard to believe that a mere dozen years ago, we had NO Indian cuisine in Champaign-Urbana; we now have several excellent choices including Sitara, both on-campus and off.We will definitely be back. This fine Indian restaurant is a great addition to the dining options in downtown Urbana.",
                "reviewer_id": "aTl3t2nJTFdb6FGk7rFubg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.111641269423675e-08,
                    "positive_probability": 0.9999999488835772
                },
                "stars": 5
            },
            {
                "review": "Hands down best Indian food in the Champaign-Urbana area. Good location. Priciest of all the options but a great deal considering the quality of food. Let me start with the lassi, which they make. It is the perfect consistency not too thick- to die for. Then, their samosas and fried paneer are just perfectly done and spiced. The butter chicken curry, malai kufta, and lamb vindaloo are all amazingly mouthwatering. The flavor is done just right. The meat and vegetables are pronounced and mix subtly well with the spices. So good. The basmati rice is freshly cooked and the naan is warm and soft. But definitely try their aloo paratha- that is one decision you will never regret! My stomach is growling now... But to finish off they have a nice selection of desserts which includes mango kulfi that comes sliced like a cake! A+ for taste and presentation. So much better than Bombay Grills which tasted like a 7-11 Slushie! I would definitely go to Sitara over any other restaurant in Champaign-Urbana 100 times out of 100.",
                "reviewer_id": "aX8hmnedCsrLJ7HmD8hwvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05867767039621486,
                    "positive_probability": 0.9413223296037739
                },
                "stars": 5
            },
            {
                "review": "Took wife here 03/27/15. Great food and service. I received all kinds of husband points and wife rewards later.",
                "reviewer_id": "bLHH-pg1xCO4n0PlxA10yg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5279765930488248,
                    "positive_probability": 0.47202340695117534
                },
                "stars": 5
            },
            {
                "review": "The food was \"okay.\" It's not the real-deal because it lacks the 12+ spices that you'd get in a homemade meal. Maybe my perspective is warped by fantastic indian food in other cities, but the food is probably not worth the price (to me).",
                "reviewer_id": "BTTOrtL1Li_ZcGyoucUmRw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06137125819628206,
                    "positive_probability": 0.9386287418037184
                },
                "stars": 2
            },
            {
                "review": "We live in Chicago and have some pretty amazing Indian food up there. But since we come to Champaign/Urbana often I was so pumped to hear about this place opening.We came in and we were literally the only other people in there which was kind of a bummer. There was also no real signage out front and no real decoration inside. I've been to that space when it was the pizza place, and then when it was Red Star before that and not much has changed besides the fact that there were Bollywood movies playing.The service was fine, maybe a touch slow given that there was no one else there, but everyone was pleasant. The food was good too, perfectly spicy (and like spicy). I would surely come back. The only thing that worries me is the fact that they've failed health inspections. So what would've been a four star spot is now at two.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.750426974551094,
                    "positive_probability": 0.2495730254488998
                },
                "stars": 2
            },
            {
                "review": "Had the thaili(not sure if I spelt the name correct. It's on the last page of the menu) lunch. It was only $8.99, but contains chicken, rice, salad, and dessert! Like their Dessert very much. It was a kind of milk dessert, and seems contains rice. Creamy but not very sweet. And the sweet yogurt drink Tassi was also very good. It could be better if they have some cooked vegetables in the chicken meal.",
                "reviewer_id": "C74BJGf0RuKdYKxjm7SDuQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7983083957233902,
                    "positive_probability": 0.20169160427660796
                },
                "stars": 4
            },
            {
                "review": "The food here is always good. I'm not Indian so I can't speak to how authentic it is but I frequently see Indian people here so I think that's a good sign. Our go to favorite is the palaak paneer which is basically Indian creamed spinach and a good thing to try if you're apprehensive about Indian food. We usually try to get something spicy to balance out the creaminess of the spinach. The beer they have is also good. They only have Indian beer which all have super cliche names like Maja Raja, Taj Mahal, and Kingfisher. I was surprised to find out their beer is nothing like anything I've tasted. They're all lagers but they have an unexpected malty sweetness and they're  not super hoppy.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11150651735726314,
                    "positive_probability": 0.888493482642737
                },
                "stars": 5
            },
            {
                "review": "It was good! A nice treat in downtown Urbana. I love the smell and the vibe of this place. The naan was a temptation, I haven't had better. The prices were cheap and they give you a standard size that was enough to fill me up. And Indian channel with non-stop music videos was playing, that added to the overall entertainment.",
                "reviewer_id": "da-w3Sx9ZMlIl6d7XxOAHQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09130282653232813,
                    "positive_probability": 0.9086971734676744
                },
                "stars": 4
            },
            {
                "review": "Sitara was a pleasant surprise in the Indian food scheme of the C-U area, with good flavors and a casual but comfortable ambience.  The tandoori chicken was pleasantly tender and moist (a hit-or-miss in C-U).  Prices in general are OK, at $9-12 for entrees.  The only complaint is that the staff didn't cut up the naan, which made eating and sharing a bit awkward.  Stop by if you're in the area, for a casual lunch or dinner experience.",
                "reviewer_id": "DC5yifhqWT1gQdcazBA0jQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0054746751316201376,
                    "positive_probability": 0.9945253248683767
                },
                "stars": 3
            },
            {
                "review": "I came here twice within one week. We ordered lamb curry and butter chicken with naan the first time and samosas + naan + 2 orders of lamb curry the latter. The first time was a Saturday evening and it was busy, taking us close to 45 min to get our food but goodness EVERYTHING was fresh. I would wait that long again. The curry was labeled mild but had a lot of spices and seasonings which made it great. Service was nice but best of all were the prices. Amazing meal with quality and portions but won't break the bank.",
                "reviewer_id": "DFQu-MLFt3d-ufZBiQlJdQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005737273300597962,
                    "positive_probability": 0.9942627266994056
                },
                "stars": 5
            },
            {
                "review": "Tasty food, the Alloo Tiki (sp? - app for 2.99) were delicious and vibrant. Entrees, a chicken curry and a masala, were good (9.99 a 10.99) and the accompanying basmati was brightened with some saffron, shaved carrots and a hint of fennel.Service was prompt and helpful.  Great addition to Urbana fare.",
                "reviewer_id": "dtLG0Ik3luVP3Ju93VCLOQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02779705542503039,
                    "positive_probability": 0.9722029445749691
                },
                "stars": 4
            },
            {
                "review": "I like Sitara but it's not any different from Casablanca Kabab House. There's not a strong enough pull to leave campus for this place.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28810868797975037,
                    "positive_probability": 0.7118913120202501
                },
                "stars": 4
            },
            {
                "review": "It's a shame that I had to give this place only a 3 star rating, even though the food was quite good and I have recently started to really like Indian food. The problem was the service. I'm normally not picky about service, as long as I get what I ordered I'm happy. But decide for yourself whether the following is acceptable to you. They're supposed to open at 4:30, and we arrived at 4:35 to find the door closed and locked. My wife and I then walked around the block for a few minutes to wait, came back, and the place still wasn't open. I peered through the window to check if anyone was inside, and made eye contact with two of the restaurant staff. They stared at me, then went back to chatting with each other (they weren't even busy preparing tables or anything). By this time it was around 4:45.Once inside, we basically got the cold shoulder treatment, as if they were being passive-aggressive about my peering inside earlier. No smiles, no welcoming attitude, and when they came to take our order they just stood next to us without saying or asking anything. We ordered a lot so we had plenty left over, and specifically asked for TWO boxes to go, and they only brought one of the small boxes, which was clearly inadequate for how much we had left. So in summary, 4/5 for the food, 1/5 for the service, 3/5 overall.",
                "reviewer_id": "eAwlEPPnWniLDYtyB9cyXg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0825844361926851,
                    "positive_probability": 0.9174155638073048
                },
                "stars": 3
            },
            {
                "review": "Should have discovered this place earlier. Best Indian restaurant in town with very reasonable prize. Awesome environment and good services. My boyfriend and I ordered sauteed shrimp as appetizer, a chicken entree, a lamb grill, plus two lasses for only a little over $30. The tandoori specialties are must-tries! I ordered seekh kabab, a lamb sausage kabab, and it tastes awesome!",
                "reviewer_id": "eBmY2wSyt9uWy6GkAoeK3g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6129051335241904,
                    "positive_probability": 0.3870948664758051
                },
                "stars": 5
            },
            {
                "review": "Great place.  I eat here often for lunch.  Why do I keep going back?  Because it is really good!  The naan is the star of the show here.  Whoever the chef is really knows how to use the tandoori oven.  For me, the rest of the meal is just a vehicle by which I can consume more naan.  That being said, the jasmine rice is really good too.  I've only had it once... because I absolutely cannot resist the naan.  Man... I could go for some naan right now...I've tried a lot of the items on the menu, and all of them have been good.  Plus, you get a lot of food for the price.  I wish they would cut out about half the bar to add more seating.  It sometimes gets pretty crowded at lunch (again, because it's REALLY good!).The chicken korma is probably my favorite.  Really good flavor and heat.  It's a perfect dish for dipping naan in.  You know... because I like naan.",
                "reviewer_id": "EMxz314z1gFKqCZau7ye0g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12334700528320697,
                    "positive_probability": 0.876652994716787
                },
                "stars": 5
            },
            {
                "review": "Restaurant reviewI may have missed the sitara special non-vegetarian thali on my first visit so I may need to go back. This looks like a super chicken curry combo dish that would easily rival Aroma curry cafe's lunch special. I went with the chicken tikki masala lunch special with naan. The food was prepared quickly. One downside here is that they don't have a lunch buffet option which is always nice to pay a little more so you can have a variety. The chicken tikki masal was quite spicy. I guess it is more authentic that way. The protein serving was ample and filling. The only downside is the one large piece of naan which may not be enough for all of the curry that comes with your dish. My opinion is still mixed, anbar has a lunch and dinner buffet which allows for a large selection of indian food at a lower quality, but the lunch entrees here balance the heat of the curry along with a healthy serving of protein. I will have to come back and see if they have the lunch combo which would be your best bet if still offeredPros: spicy northern indian food, authenticCons: parking is scarce, no buffet optionHidden deals:Lunch specials are a good deal",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.5031157331271884e-07,
                    "positive_probability": 0.9999998496884268
                },
                "stars": 4
            },
            {
                "review": "The foods really good but mannnn its SLOW when it gets busy... 40 minutes waiting to get 2 curry.",
                "reviewer_id": "Fjc8RkOgpSWwljUJzJKRNQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6458453911862363,
                    "positive_probability": 0.3541546088137633
                },
                "stars": 3
            },
            {
                "review": "This is the only Indian restaurant in the CU area that serves authentic indian food. Definitely very spicy because thats what comes along with the indian food. If you cannot take the spice i suggest you mention it to you server prior to ordering. I would choose this place over any other indian place in the CU area",
                "reviewer_id": "GsAglbf1Q-k01XOVmxP7AQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1224105467705403,
                    "positive_probability": 0.8775894532294589
                },
                "stars": 5
            },
            {
                "review": "Been going there  two a week now. We had Curry fish, Aloo Gobi, Lamb Saag today. Curry was very rich and savory without strong scents of coconut. Aloo was unbelievable with bright reddish tomato paste. Lamb Saag, the saag still surprises me every time and it's a full bowl of lamby lamb chops today.",
                "reviewer_id": "h-fFKLKmE28bvoyMY98j0w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8090948148628393,
                    "positive_probability": 0.19090518513716118
                },
                "stars": 4
            },
            {
                "review": "I visited Sitara just after they had opened. There was a surprise inspection there at the same time. They had to shut off their oven ( which makes me wonder what was wrong in the first place) due to which we could not get any type of breads that we had previously ordered. This was told to us after waiting 30-40 mins for the food. They just got the curry along with rice and told us this is all they can make right now. No apologies, nothing. I heard good reviews about the food and went back to give it another shot. But the food failed to impress me. I tried a couple of different chicken dishes. The food was just average. Nothing great.  I even tried a bread other than the Naan. It was nothing like what it is supposed to be ( I am from India and I know what I'm ordering)",
                "reviewer_id": "H7yNgdpG17O3Ha5KCIN_1Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04610556839653804,
                    "positive_probability": 0.9538944316034624
                },
                "stars": 1
            },
            {
                "review": "Simply amazing! There are few times in my life that I've received food still steaming and crackling because it was so hot and fresh. The sampler was top notch and I would recommend it to anyone.",
                "reviewer_id": "HDsqH9oeCsHhZZgUu3ejYw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.031654666755741113,
                    "positive_probability": 0.9683453332442579
                },
                "stars": 5
            },
            {
                "review": "Fairly disappointed with the food..seeing so many good reviews we decided to try this one out - we ordered the masala papad, aloo tiki, chicken biryani and a new dish garlic masala chicken but almost all the dishes were just about average..there are many other better Indian restaurants in this area - try them out first!",
                "reviewer_id": "IAZ-Xm2tkO14YbzeCwritg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0004049366701027854,
                    "positive_probability": 0.9995950633299022
                },
                "stars": 3
            },
            {
                "review": "Avoid this place. They took 45 min to get our food. Others please share your experiences",
                "reviewer_id": "inbKDTwXioKzdAqNvBysRw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.339007693212662,
                    "positive_probability": 0.6609923067873392
                },
                "stars": 1
            },
            {
                "review": "The food is great. I had lamb vindaloo, samosas, and paneer pakora, I would order them all again. The place gets really busy, and there isn't a ton of space for people to wait so it can get cramped. They also do a lot of take out business, so aside from people waiting to dine in, there are also people waiting for carry out. Service is ok, I sat at the bar, so I felt better taken care of than those sitting at the tables. There aren't that many people working, so I suggest you go early to ensure better service. Overall, I am looking forward to my next visit to Sitara.",
                "reviewer_id": "jfnxH8u5ksFVLoZlyzIkEA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9241409022115561,
                    "positive_probability": 0.07585909778844618
                },
                "stars": 4
            },
            {
                "review": "I'm here on a weekly basis, often multiple times a week to get my fix. I've finally had a less than ideal experience and I'm so happy that the owner handled it perfectly. I would hate to lose my delicious Indian food because of one unpleasant experience! As soon as the owner heard of my displeasure, he handled it immediately and appropriately. I still love, love, love this place!",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01899117093836144,
                    "positive_probability": 0.9810088290616364
                },
                "stars": 5
            },
            {
                "review": "Strongly recommend most or all of the vegetarian options -- the malai kofta, paneer makhani, paneer tikka masala, paneer do pyaza are all delicious! I would actually say this is one of my favorite restaurants in CU. The only downside is that some nights of the week it can be hard to get a table. Tuesdays for some reason seem to be packed...",
                "reviewer_id": "JIlYVnE8vM2MuANmg85WhQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.020650655441844586,
                    "positive_probability": 0.9793493445581575
                },
                "stars": 5
            },
            {
                "review": "Consistently good with fast, attentive service.  Spicy available upon request!",
                "reviewer_id": "jrArXpCDX49mD8Qj0iNAmg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04607673745257988,
                    "positive_probability": 0.9539232625474213
                },
                "stars": 4
            },
            {
                "review": "This place is the real deal...Had panak paneer and lamb curry with naan and it was excellent. Would highly recommend and I will definitely be back in the future.",
                "reviewer_id": "K_E_UAk7IQGPHqz8IE7iSw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04432256601290576,
                    "positive_probability": 0.9556774339870949
                },
                "stars": 5
            },
            {
                "review": "The good: I used to settle for Bombay Indian until this place opened. I love their Baigan Bharta (veggie eggplant) and they have this naan with lamb that is always delicious. Service is pretty good. The bad: There isn't a ton of seating and I have gotten cold dishes sometimes. Overall, good food and decent prices (most entrees are $8-12)",
                "reviewer_id": "lR8ztGfJzRv-dp9ZPyooUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2850094748277403,
                    "positive_probability": 0.7149905251722604
                },
                "stars": 4
            },
            {
                "review": "Place was busy waiting period for both or table was over 30 min It was 7:15 pm Saturday I should have known in Urbana IN student town! Anyway using my Hindi I got spot on Bar! Not comfortable but when you are hungry any thing goesOrdered kadai paneer - soft cheese cubes with green peppers and tomato in spicy sauce see pic of bowl Food was prepared medium hot and Nan extra rice with glass of Red wine Cabernet Delicious , good service , Place like a diner with booths",
                "reviewer_id": "LveLWNZnfH2MD_m0-dSnZw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.418692771678074,
                    "positive_probability": 0.5813072283219206
                },
                "stars": 4
            },
            {
                "review": "the food here is quite good.  came by with water frequently.  take out takes them awhile...expect 40 minutes.  my only complaint is that they either never have the Indian pickles, or forget to bring them out to me.  the ambience is nice inside, but sit near the front for better AC.  I sat in the back once and it was really hot.",
                "reviewer_id": "LW09F4m0l6Ku0-N1NEs2aQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9383830653201346,
                    "positive_probability": 0.061616934679861915
                },
                "stars": 4
            },
            {
                "review": "My friend and I went here after I read other reviews on Yelp, and consulted another friend of mine.  We had TONS of food (3 appetizers, naan, and a main course for each of us) and our total was just under $40.  This was my first experience with Indian food, and I'm pleased to say that I'll be back!  I had the Butter Chicken, which is Tandoori Chicken in a tomato sauce with rice.  It was delicious.  My friend had the Chicken Vendaloo, which was also quite tasty.  The naan was soft and pillowy and great for sopping up the extra sauce.  We each had a samosa (yummm) and shared the aloo tikki appetizer (so, so good with each of the provided dipping sauces).  We split the chicken sekuwa appetizer as well.  After being intimidated by Indian food for so long, I'm glad I finally took the plunge at Sitara.UPDATE:  I visited again the other night and had the Tandoori Shrimp.  Holy cow, it was amazing.  It's served with rice and yellow dal and everything was so tasty.  Thanks again, Sitara!",
                "reviewer_id": "LyhDaybYK7tMS1y-Z6xBJw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.1301956396236568e-05,
                    "positive_probability": 0.999978698043599
                },
                "stars": 5
            },
            {
                "review": "I am new to the area and am starting to test out restaurants.  This one did not disappoint.  I deducted one star because the delivery time was going to take an eternity, so I had to go pick it up.  I know that doesn't sound like a huge hardship, but I was already in my PJs and parking is a little tricky there.  That said, the food was great.  I ordered the following:Samosas:  they were crispy and soft in the perfect way.  The potato filling was super tasty and they are not shy with spices. The green dipping sauce (sorry, no idea what it's called) was spicy and delicious.  I could eat these all day.  Probably shouldn't.Veggie curry: Fantastic!  Great mix of veggies, not too much cream. Even better reheated the next day.  Finishing it as I type.I look forward to eating there, it looks like a cute, laid-back space.",
                "reviewer_id": "m0vNicCTXaRmrtCYdLfZ_g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007049947756704976,
                    "positive_probability": 0.9929500522432992
                },
                "stars": 4
            },
            {
                "review": "Not the best north Indian food we have ever tried, but the best in town. We ate here several times since it opened and it was consistently good. If you're like me and don't get anything that doesn't contain meat, I recommend you make an exception for the Bhindi Masala (okra curry).",
                "reviewer_id": "N3M-bHI-uYpunI7rpvES0A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008273289279107837,
                    "positive_probability": 0.991726710720891
                },
                "stars": 5
            },
            {
                "review": "Glad to update that this place definitely deserves 5 stars. At Sitara they consistently serve delicious Indian cuisine for a great price. Service never disappoints, and we just love coming here. If you haven't been yet, what are you waiting for?",
                "reviewer_id": "N7cIbEOvl55MQ9Syz6QQvw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09134613967883713,
                    "positive_probability": 0.9086538603211608
                },
                "stars": 5
            },
            {
                "review": "Clean and nice atmosphere. Waiters were attentive and gave refills when needed. Lunch was garlic nan, chicken tikka masala, and side of rice. Food was pretty good in comparison to the authentic foods I had in India.",
                "reviewer_id": "noPh2OdeARnyFiwbcqakAg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0020003817076807815,
                    "positive_probability": 0.9979996182923181
                },
                "stars": 4
            },
            {
                "review": "Sitara is the most authentic Indian food I've ever had. I absolutely love it. Great quality for the price and quick! I would eat here every day if I could. The Na'an is fantastic!!",
                "reviewer_id": "oGRK6mxd7jed067DErg4_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.146516290253558,
                    "positive_probability": 0.8534837097464442
                },
                "stars": 5
            },
            {
                "review": "One of my favorite places to eat. Very reasonably priced and the food is delicious. I suggest the chicken tika masala, lamb vindaloo and the garlic naan. I highly recommend it! Service is also polite. They make sure that you always have enough to drink and are speedy.",
                "reviewer_id": "P29uma96Ut2nRv0o4Yd-Yg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03357223902674425,
                    "positive_probability": 0.9664277609732597
                },
                "stars": 5
            },
            {
                "review": "Sitara opened on Tuesday, September 3, 2013. The owner used to be the counterman at Bombay at 4th & Green in campus.Unlike Bombay, Sitara serves on china plates with metal flatware, waiter service and nicer digs all around.I had the spicy fish chili  for $7.99 at lunch.  The Fish Chili has large chucks of whitefish and green peppers in a hot brown sauce. Excellent, with a nice kick to it. This place will be a regular lunch stop for Downtown Urbana folks.  Prices are reasonable, about the same as the Bombay at 4th & Green, but not eating off of styrofoam with plastic forks.  Lunch entrees were $5.99, $6.99 and $7.99.Sitara is in the space formerly occupied by the Embassy, The Red Star Liquors, and Black Rock Pizza; all across the street from Busey Bank's parking lot on Race Street between Elm and Main.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9526722638878015,
                    "positive_probability": 0.04732773611219068
                },
                "stars": 5
            },
            {
                "review": "I've been to Sitara three or four times now and the food is really good - especially the chicken tikka masala and the palak paneer. The naan bread is very fresh and tasty. The service is great and they deliver too, promptly and cheerfully. So glad they opened up in downtown Urbana.",
                "reviewer_id": "pZhhLfJQGiRsJmvgZJZZwg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27227614908393316,
                    "positive_probability": 0.7277238509160638
                },
                "stars": 4
            },
            {
                "review": "Great food. Awful service. I went one night at 7pm and was immediately sat at the bar. I waited 15 minutes to order. After ordering I waited at least 45 minutes for the food. Drink refills were slow. Waiter was not friendly. Honestly, order take out and then you don't have to deal with the service. The food was great but didn't make up for the time spent waiting.",
                "reviewer_id": "Q_sDeVjJvMoQ5vdafAe0jA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9657167523225962,
                    "positive_probability": 0.034283247677402456
                },
                "stars": 2
            },
            {
                "review": "Solidly good Indian fare. Went with a group and had the huge booth in the back. Good ambiance. Friendly servers. Good selection of 'ethnic' beers. Friends got the Flying Horse Royal Lager which was pretty awesome (light). All the apps and breads were tasty. My chicken korma was great. Was totally full, but still squeezed in some mango and pistachio ice cream. Certain to be my Chambana Indian restaurant for both in-house and take-out.",
                "reviewer_id": "QcUu5RAGsGj7TaTObT6asQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1120816209015539,
                    "positive_probability": 0.887918379098442
                },
                "stars": 4
            },
            {
                "review": "I looooooooooove Indian food! For so many years, the only place I went in the CU area was Bombay on Green Street. Not long after Sitara opened, my mom took me for my birthday dinner when I was down from the city. So this review is a bit delayed :) Like I said I am always down for Indian, and I was happy to learn that a new restaurant had opened in downtown Urbana! I was very pleased with the service as well as the food. We came in later on a Wednesday night and were one of the only ones in the place. We shared a couple of entrees and were delighted with everything we ordered. I would definitely recommend Sitara to an Indian food veteran or novice! It is a great place to eat.",
                "reviewer_id": "qCWAhycUgwCMmCladkrlrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0015724600717232265,
                    "positive_probability": 0.9984275399282755
                },
                "stars": 5
            },
            {
                "review": "Really good Indian, especially enjoyed the chicken tiki marsala and the naan. The yellow dal was a little runny for my personal taste, but still very flavorful. Generally good service (I have a toddler, and they were VERY supportive and attentive to what we needed), although a couple missteps. All in all, we're headed back again!",
                "reviewer_id": "qgYsOi1d7ItJU62Y-GTlxw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006078499281775718,
                    "positive_probability": 0.9993921500718258
                },
                "stars": 4
            },
            {
                "review": "Sitara has the standard north-Indian cuisine which is toned down a little to suit the american palate without loosing the flavor!Ambiance is of a closed dance-bar or a gastro-pub. There is a huge bar which seems out of place. The bathroom area is best to be avoided before ordering your food. Overall service is less than good. Wait staff is running around doing a lot of things and don't have time to tend to your needs, so if you need something ask anyone!! We had two vegetarian entrees with rice and naan and some raita. Everything was freshly made without frozen curry. Taste was very good and overall I enjoyed the meal. Portion sizes are good for two people to share but only one dish between two might be too little for main meal. I was able to get a lunch out of left overs the next day. This restaurant has potential to provide better experience but as long as food is good, I will still come back again.",
                "reviewer_id": "qL7fhzHgiH7SNZv24GxPig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015043076545395459,
                    "positive_probability": 0.9849569234546014
                },
                "stars": 3
            },
            {
                "review": "Went to Sitara yesterday for the first time.  What a nice surprise after having eaten at another Indian restaurant int he area a few months ago.  Great service, excellent food and  nice decor.  Staff were friendly and attentive and service was quick.  Excellent food!  Will be going back.",
                "reviewer_id": "QlkCVNDTDhu0Mjbh2mVtBg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0004676619678717922,
                    "positive_probability": 0.9995323380321239
                },
                "stars": 4
            },
            {
                "review": "My favorite Indian place in town! The staff is so friendly and always knows exactly how we want our food done (even if we aren't sure how we want it done, haha!). It gets packed at dinner time, but take out is a good option too! Never been disappointed with a meal from here!",
                "reviewer_id": "QpTo3py9yik7AJCeCFgHDQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20702621354161044,
                    "positive_probability": 0.7929737864583892
                },
                "stars": 5
            },
            {
                "review": "I was on a short visit to Urbana, and visited this place. There are three types of Indian restaurants: 1. The ones Indians love, because it is authentic (but is not very much liked by others) 2. The ones everyone else loves, but Indians generally do not, because the cuisine is 'westernized' to cater everyone and 3. the rare ones that is liked by everyone because the food is just plain awesome. This one belongs to the second category, and I feel is pretty over-hyped. You can visit here once!",
                "reviewer_id": "Qyy0C-2LLm2oFmjt3KJGHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014862609735811376,
                    "positive_probability": 0.985137390264187
                },
                "stars": 3
            },
            {
                "review": "I feel like giving them a 2 star is being kind. Should of paid better attention to the health department warning outside. Food is just okay, but the overall cleanliness is not up to par. Would not recommend. Wait staff is very slow.",
                "reviewer_id": "qZJ6bbq5rHb_T75pj3v3eQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20002690057912426,
                    "positive_probability": 0.7999730994208738
                },
                "stars": 2
            },
            {
                "review": "Food was spicy even it said to be mild. But the curry tasted very good. Nan was soft and warm!",
                "reviewer_id": "r_qusk0u1v7kAOek0LK7xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.054668080843723786,
                    "positive_probability": 0.9453319191562757
                },
                "stars": 4
            },
            {
                "review": "I love Sitara. I always get the same thing, but it's because it is so good that I don't want to try anything else. (I probably should, I am sure that everything they cook is delicious). I usually got samosa chaat and chicken vendaloo. Samosa chat is so delicious, so fresh and full of glavor! And vindaloo is perfectly spicy and chicken is so tender that it really melts in your mouth. Service is very attentive when I dine there and I order for delivery frequently as well.",
                "reviewer_id": "Rbgad6WYUC5rIaaWTwoLxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00018180333432697886,
                    "positive_probability": 0.9998181966656714
                },
                "stars": 5
            },
            {
                "review": "I love this Indian restaurant! I've been to many across Central Illinois and have even been to India. Their chicken mahkani is great and can be ordered at several levels of spicyness. Naan is great, too. The service has always been excellent. They even made lamb jalfrenzi for me even though it wasn't on the menu. In addition, their prices are some (if not the most) affordable in town!",
                "reviewer_id": "rQBGuKfWbgSgsdpUd99qOQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023008326635602167,
                    "positive_probability": 0.9769916733644013
                },
                "stars": 5
            },
            {
                "review": "Service was a bit slow but the food and drinks were very good. Try one of their lassis and a vindaloo dish for an amazing combination. Their naan is pretty much on-point as well.",
                "reviewer_id": "RvYWDZSFv-wL4waACRswrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33554243834151426,
                    "positive_probability": 0.664457561658484
                },
                "stars": 4
            },
            {
                "review": "The restaurant was very clean and the service was good. The food was very rich, delicious and well spiced. I also found that their menu descriptions and spiciness ratings were accurate for the dishes we tried. Overall, a great value for the money. I have eaten at a lot of Indian restaurants in the bay area and Sitara is on par with big city cuisine. I recommend trying them!",
                "reviewer_id": "SBQYD580gsDXAa9eTpKEIg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03167829767553774,
                    "positive_probability": 0.9683217023244626
                },
                "stars": 4
            },
            {
                "review": "Its a new place and we went to check it out. The ambience was really good but the food was exactly opposite to that...In one word it was \"horrible\" and the presentation was even \"worse\". We ordered lamb and chicken biryani. It seems that it was more of boiled rice mixed with turmeric and cooked meat. The appetizers were also not well cooked. The lollipop chicken was so small in size that I felt sorry for the actual weak chicken. There was some $16 chicken dish with 5-6 different styled chicken dishes. I felt one of the chicken pieces tasted funny...oohhh... The food was totally bland and tasteless...worst indian food I have had in my 6 years of Champaign life. The only good thing I would say was the mango lassi and the gulab jamun. Although I am not sure if the gulab jamun was made in their kitchen or was from a tin can.The owner of this place used to work in Bombay India on Green St and the food there was good or atleast the biryani there was pretty good. His current place Sitara's food is no where compared to the Bombay's food. It is surprising. With this kind of food, I am not so sure this restaurant will survive. Probably change the cook. I am never going there again and would not recommend it to any of my friends.",
                "reviewer_id": "ssWrIMkV2R_BbgD1HwA9Sw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.027161936581336935,
                    "positive_probability": 0.9728380634186582
                },
                "stars": 1
            },
            {
                "review": "Huge pleasant surprise! The naan was so delicious like those we find on Devon street (Indian Town) in Chicago. The rest of the dishes were a bit salty but still very tasty.",
                "reviewer_id": "t3Db5XLZEPscxzXBoD70lg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07693535274111836,
                    "positive_probability": 0.9230646472588834
                },
                "stars": 4
            },
            {
                "review": "The best Indian food in the area. Period. My favorite chill spot.I have been in champaign on a small time for work. Probably around 7 months. I travel more than most and rely and the vast Internet for food and drink. The Internet didn't provide me this spot. The locals praise it and directed me towards it. It has not only the friendliest staff but it has amazing Indian food for the area. It had amazing Indian food for all the places I've been to. Need a place to decompress? Have a beer at their bar and order something amazing.",
                "reviewer_id": "T4ADiU8_TX5ztHgC69hiPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0026267824247417928,
                    "positive_probability": 0.9973732175752565
                },
                "stars": 5
            },
            {
                "review": "Chicken Vindaloo and Tandori Chicken... (yeah, I like chicken!) was had today for lunch.  It was way good.  The naan was massive.  The staff was on top of things.  one star off for making me ask for Raita for my Tandori chicken.. come on!  Overall it was great.i'll be back.ps. thanks for not being an Indian Buffet spot, there is a time and a place for that, but not in downtown Urbana.  Make us order dishes, and not have to waddle out big american style.",
                "reviewer_id": "Tl2Gw7MX0srZ-S0W_lCiwA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45734480954582385,
                    "positive_probability": 0.5426551904541752
                },
                "stars": 4
            },
            {
                "review": "Amazing food and service. The owner is wonderful. My favorites are dal makahni and palak paneer. Extensive vegetarian menu. I love this place!",
                "reviewer_id": "TRGxSMXsZuCzpwA8aEMK0w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.222258955206483,
                    "positive_probability": 0.7777410447935177
                },
                "stars": 5
            },
            {
                "review": "Some of the best Indian food in Champaign. But the service is definitely not good.",
                "reviewer_id": "U-UQzI4kp-btg4Ee3Vo1JQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2693731678526485,
                    "positive_probability": 0.7306268321473512
                },
                "stars": 4
            },
            {
                "review": "Great kebabs...adequate spice...would strongly recommend...ambience is good...we ordered paneer tikka which had more gravy than expected but it turned out to be good...lassi was excellent",
                "reviewer_id": "UDJkLRsvXWMBorbw9VheKQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22949828316717594,
                    "positive_probability": 0.7705017168328229
                },
                "stars": 4
            },
            {
                "review": "Quite easily the best (Northern) Indian restaurant in Champaign-Urbana, and one of the best I've been to anywhere. The food is fresh, and the range of flavors broad and well balanced. Spice level is very moderate and can be increased on request for those desiring a more invigorating experience. The napkins are cloth and quite absorbent, very capable of handling a level 3 Vendaloo's worth of forehead sweat.I'd list the dishes I prefer but they have all been excellent and I have no one favorite, though I do get the fish curry and chicken do pyaza more frequently than others. I love rice but choose paratha nine times out of ten, only occasionally getting rice or garlic naan. The samosas are perfect and don't forget the tamarind sauce, which is a great highlight to the main dish also.I'm not sure how anyone could give this place one star, especially having not even tried the food. The owner Bobby is a straight shooter, by all means check your ticket but I find it difficult to believe he or his staff are cheating the totals.",
                "reviewer_id": "UeMX4z69M0IW7H9fyWWT8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.0934331031883167e-05,
                    "positive_probability": 0.9999890656689505
                },
                "stars": 5
            },
            {
                "review": "Lunch special Thalis offer a nice variety. Otherwise, the rice dishes, e.g number 37, is another great option for people who enjoy tasting a little bit of everything, and want to avoid the stress of deciding which curries and rice or naan to order a la carte. Fair prices, tasty food, and comfortable location.",
                "reviewer_id": "uILpE4ihC09BBdNf7LgDHw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04758580928619374,
                    "positive_probability": 0.9524141907138084
                },
                "stars": 4
            },
            {
                "review": "Friendly attentive service, serving tasty Indian cuisine. I've had their biryani and lamb vindaloo. Both dishes were beautifully prepared and came piping hot from the kitchen. The naan is very good here as well. I've had the garlic and cheese varieties (so far).I like my food spicy and they had no problem making my order spicier than usual. The Bollywood shows they have on the TVs provided good entertainment during the meal as well.Overall I'd say this place is deserving of the good ratings it has received so far.",
                "reviewer_id": "uIrIwjy4fy1cGAPDUgSBSw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.096695056487705e-05,
                    "positive_probability": 0.9999190330494342
                },
                "stars": 5
            },
            {
                "review": "I absolutely love this place and get the same thing every time: The shrimp vendaloo spicy x2. The naan is incredible and for lunch it's around $8.00. My only complaint is that the bar is underutilized. They need to do something with the decor to make that more appealing.",
                "reviewer_id": "uzUFxNjZSpFjHX6LaaSq9g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7929873279870152,
                    "positive_probability": 0.20701267201298787
                },
                "stars": 4
            },
            {
                "review": "After hearing from a friend that the Chef and manager who had previously worked at Bombay was working at this new restaurant, we had to go. My girlfriend and I had been going to Bombay almost every week for two years but noticed a gradual decline in the quality of the food. The food we were looking for was at Sitara.The food was just as great as it was before. I always get the chicken korma 2x spicy while my girlfriend gets the (Sitara) chicken aloo also 2x spicy. The naan amazing and a must-have.The only reason I am giving this a 4 is because the service is very dependent upon your server. Sometimes everything will be perfect, other times you'll be ignored from the time you get your food to when you get the check handed to you without a thing being said.",
                "reviewer_id": "w1wvLrrPQZWHF2aB9POTMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0014890742355688881,
                    "positive_probability": 0.9985109257644232
                },
                "stars": 4
            },
            {
                "review": "I'm not sure what kind of drugs they're putting in their food but I am seriously addicted. I struggle not to eat there more than once a week. It's not just some of the best Indian/curry around, it's some of the best food of any genre I have found in C-U. I am so thankful my coworkers took me here as I am from Colorado and have been struggling to find good restaurants around the area. Highly recommend the chicken tikka masala with rice and naan. I haven't even ordered it with any spice but I hear good things. Check em out!",
                "reviewer_id": "we86SYw-dL7szBlSIwlXvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013363754299246725,
                    "positive_probability": 0.9866362457007516
                },
                "stars": 5
            },
            {
                "review": "This place is the best Indian food in the CU area. The Chicken Korma and the Naan are to die for. I can't get enough of Sitara!",
                "reviewer_id": "wHH8VS5oxWnicRo1iiwhkA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3853521256677567,
                    "positive_probability": 0.6146478743322439
                },
                "stars": 5
            },
            {
                "review": "Order something with naan; they are really good. I ordered grilled lamb and they are delicious too.",
                "reviewer_id": "wVQab8RRmPwhQ2fGiQnhyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2670039190984603,
                    "positive_probability": 0.7329960809015406
                },
                "stars": 4
            },
            {
                "review": "I am definitely a fan of the food at Sitara. The quality of the food is good, and the flavors are spot on. I've done both eating in and take out, and I would suggest doing take out if you're short on time because the service can be a bit slow. I personally feel like the entrees could be just a little bit bigger, and I wish they would add onion chutney to their chutney offerings.",
                "reviewer_id": "x8zEbTbVFv9Ju1U_Y3xrIw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06662194087434274,
                    "positive_probability": 0.933378059125657
                },
                "stars": 5
            },
            {
                "review": "This is now my favorite Indian place in town.  The food was hot and good, portions were a bit small as usual with most indian places but it was still plenty for leftovers with some naan & two entrees.  The vegetable korma is the best in town.",
                "reviewer_id": "xi2-U4ma6tgBScEv3eCgYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07543283488416343,
                    "positive_probability": 0.9245671651158411
                },
                "stars": 5
            },
            {
                "review": "This is in the top 5 of ALL restaurants in Champaign/Urbana.  The garlic naan, spicy chicken, shrimp, Samosas, all excellent.My only criticism, they seem to have an aversion to putting ice in your drinks, its odd but easily remedied.I look forward to every visit go this wonderful place!",
                "reviewer_id": "xZhXEZnxK9eJ-gMzAn5GRg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025673275984787747,
                    "positive_probability": 0.9743267240152087
                },
                "stars": 5
            },
            {
                "review": "This was my first experience with Indian food and I wasn't too impressed. Sitara has the best reviews on Yelp and I even ordered a lot of food to try and get a variety of different things.I had the mixed grill which is Malai, Tikka, Garlic and Tandoori Chicken, and also comes with a lamb seekh kabob. I also got the Paneer Pakoras and the yellow Dol and rice which came with the meal.Almost all of the chicken were in boneless chunks, with the exception of 2 wings, which I believe were the Tandoori. They were all pretty dry and almost similar to each other. Maybe this is because they are grilled rather than fried? Maybe I'm just used to heavily breaded chicken? I'm not sure. I did like the flavor of the Tikka(?) though, it was a little sweet and spicy. The lamb kabab was a little more flavorful and better in consistency but still wasn't as good as I'd hoped. Now, the rice that came with my entre was surprisingly good for being just basmati rice. I was also given what felt like at least a pound of it, so no shortage there. The yellow Dol is not something I ever had before, but that I did like. It had a really interesting herbal flavor to it and can most closely be described as a soup.I also got an appetizer of Paneer Pakoras which I'd say are similar to a mozzarella stick but not as greasy and heavy. These were good but by the time I had gotten around to eating them were inevitably cold. They were unusually tasty and came with 2 dipping sauces. One was a VERY spicy green sauce and I'm not sure about the other one, possibly a sweet berry sauce. Either way these sauces were delicious and I ended up dipping my chicken in them.Overall the portion to price ratio was pretty good, although I wasn't very happy about how expensive my meal was considering I didn't much care for the chicken which was most of my dinner.Delivery speed was really quick probably about 30 minutes but I actually think the delivery was the reason I didn't enjoy my food. Often times with delivery things sit around and get overcooked in the process. I think if I am ever to try Sitara, or any Indian food again, I will definitely go into the actual restaurant. From the pictures I've looked at, most Indian food looks very moist and saucy which is what I was hoping mine would be, but it was kind of dry.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.020127482084586083,
                    "positive_probability": 0.9798725179153955
                },
                "stars": 2
            },
            {
                "review": "I have never seen peoples  like this down to earth owners always ready for any kind of food ...I have never seen indian restaurant like this in chicago or Champaign I have tasted many restaurant like:India houseChicago curry house Curry hut Clay ovenindian gardenMt. Everest Curry bowl Punjabi dhabaBombay bistros Bombay chat Peacocks indian resturaant Tava  indian resturaant I rate sithara one of the best food.Best of luck for my friend Bobby, Hari and Ujjal ...keep up the good work",
                "reviewer_id": "yD8IVbVV8mOaydNJOawJFQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001358709775090905,
                    "positive_probability": 0.998641290224905
                },
                "stars": 5
            },
            {
                "review": "The food here is amazing and the service has improved markedly since the last time I was here two months ago!!! A must for any vegetarian eater in the area.",
                "reviewer_id": "yRfZuha43mCJdNEX4FADpg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014005552793117363,
                    "positive_probability": 0.9859944472068817
                },
                "stars": 5
            },
            {
                "review": "When it comes to Indian this is the place. I have had almost everything under the chicken menu. Never disappoints. Great atmosphere and friendly staff. Prices are great and they have great deals on gift certificates too for the holiday season.",
                "reviewer_id": "zvMcMGuG7nXP1zUdsY0AwQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06147091034188403,
                    "positive_probability": 0.938529089658116
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "6UftUvNBqANqybf8wpWeNA",
            "1tK0k-vRgGFC3oSZNUJ58Q",
            "mbHfXlcPGQyPKtuh5CJ1Iw",
            "F1UsF9LU5h7xp1k9LytT-w",
            "RSIWC7s6Mq3FCTKxuapd8Q",
            "caK31Iq3TClNCRB9WH9lhQ",
            "oP8KsXHOUA_otHHI5JHScQ",
            "cmLB5X26RJXWdZ2qrS5KOg",
            "mtQHSFxx35emKstqMxp9Cw",
            "IZOKtFjm_hiL4OGmCq2NNA"
        ]
    },
    "1tK0k-vRgGFC3oSZNUJ58Q": {
        "keywords": {
            "bigrams": [
                "indian_food",
                "bombay_grill",
                "green_street",
                "indian_grill",
                "credit_card",
                "indian_restaurants",
                "lunch_specials",
                "food_good",
                "bombay_indian",
                "chicken_tikka"
            ],
            "unigrams": [
                "food",
                "indian",
                "naan",
                "place",
                "chicken",
                "lunch",
                "bombay",
                "good",
                "great",
                "restaurant"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "BYOB/Corkage": "yes_free",
                "Caters": false,
                "Corkage": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": false,
                "Wi-Fi": "no"
            },
            "business_id": "1tK0k-vRgGFC3oSZNUJ58Q",
            "categories": [
                "Indian",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "401 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Monday": {
                    "close": "21:30",
                    "open": "17:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "17:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "17:00"
                },
                "Thursday": {
                    "close": "21:30",
                    "open": "17:00"
                },
                "Tuesday": {
                    "close": "21:30",
                    "open": "17:00"
                },
                "Wednesday": {
                    "close": "21:30",
                    "open": "17:00"
                }
            },
            "latitude": 40.110474,
            "longitude": -88.233544,
            "name": "Bombay Indian Grill",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/UvWc7M5rS9NM6r6xZcF9Jw/ms.jpg",
            "review_count": 70,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "I really like the food here. How is that there is no good Indian food in Champaign-Urbana? Okay Indian food. ",
        "reviews": [
            {
                "review": "I've eaten at a lot of Indian places and I love Indian food. I must say, I was very pleased with this place, especially given its location. The food was delicious and pretty authentic. I gave it four stars because the service was so-so and there was no ice in the water.",
                "reviewer_id": "--YaJOk3UrAdXXUWHNGAeg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.028824093379252264,
                    "positive_probability": 0.9711759066207459
                },
                "stars": 4
            },
            {
                "review": "Totally solid, no-frills Indian food.  The lunch specials are affordable and come with rice/naan (THE LARGEST PIECE OF NAAN YOU'VE EVER SEEN), salad, and a veggie pakora - for under $10.  Yes, please!I've only been to the 1st Street location once, but from what I've tasted, the food is basically the same here.  Creamy chicken tikka masala (my fave, I'm a gringo, I know) with crispy, buttery naan, mmm.  I tried my boyfriend's Lamb Saag dish and loved it also.Why is the lunch so affordable?  Because it's a really small place (the tables are tightly-packed in), there's no waiter service, and your meal is served on Styrofoam.  This is Indian food for poor college students.  If you want a more relaxed, \"restaurant-y\" atmosphere (and don't mind paying a few extra dollars), head over to the Bombay Grill on 1st.  But if, like me, you are in grad school and up to your ass in student loan debt, this is the place for you.",
                "reviewer_id": "-C93MHl3n-O_5KU_zGjEgQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29270348884150427,
                    "positive_probability": 0.7072965111584956
                },
                "stars": 4
            },
            {
                "review": "I LOVE THIS PLACE! Prior to trying out Bombay Indian Grill, I had only tried Indian food once and I absolutely despised it. But when I came down to Champaign I knew I had to give it a second shot and Bombay Indian Grill was the place that stole my heart. Their samosas are crispy and cooked to perfection, their buttery naan is amazing, and their Chicken Makhani was so so good. I wish it was a more spicier dish but it was still delicious with tons of flavor. The waiters are always attentive and friendly - if not too friendly. This place gets busy quickly so go earlier or later than a usual meal time but beware of the 3-5 closing time because I had gone between those times not knowing they closed and I was really disappointed. Learn from my mistake!",
                "reviewer_id": "-GIzvin6t5z02_glV3pdgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22994013806131527,
                    "positive_probability": 0.7700598619386767
                },
                "stars": 5
            },
            {
                "review": "This restaurant was good, fine, but I wasn't particularly impressed.  Ordered vegetable vindaloo.  The place lacks any ambiance, though it does have a nice view of Green Street.  The naan is very good.",
                "reviewer_id": "-r3Tgb4NOmI72HDrLLqhgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.049291244966264185,
                    "positive_probability": 0.9507087550337354
                },
                "stars": 3
            },
            {
                "review": "If you are a female and like to be gawked at, I recommend this place for you. The staff stare like they have never seen a woman before. Also, if you like black hair as a garnish in your chicken makhani, you'll really enjoy it here. Disgusting. Threw out a $10 plate of food after finding hair. Not to mention when brought to the attention of the staff, there was no apology or anything to fix it.",
                "reviewer_id": "0k8nCBGFyPGQm24N9vIEow",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04883781928600662,
                    "positive_probability": 0.9511621807139939
                },
                "stars": 1
            },
            {
                "review": "Nicely seasoned paneer and enormous naan.  Very good and reasonably priced.  Only con is that they serve it on styrofoam plates which isn't very environmentally friendly.  I'd be back once a week or two if I lived on Champaign.",
                "reviewer_id": "1XiPnPQ56kcJzSwrsSnGmw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8906138731644004,
                    "positive_probability": 0.10938612683560246
                },
                "stars": 4
            },
            {
                "review": "I would highly recommend the lamb curry which is spicy and comes with fragrant basmati rice. The naan is really great too. I also enjoy the aloo tikki appetizer, as well as the samosas. I am not an expert on Indian food so I can't tell you how authentic it is, but I can tell you that it is delicious.",
                "reviewer_id": "3DXQC2JALx0UQhpzSPMi6g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02190402519431236,
                    "positive_probability": 0.978095974805692
                },
                "stars": 5
            },
            {
                "review": "I reviewed this in 2009 to let people know that I got food poisoning here. I ate here again and am rating it more highly cause I ate the veg food and it was fine, but mostly because I highly approve of the quantity and quality of their rice.  Working class Asian Americans like myself love their rice and this place is super generous and the quality is very very good. Better than the entree itself in fact.",
                "reviewer_id": "4omuU-xWbf3ty7vrMfbP3Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004034536544660697,
                    "positive_probability": 0.995965463455343
                },
                "stars": 3
            },
            {
                "review": "We love Bombay on Green St! Really delicious Indian food, can't go wrong!",
                "reviewer_id": "5x-D9LqS0VDZlSosk2c3Fg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29668682573229443,
                    "positive_probability": 0.7033131742677053
                },
                "stars": 5
            },
            {
                "review": "Delicious curry, their Nan is also amazing. They have several kinds of Nan, try the garlic or cheese stuffed!",
                "reviewer_id": "6Gy2xDPe01rbFOqeVAc-tA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15562785449808006,
                    "positive_probability": 0.8443721455019197
                },
                "stars": 5
            },
            {
                "review": "This place has a great variety of food! Go here for lunch! The portion is bigger and it's cheaper. You get a salad and a small appetizer with your entree during lunch, but you have to pay for it during dinner. The naan here is absolutely to die for. the only complaint i have about this restaurant is that you will walk out of there smelling like the food. The odor is not the most pleasant so I wouldn't suggest wearing your sunday best.",
                "reviewer_id": "9f3InRLGUVYDsQx5VT_BPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3522702275416522,
                    "positive_probability": 0.6477297724583515
                },
                "stars": 4
            },
            {
                "review": "Rock solid Indian food. Lunch menu is cheaper. Mango Lassi has about three different flavors based on what night you go and a lot of the chicken seems to be prepared beforehand. That being said its great. I love the food, not the lamb for some reason, but its hard to think of anything better for the price.",
                "reviewer_id": "_H5MEMsNrbs-VU5DLPpcAg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06644142749542442,
                    "positive_probability": 0.9335585725045783
                },
                "stars": 4
            },
            {
                "review": "Well, the first week I went here somehow I ended up going three times. I really like the food here. I wouldn't say I'm a connoisseur of Indian food, but it tastes really good to me, and they really do give you a ton. I had the biryani the other day and I was able to eat it for three more meals. The only complaint I might have is that it's a little expensive. (I'd rather have less food and pay less money) Also, I love really spicy food. I've learned my lesson in the past--don't tell Indian or Thai restaurants that you want the food spicy or you might not be able to eat for a week. But I feel like the food here is just not that hot. One exception was this one appetizer...it had big old chunks of jalapeno. Pretty tasty! I'd love to come back.",
                "reviewer_id": "_hz_dF3yYAUdbD8rwqbVPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4583244767164129,
                    "positive_probability": 0.5416755232835958
                },
                "stars": 4
            },
            {
                "review": "This is the best Indian food you'll find in Urbana-Champaign.  Growing up in India and spending more than a decade in New Jersey, I have had luxury of trying out Indian food at many places (incl. home!!).  The taste of the food is authentic, not too spicy, but not at all bland.  True art of Indian food is to use variety of herbs and spices in a way that it enhances the taste of food, but doesn't dominate the overall taste. Many Indian restaurants either are afraid of using spices or carelessly overdo it.   Bombay Grill nails that aspect, so it gets five stars from me. Besides the taste, the food isn't that expensive for an Indian restaurant standard.  We tried weekday buffet last week.  For $11 + tip + tax, it had enough varieties.  Some really good, some right on mediocrity, which is very common with buffet. Their butter chicken and tandoori roast chicken are worth trying.  Saag paneer is phenomenal for those interested in vegetarian options.  Lunch buffet had probably the best naan I've tried in many years.  They are freshly baked and new ones keep coming worm and fluffy from the kitchen. Judging from the buffet food, I can confidently say that a la carte items would be a bang for your buck too!!Next time will try dinner and see if it's equally satisfying as the lunch buffet.",
                "reviewer_id": "A9oNZkfedFK1ZMeJ0Qo6xA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004348512593332704,
                    "positive_probability": 0.9956514874066784
                },
                "stars": 5
            },
            {
                "review": "Tasty food. My favorite was always chicken makhani. Sometimes the manager would give me additional nan (some kind of pita bread but much more tasty) for free. The price is low and you will always end up as full as it gets.Seating was sometimes a problem because the place is kind of small, and it is so good that it gets crowded.I moved away from Chambana to the south west. I have been in some other indian restaurants but no one compares to Bombay Grill regarding taste. I miss it.",
                "reviewer_id": "AllG7uUNhd8VcSXNkm-8wQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0023655461399983446,
                    "positive_probability": 0.9976344538600048
                },
                "stars": 5
            },
            {
                "review": "Okay Indian food. Bit overpriced. The naan is big and fresh. The service is sub par. I ordered an aloo paratha once and the owner brought me a regular paratha. Did you think I didn't know? The vindaloo tastes okay. The lassi is waaayyy too thick. They do have mango kulfi, which Ambar does not. But 10 out of 10 times I would go to Ambar.",
                "reviewer_id": "aX8hmnedCsrLJ7HmD8hwvQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5898344083850064,
                    "positive_probability": 0.4101655916149942
                },
                "stars": 2
            },
            {
                "review": "Let me start by saying, I NEVER had a bad meal at the location on Green Street.However, the problem started when Bombay moved into the old Basmati's restaurant on 1st.For all intents and purposes, this restaurant is Basmati's all over again.  The decor was exactly the same.  The waiters seemed to be the same too.  However, would we still have the same bland food that made Basmati my least favorite restaurant?Well, yes and no.Even with an expanded area for cooking and serving, the food is identical to the location on Green Street.  Wait, no, not identical.  The main courses cost about $3.00 more than on Green Street.Of course there's the addition of alcohol on the menu, but the location on 1st doesn't afford you the great meal at a low price that the Green Street location was so good at.",
                "reviewer_id": "BZjl6W41tc5E2wWyvJ23gQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38101898020208724,
                    "positive_probability": 0.6189810197979093
                },
                "stars": 2
            },
            {
                "review": "Ok, I am a food snob from Los Angeles. Just moved here and to be totally honest  I think the food here is so plain. Yes, you have a lot of great steak places and American food but things such as Sushi ( there is NO good places I have tried each and every one) and Indian are hard to come by. We first went to Basmati and honestly I thought we were doomed. There was no flavor and most dishes seemed to be watered down. NOW, we were driving near campus and we drove by Bombay and I am more then happy we stopped. As for the other poster whos friends said its over spiced, have you tried real Indian food? This is tame in comparison. The food is just right and always served fresh and hot. The semosas are great and served with the best sauces. We love the Gobi Aloo and chicken masala, we will be back to try other dishes. Bottom line other then the lackluster decor and sometimes dirty looking floors this place was a sweet treat for those of us who are used to some variety!",
                "reviewer_id": "cC2SUcqxVoOtrIyVdga9Iw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14855097803800213,
                    "positive_probability": 0.8514490219620046
                },
                "stars": 4
            },
            {
                "review": "I was a little reluctant to try this place out but after getting a thumbs up from my Indian friend, I finally gave in. It is quite a small place with 20 or less small tables. I was there with 5 other friends and found that it is particularly hard to find a table that was big enough to accommodate all of us, especially during lunch time.I was surprised when I tasted their food because I thought it was gonna be really bad. It turned out to be okay although it wasn't excellent. I love their paneer makhani because the sauce was wonderfully creamy but oddly, the paneer tasted like tofu to me. I also had their lentil curry and briyani rice but that weren't as good. You have a choice of a huge naan or rice for lunch specials I think. I'd go for the NAAN if I were you.Expect to spend at least $7 or $8 for vegetarian dishes and more for meats. For the amount of food that they give, the prices are a little steep in my opinion. It's usually the naan that fills me up, not the curry.Updated 5/10/08:I was there for dinner and I realized that it was a completely different experience in the evening. For lunch, you order your food and pay at the cash register. When the food is ready, they will serve it to you in styrofoam plates and plastic cutleries. For dinner, it becomes a sit-down restaurant with table service, cute waitresses, and food served on china and silverware. A stark difference, eh?",
                "reviewer_id": "CX4GcrCCnzfNyAl0cPqGbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.6992975737347235e-05,
                    "positive_probability": 0.999983007024268
                },
                "stars": 3
            },
            {
                "review": "Ordered the a spicy chickpea/potato dish with a side of rice and a soda. Soda was completely flat and lukewarm served with a couple of ice cubes that looked like the server had scooped it out from the bottom depths of the freezer. Rice was stale, cold, and hard. Chickpeas and potatoes were incredibly hard and seem barelt cooked at all. Meal came out to nearly $20. Definitely not worth you money or time! Incredibly poor food quality. Doesn't seem like they put any effort into their food or service.",
                "reviewer_id": "cYZsY2z7eJqT5ArhJWg_6w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8375271731473488,
                    "positive_probability": 0.16247282685264705
                },
                "stars": 1
            },
            {
                "review": "Bombay Grill is hands-down my favorite on-campus restaurant. I know that among my friends, I'm a lone voice in strong favor of them, but trust me, it's so good. They have excellent vegetarian options, the portions are substantial, and the owner is sociable. He demonstrated to me that he is serious about separating vegetarian from non-vegetarian food (at the very least, beef from non-beef): \"I'm Indian. And Hindu.\" And he had a religious tattoo to show that he meant it. I only asked because I've heard of some places using animal broth for vegetarian dishes. Anyway. The curry is always creamy and flavorful. This is the only thing I get so I can't speak for all the dishes (though my friend and I ate at the Bombay buffet on First St... and subsequently puked from superhumanly gorging ourselves on their divine food). So you're probably wondering, \"Jessica, if Bombay is so bitchin' why didn't you give this place 5 stars?\" Okay, truth time. I hope not to offend the manager but rather to have my vexation understood. I got a $9 chicken korma with no chicken. I substituted paneer.  When I became suspicious that I was shortchanged, I asked for a receipt, which I wasn't initially given. I suspected that my substitution was equivalent to something else on the menu that cost more. Turns out, I was almost right. The receipt indeed showed a higher price. But nothing like paneer korma was listed on the menu at the price shown-- there were no paneer extras nor paneer curry dishes at that price. So basically the manager kind of waved a hand and whipped up a price on the spot. I was purposely trying to stay under $10. But that's not my only source of frustration. It's just not knowing what you're getting and making prices willy nilly.The food is truly delicious though. I will still probably come back. But I'll ask what it'll cost before making any substitutions.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.180407500919499e-05,
                    "positive_probability": 0.9999481959249867
                },
                "stars": 3
            },
            {
                "review": "Service was fast.  Prices are very reasonable.  The food is good by Champaign standards and OK by larger market standards.  I had the Chicken Vindaloo which had a nice flavor but was lacking in heat.  The naan was nice but just slightly burnt.  I would go back if I was in champaign and jonesin for some indian food, but i wouldnt seek it out as a fantastic restaurant",
                "reviewer_id": "e41iCt8CwlD66IZENs1zgg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06023003882621427,
                    "positive_probability": 0.939769961173782
                },
                "stars": 3
            },
            {
                "review": "I would eat here for lunch every day if I could.  If only my idiot co-workers would get over their aversion to \"ethnic\" foods.  Rubes.Don't make the same mistake.  Even if the closest you normally come to adventurous food is Panda Express, you would like this food.If you eat here, make sure to order the naan.  It is perfect and HUGE!",
                "reviewer_id": "EMxz314z1gFKqCZau7ye0g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.39648746643248856,
                    "positive_probability": 0.6035125335675082
                },
                "stars": 5
            },
            {
                "review": "Restaurant reviewHmm Indian food selection is very limited in Champaign so I was excited to eat at Bombay again since my medical school days. I had only been here once with my wife for dinner and the food was pretty spicy. The lunch special seemed enticing for 7+ dollars depending on what you order. I wish I took a picture of the menu, maybe next time. The chicken curry I ordered took a bit of time to prepare but it came out piping hot. The curry was not spicy at all which was perfect. It was rich and creamy with ample amount of chicken. The naan was simply the largest naan I have ever seen. It was perfect with the curry. You also get a potato pakora. No salad though as mentioned previously. All and all great, but if you could pay a dollar or two more for buffet at someplace else I probably would go with that for variety. The only downside of this place is that they use plastic ware and plates, but I guess this is a college town after all and I have to lower my standards. Pro: large menu with lunch specials, large naan, not too spicy curryCons: plasticware, slow serviceHidden gem: 7+ dollar lunch specials with large naan or rice and potato pakora",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.043105455571200164,
                    "positive_probability": 0.9568945444287819
                },
                "stars": 4
            },
            {
                "review": "We were on the campus for an event on Saturday and decided to try out this place. The food was awesome, prepared hot. I tried Chicken garlic masala and my wife tried Chicken curry and both were great tasting.Will certainly visit this place next time on the campus.",
                "reviewer_id": "G37pByEqhgw7MGbUX3eXlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0008160868796570147,
                    "positive_probability": 0.9991839131203408
                },
                "stars": 5
            },
            {
                "review": "This place is fantastic for lunch. The Bombay Chicken Aloo is my go-to dish: I usually get it with na'an (flatbread). The na'an is HUGE and you can dip it in the sauce that comes with the chicken dish. Service is quick and the staff is friendly. I've been for dinner once and it was a bit too expensive for a college student. Still, the food is reliable and delicious - check it out!",
                "reviewer_id": "gHTzOYMc5vT1mL65TeWGZw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2900115340202362,
                    "positive_probability": 0.7099884659797663
                },
                "stars": 4
            },
            {
                "review": "Ordered online and the food came delivered and some spilled out but it was really good!! I just wish it didn't spill out. My only complaint. So driver, easy on them turns!!",
                "reviewer_id": "GVdRbXRU-jzk11FwMy8nug",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.044756647176933055,
                    "positive_probability": 0.9552433528230672
                },
                "stars": 3
            },
            {
                "review": "Great super casual and quick Indian, with a nice guy (the owner?) who works the counter.  I concur with most other reviews,  but need to add three things: 1) Their naan is enormous (like the biggest I have ever seen!) and delicious.  2) Their samosas are amazing. Always get them! Worth every calorie.  3) Their women's bathroom is kinda scary and gross (and why I am deducting an additional star). No hot water or paper towels,  dirty, and down a sketchy hallway.  Bombay folks, please fix this!Definitely worth a stop for lunch, and I will be back,  but use the bathroom at home or office before.",
                "reviewer_id": "HP56L5EKlsmFkZTsOE6ISA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9009193581008333,
                    "positive_probability": 0.09908064189916488
                },
                "stars": 3
            },
            {
                "review": "There is a long standing debate between my friends and I over the best Indian restaurant on Green street. Unlike Chinese food here, there isn't much competition, so it's basically Bombay vs. East and West. East and West is completely vegetarian and leans towards Southern Indian style snacks, whereas Bombay Grill has heartier food  and has a more formal dinner.I think some of their dishes are a little overspiced, but the Tandoori chicken is absolutely divine with a crisp skin and the perfect amount of seasoning. I only wish it came with more chicken and less of the lentil side and gigantic naan. Don't get me wrong, the naan here is great, but more of that chicken would be better. The service is quite slow and it is pretty expensive, so I reserve going here for when I really need a treat.",
                "reviewer_id": "HqaXK9toBpQdcz-0-rVwKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.7160507726824984e-05,
                    "positive_probability": 0.9999828394922682
                },
                "stars": 4
            },
            {
                "review": "Really disappointed today as I ordered a Bombay mixed biryani for takeout during lunch hours. As I am paying for it I notice I am being charged dinner price and I remark isn't it a lunch special right now. I've ordered takeout before during lunch hours and was always charge lunch price. The person/owner then remarks it is a dinner biryani which has me really confused since I've ordered it for dinner as well and there is no difference from what I've experienced. As I get home i open the box to see that it's actually only half full. So if I am paying for a dinner portion why is it even less than a usual lunch portion. Very disappointed by this experience.",
                "reviewer_id": "I6pt5_JaBdUtjvFfSsjZlw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023733558606398458,
                    "positive_probability": 0.976266441393593
                },
                "stars": 1
            },
            {
                "review": "This is probably my favorite place to eat in C-U.  I come from Boston, the land of 100 Indian restaurants.  I fell in love with Indian there, and was very wary of moving to a tiny midwestern city.  However, Bombay definitely hits the spot.  I like the typical curry dishes, chicken tikka masala, samosas, naan - all are great here.  My husband is a bit more adventurous and he has never been disappointed.  Granted, it's not better than many of the places we've been to in Boston - but it's way better than I expected for around here!  On the down side, it's pretty small and very crowded around lunch time.  Good luck finding space for more than just 2 at noon!",
                "reviewer_id": "ii3jv_y4YDcNSh9x6uuBrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.411702612089354e-05,
                    "positive_probability": 0.9999158829738775
                },
                "stars": 4
            },
            {
                "review": "Decent, but just much too expensive for the quality of the food and the presentation. Really need to reduce prices rather than raising them. Mashawi slanging 2.99 falafel sandwiches is going to put every other small business (except sakanaya) on green st out of business if people don't get serious with their pricing.",
                "reviewer_id": "IIRBF6_xbWYPbP_mjGI8RA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4143612313015901,
                    "positive_probability": 0.5856387686984059
                },
                "stars": 3
            },
            {
                "review": "Food is delicious.  Hands down, it's fantastic and based on food alone I would have given this place a 4.The reason it's a three though is that the service tends to be lackluster with the servers not really offering recommendations (which can be a problem if you're not that familiar with Indian food) and honestly... no matter when I've been in there the place has been virtually empty.  I'm not entirely sure I know they stay in business.  The ambiance is definitely lacking enough that I take down a star.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013441773009382908,
                    "positive_probability": 0.986558226990621
                },
                "stars": 3
            },
            {
                "review": "Sub-par Indian food, which passes in town. How is that there is no good Indian food in Champaign-Urbana? There are so many amazing Korean and Chinese places. The food here is generic and bland. Not worth the money.",
                "reviewer_id": "ImaaqftmypNyxaL098k0yg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6162792431496796,
                    "positive_probability": 0.38372075685032125
                },
                "stars": 2
            },
            {
                "review": "Bombay has been one of my favorite restaurants in Champaign for almost 5 years. It's dark and cozy inside and smells of masala and fresh yogurt. It seems to be popular, too, because every time I have gone it has been absolutely packed -- but I've never had to wait long for a table, and usually there is no wait at all. They also give you so much food, and I always have enough left over for lunch the next day. Great selection of vegetarian entrees, too, for those that are into that!",
                "reviewer_id": "irnzN5lDB32mVrSPiPw7nw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14573801115876672,
                    "positive_probability": 0.8542619888412373
                },
                "stars": 5
            },
            {
                "review": "I think for cheap Indian, it's hard to do better given its city (C-U).  It's not top shelf Chicago/big city Indian or anything, but it's very good.  In particular, I think this location is better than their sit down restaurant, as it serves very similar food but is noticeably cheaper.  I've had a lot of different dishes here and wasn't really disappointed with anything.  Particular favorite is the saag paneer and spicy chana aloo.",
                "reviewer_id": "IXFGCmgnB8YY-jtPCaNYeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.42220935379310554,
                    "positive_probability": 0.5777906462068975
                },
                "stars": 5
            },
            {
                "review": "generally okay place, a little overpriced for the settings:(  noisy and place is too small, not looking very neat... food portion is below average. maybe not again.",
                "reviewer_id": "iZXnZSzTUWdXe_ZNIixgUA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8315410543517165,
                    "positive_probability": 0.16845894564828484
                },
                "stars": 3
            },
            {
                "review": "Brother took the malay masala chicken , i took the lamb biryani, the seller is very friendly! Very welcoming!  I didnt finish the lamb biryani, perfect flavoring The malay masala was good too!He gave us a naan on the house too",
                "reviewer_id": "kEQnFhmElRs4Zscmc2FIrw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26042903397450345,
                    "positive_probability": 0.7395709660254999
                },
                "stars": 5
            },
            {
                "review": "Food is always fast and fresh here. And I've noticed the naan has gotten considerably larger since I last set foot in here in early 2007. But I'm not complaining!",
                "reviewer_id": "lgNGOlBYaxoWIAPeydQ8cA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10980259187528181,
                    "positive_probability": 0.8901974081247194
                },
                "stars": 4
            },
            {
                "review": "I ordered my food online with my credit card at about 6:30 PM. At 8PM, I called Bombay Indian Grill, and asked about the status of my food. I was told that the delivery guy should be picking up soon.Around 9PM, I called again. This time I was told I had to call delivery.com. I tried calling, and no one picks up. Around 9:30PM, I get a call from the delivery person. When I go to take my food, he says, \"you're supposed to pay with cash.\" I explained that I already paid via yelp's link for online delivery with my credit card. He said, \"it says you are paying with cash.\" I proceed to stand there for fifteen minutes, while he calls various people to finally get to the number to call to confirm my method of payment. He says, \"do you have your credit card?\" I respond, \"no.\" He says, \"you'll need it because they're going to want to confirm the payment.\" Mind you, I am in the law building. My stuff is on the other side of the law building. I am not wandering around looking for my credit card, while he calls people to confirm my payment. I just stood there. At one point, I said, just void this I don't want it. Then my hunger snapped me back to my senses. After some time on the phone, he is told I paid with my credit card already. I told him I would not be using their services again, he said \"okay.\" He walked out unaffected. Around 10 PM, I called the number on delivery.com, and heard no apologies. Thanks Bombay Grill, for providing me with the distinct pleasure of paying $23 to have cold mutter paneer and wilted garlic naan delivered to me more than 2.5 hours after I ordered it. The lack of silverware and napkins was a nice touch.Thanks delivery.com, for demonstrating that incompetence and a lack of care is possible at all levels of an organization.",
                "reviewer_id": "LN3fB5hx6aWqcpJ9_fOwIQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012940714573385543,
                    "positive_probability": 0.9870592854266227
                },
                "stars": 1
            },
            {
                "review": "This is one of my favorite places in CU.  Their Naan is the best Naan of all Naans I've had - and I've had a lot of Naan.  Chicken Tikka and Lamb Curry are my favorites.  With a mango lassi expect to pay around 15 bucks after tax and tip.",
                "reviewer_id": "mXAIhh7PvdIxnbwaPRkrGw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6171652754359338,
                    "positive_probability": 0.38283472456406664
                },
                "stars": 5
            },
            {
                "review": "This restaurant is dam costly and is not at all worth for the food they serve. I am Vegan and Paid $13.2 for just 3 types of sides and naan bread and custard. Food was ot worth more than $6 however we were shocked to see their heavy check. Food is not so tasty to admire. It doesnt have the true authentic Indian food taste. They make sides of potatoes and green peas which are cheap in market to keep their profit margin high. They are smart enough to rob people. Please try other Indian restaurant who give you many option to eat for less than $10.",
                "reviewer_id": "nopVtZX86LqdBwWKRMjqSA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.7465098851769e-05,
                    "positive_probability": 0.9999225349011538
                },
                "stars": 2
            },
            {
                "review": "This place makes no qualms about itself. It is a solid Punjabi joint, creamy curries, paneer and all.  That said, it's rather lacking in spicy inspiration - both locations didn't feature any sort of kick to their curries.  However, the lunch special is all bang for your buck...I recently went here on a lunch meeting and my professor and I were able to split one plate and leave completely stuffed!  I'm glad the only real traditional Punjabi Indian joint in C-U isn't a disaster, but it's nothing to write home about either!",
                "reviewer_id": "OdL7XAqENNpR7A1Z5yMPpg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004046778457024592,
                    "positive_probability": 0.9959532215429661
                },
                "stars": 3
            },
            {
                "review": "Really great Indian food, just a few blocks from campus. For a quick lunch, it's a great amount of excellent food for a good price. Their naan is fresh and flavourful, and they were great at customizing spiciness levels for the various American/Indian palates in our party. A little bit of a small restaurant, their second location on 1st is bigger and features a lunch buffet for the less-adventurous. However, the Green St. location had a variety of great food options, and a Himalayan chicken special that was divine. Great place to meet and catch up, but can get crowded when students/classes are in session.",
                "reviewer_id": "OgWNZVQdRrW624M8xWjvAw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0033617315960207577,
                    "positive_probability": 0.9966382684039761
                },
                "stars": 3
            },
            {
                "review": "This place is Awesome! Chicken saga is tender and flavorful. Coworkers really like the jelfrese. Don't miss the cheese or garlic naan! YUM!",
                "reviewer_id": "oJk4au1iKQvaBnuta6lQhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.050523088400042764,
                    "positive_probability": 0.9494769115999584
                },
                "stars": 5
            },
            {
                "review": "I absolutely think that Bombay Grill has the best chicken mahkani.  No restaurants in Chicago (even on Devon) can compare!  Or maybe I just haven't found that one perfect place in the city yet...So anyways, when I was an undergrad, I luckily lived across the street from Bombay so I would come here all the time.  The manager knew me by my first name, hahahahha that was embarassing.  Yes their prices can be a little expensive but I think it's worth it.  I love their garlic naan too.  What I hate about all indian restaurants is that everything is always separate--- naan, rice, etc.  Blah.Anyways, A+ for Bombay!",
                "reviewer_id": "Pxq3kL29GNo0n1BdB9xJbw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0037235925566776996,
                    "positive_probability": 0.9962764074433212
                },
                "stars": 5
            },
            {
                "review": "Food was pretty average.  Waitress was pleasant.  I ordered the mixed grill.  It was all chicken.  Where was the mix that was on the menu?!?  $15.99 for grilled chicken and a few grilled onions is not a bargain.  No rice. Burnt naan.  I will return to Puran in Bloomington:)",
                "reviewer_id": "q0XqCjIefzm_dA5qmTcFzw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08303370750241815,
                    "positive_probability": 0.9169662924975819
                },
                "stars": 1
            },
            {
                "review": "So good!  Solid Indian food!  Lunchtime special cannot be beat!  Note - it gets busy so be prepared to have to wait if busy meal time.If you are concerned about spice tell them and they will show you the options for non-spicy dishes.",
                "reviewer_id": "RmQn2jSDW4fYEKU5OG3tEg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4966527426035862,
                    "positive_probability": 0.5033472573964135
                },
                "stars": 4
            },
            {
                "review": "I ordered chicken curry, the meat was spoiled and made me throw out. Will not come here ever again.",
                "reviewer_id": "S5iwpwot3tdQ3Rfya_r5Eg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40409464345411084,
                    "positive_probability": 0.595905356545891
                },
                "stars": 1
            },
            {
                "review": "I have no pretensions to being an expert on Indian fare, but Bombay does what it's supposed to do: fill your belly in a reasonable fashion while remaining tasty. The naan is fluffy and delicious, and any of the chicken dishes (I've tried several), are excellent.  However, the lunch rush is pretty intense, and the staff make no bones about letting you know that they are not there to indulge in your lunch hour relaxation.  Expect to see your plates taken away and your table cleaned as a *hint* to mosey on along, partner.  Seriously, a bit awkward to have my table wiped down in mid-sentence.  Still, decent food for what it is, a tiny lunch factory in Campus Town.",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7393979986047174,
                    "positive_probability": 0.2606020013952877
                },
                "stars": 3
            },
            {
                "review": "This place used to be much better, it really has gone downhill in the past year. Perhaps the best comment I can muster is that it's definitely better than Ambar, which  is really not saying a whole lot. But if you must have Indian food, and have no possible way of getting to Race St. in Urbana for good Indian food, then I recommend Bombay Grill.",
                "reviewer_id": "UeMX4z69M0IW7H9fyWWT8g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6914196525416905,
                    "positive_probability": 0.30858034745830804
                },
                "stars": 2
            },
            {
                "review": "This restaurant is a great deal for dinner! For two entrees and an appetizer, the check was about $26, which is pretty good for two people -- and we were stuffed. The food is delicious, the portions are decent, our glasses were always filled with water, and service was prompt.Only two negatives, no liquor license and the atmosphere is a bit lacking. It was a little too loud and a little too crowded, but it's a good place for casual dining.",
                "reviewer_id": "Ujrg8-TO4r55Yh8QkC0DEQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25302894365706524,
                    "positive_probability": 0.7469710563429366
                },
                "stars": 4
            },
            {
                "review": "I've been to Bombay Indaian Grill a couple of times now and everything I've had there was delicious. I've gotten the Bengan Bartha (spicy eggplant) and Aloo Gobi (cauliflower with potatoes), both of which were very tasty with a side of naan bread. The only reason I'm giving them 3 stars instead of 4 is because the food is overpriced: $10 for a small cup of stewed vegetables and naan bread... Pretty ridiculous if you ask me.Overall, I like the food there but because I don't like feeling ripped off, I probably won't come back too often, unless I'm in the vicinity and have an extreme craving for Indian food.",
                "reviewer_id": "UO5eCeTNpnUekttaryBCNw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9383380451776815,
                    "positive_probability": 0.06166195482232733
                },
                "stars": 3
            },
            {
                "review": "I've eaten Indian all over the state, and this place remains my favorite. The portions are generous, the prices are low, and the food is vibrantly flavorful the way Indian should be. I actually worked here for a summer, and I can honestly say I've never eaten better in my life. All day and all night my stomach was a bubbling cauldron of curry. Try the vegetable vindaloo- I put it on the menu!",
                "reviewer_id": "V5mUJaJ-XC64e318UIZ3Zw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014191623966991031,
                    "positive_probability": 0.9858083760330077
                },
                "stars": 5
            },
            {
                "review": "For my grad program I have to spend a few weeks in Champaign every year. When I'm there, I go to this place all the time. The food is great, and it's really cheap at lunch - for $6.99 you can get an enormous amount of your entree, plus either the biggest piece of naan in history OR a giant pile of rice OR some of both, plus a couple pakoras and a salad. What? Fabulous. And it is more than enough food to last for two meals, which is another huge plus.In case that weren't enough, they frequently give me free stuff. I don't totally understand why. I'm not really a regular, and I'm not a supermodel. If this place were on the east coast, I'd guess it was because I'm polite, but this is Champaign, where everyone says \"please\" and \"thank you\" and smiles. So...I don't really understand it, but every time I go there, I get some of another entree, or an extra piece of naan, or a dessert, or a soda. Maybe everybody gets free stuff. Whatever. I'm not one to look a gift daal in the mouth.",
                "reviewer_id": "vDF0lq9W2BlW17-dbPMwfQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5776650818029159,
                    "positive_probability": 0.4223349181970791
                },
                "stars": 5
            },
            {
                "review": "Great indian food; spiced well and not Americanized.. The naan is fresh and amazing.",
                "reviewer_id": "xJrEPz81yEFxnFw0BPCmNw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08587191264922636,
                    "positive_probability": 0.9141280873507743
                },
                "stars": 4
            },
            {
                "review": "Indian food has been my kryptonite as of late.There were 4 people inside the place at 6 on a Friday, which seemed odd.I ordered chicken tikka masala and naan to go, waited about 10 minutes for it, and was on my way. Friendly folks at the counter.The food was good! Great flavor on the masala, just the right amount of spicy, tender chunks of chicken. The naan was gigantic, warm, and quite tasty.Like the other reviews, it seems that overall Bombay is a little overpriced. My order was nearly $15, granted that made 2 large meals for me, but for ~$9 I could have gotten as much (or as little) of a variety of Indian food at Ambar's buffet, which is comparable in taste and quality, I'd say.Either way, it was tasty, I was full, and my Indian food craving was very much satisfied.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0021350498454365875,
                    "positive_probability": 0.997864950154567
                },
                "stars": 4
            },
            {
                "review": "One of the best indian restaurant in Champaign. ..the food is so fresh and authunthic. ..servers are friendly",
                "reviewer_id": "yD8IVbVV8mOaydNJOawJFQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1975898410746775,
                    "positive_probability": 0.8024101589253227
                },
                "stars": 5
            },
            {
                "review": "LOVE it! MUCH better than some of the CU alternatives when it comes to Indian food. I recommend the saag paneer, and they have DELICIOUS naan.",
                "reviewer_id": "yJbA4LdQzE6i3PVWyEXHJw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5090890433441375,
                    "positive_probability": 0.49091095665586265
                },
                "stars": 5
            },
            {
                "review": "Bombay Indian Grill is one of those places that turns its city block (without much else on it) into a feast for the senses.  The spices alone floating out of this place is enough reason to head on over.  And generally the food is pretty good, my only complaint is that I've gotten what I think is food poisoning from this place twice (namely, I'm 100% a-ok prior to the meal, and then about 30 minutes to an hour after, I'm sick as could be!).  That's not always been my experience, but it has a few times, and I think it's something to point out.One of my favorite things here is the warm, toasty (and yes, buttery, like all good ;D) naan.  I mean, I'm pretty sure it's everyone's favorite.  They do a Tiki Marsala that's ahhhh-mazing, especially with the rib meat chicken that's tucked inside it.  So good!While I agree with some of the other patrons, the service can be a little lackluster, the person who owns it is truly nice.  The restaurant is spacious, and well maintained, but, unfortunately it's starting to show its age.  It has been quite a while since they've updated it (I'm not sure it's ever been updated, to tell you the truth).  Regardless, if you're a fan of the Indian cuisine, and have an urge for a Marsala or a Curry, you should check them out!  On their best days, they're amazing!  Unfortunately, on their not so best days, you might expect a problem or two. =X",
                "reviewer_id": "YtbXNQJEJAHZK_2DFXSa6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011589191611983773,
                    "positive_probability": 0.9884108083880088
                },
                "stars": 3
            },
            {
                "review": "The food is really good, terrific. The only reason I would give it a 3 star because the light system in the evening there is absolutely terrible.. I could hardly read my menu there at night..",
                "reviewer_id": "zaZzYW5NfUTNwWuYe0S7SA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6635596538918838,
                    "positive_probability": 0.3364403461081185
                },
                "stars": 3
            },
            {
                "review": "I love the food in here! But the price is a little expensive compared to another Indian grill on green street.",
                "reviewer_id": "ZuifwOgjVFAXsbYrcuK7NA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28944755389953253,
                    "positive_probability": 0.7105524461004677
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "mbHfXlcPGQyPKtuh5CJ1Iw",
            "6UftUvNBqANqybf8wpWeNA",
            "RSIWC7s6Mq3FCTKxuapd8Q",
            "F1UsF9LU5h7xp1k9LytT-w",
            "0a4lX5VhCXJOwe-idxnVbw",
            "caK31Iq3TClNCRB9WH9lhQ",
            "i0_W9_1abdjBS7d5-pWORQ",
            "k0kNhfkp1GrYE15YDApKMg",
            "2SycDjGWWpFs1ODL-YBoHA",
            "fxYiDAxCK33ANk8-QemInA"
        ]
    },
    "6UftUvNBqANqybf8wpWeNA": {
        "keywords": {
            "bigrams": [
                "indian_food",
                "lunch_buffet",
                "chicken_curry",
                "food_good",
                "indian_places",
                "quality_food",
                "vegetarian_dishes",
                "good_food",
                "good_quality",
                "love_place"
            ],
            "unigrams": [
                "food",
                "buffet",
                "indian",
                "good",
                "place",
                "lunch",
                "chicken",
                "don",
                "best",
                "didn"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wi-Fi": "no"
            },
            "business_id": "6UftUvNBqANqybf8wpWeNA",
            "categories": [
                "Indian",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "605 S Wright St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "22:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1113654,
            "longitude": -88.228907,
            "name": "Ambar India",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/vZUEAW0ezG3DbM_dRe5iLg/ms.jpg",
            "review_count": 37,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "was there for the buffet. this place is new and the quality of food is very good. I was there on a lunch buffet. ",
        "reviews": [
            {
                "review": "Awesome food with amazing variety of indian cuisine. It feels jus like havin lunch in a nice dhaba in India! A humble suggestion for non indian patrons...kindly try to opt more for vegetarian options to have a more savory experience. Don't miss on the Chaat samosa and gulab jamuns here!",
                "reviewer_id": "0DTXIKr_qydPkxQv6IOxgg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1464653633830104,
                    "positive_probability": 0.8535346366169851
                },
                "stars": 5
            },
            {
                "review": "this place is new and the quality of food is very good. They have an interesting selection of food for the lunch buffet. Their Tikka masalas are awesome!",
                "reviewer_id": "5Ki-hbA5LSB3fMXShp9yXw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.569106172146505,
                    "positive_probability": 0.43089382785349617
                },
                "stars": 5
            },
            {
                "review": "When I heard that a new Indian restaurant was opening up right next to campus, I could hardly contain my joy. Campustown badly needed another budget Indian restaurant, and Ambar India fills the void perfectly. By no means am I an Indian food connoisseur, but the dishes that comes from both menu and buffet service taste phenomenal. I have been there several times, and I can't exactly recall the names of the things I ate, but trust me, they're great. And if one particular dish doesn't satisfy your palate, there are plenty more that will. The buffet changes daily, so there's no shortage of new flavors to try. Best of all, the lunch buffet is only $8, probably one of the cheapest and most fulfilling meals you can get for your money.Vegetarian options are limited for the buffet, but as a meat-eater, it isn't much of a concern. If you're looking for something with more flavor and spice, try ordering a dish off the menu, but be aware that the portion sizes are a bit on the small side.",
                "reviewer_id": "7s1iQISYzM7GEr3TTTuJww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.30793911706115845,
                    "positive_probability": 0.6920608829388407
                },
                "stars": 5
            },
            {
                "review": "Within Champaign, Ambar definitely has the largest selection of dishes, especially in their well priced buffet. Their aloo mutter and chicken tikka masala is amazing, as well as chicken curry and tandoori chicken which they have almost every day. The rice is fresh and naan is warm. The desert is usually sheera (amaaaazing) or gulab jamun but you can order kulfi or the rasmalai (also amazing)....the restaurant is owned by a very kind Punjabi family and the food, convenience and ambience combined make it one of the best establishments in Champaign. Makes my mouth water to think of it.",
                "reviewer_id": "aX8hmnedCsrLJ7HmD8hwvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011117312679357482,
                    "positive_probability": 0.9888826873206427
                },
                "stars": 5
            },
            {
                "review": "Four of us went there for their lunch buffet for $7.99, which is quite a good price with all the food we have, definitely better deal than Bombay. All are all happy with their buffet.  One suggestion is to label their food better, but when we asked questions, they explained to us in great detail.",
                "reviewer_id": "blJcIY2X3EbxU8sQuswMWg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5419991722394579,
                    "positive_probability": 0.45800082776054113
                },
                "stars": 4
            },
            {
                "review": "My friends and I were really excited to come here. We all love to eat and who doesn't love Indian food? None of us had ever been to Ambar. Well, we got our food and all of us paused and just stared down at our plates for a moment. The food looked bad. Then we tried some. We were silent. One of us said \"Uh. What the fuck.\" We were baffled that we had just paid to eat this nonsense. My Indian friend was like... \"WTF\". Yeah.I came here again and the food seems to have improved both in taste and appearance.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4092408336432445,
                    "positive_probability": 0.590759166356756
                },
                "stars": 3
            },
            {
                "review": "I came here for the lunch buffet. At the time I left I was planning on giving this place 4 stars. It had everything a good value buffet should: decent selection, flavorful food, low price. But my body's reaction over the next few hours require me to remove two of those stars. I didn't get completely sick to the point of puking or having my intestines turn to sludge, but I did feel weak and uncomfortable for the rest of the day. I know that the whole point of buffets is to sacrifice quality for quantity and variety, but having food that's clean enough to not make me sick shouldn't be a particularly high standard to meet.",
                "reviewer_id": "eAwlEPPnWniLDYtyB9cyXg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9869462416185738,
                    "positive_probability": 0.013053758381426852
                },
                "stars": 2
            },
            {
                "review": "So this place suffers the same issue that all buffets do: average quality food for $10. If you want some Indian food, then it's fairly good. The choices don't seem many compared with other buffets. The coconut soup had a piquant spicy taste to it that I suggest anyone try.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.028948157283653016,
                    "positive_probability": 0.9710518427163491
                },
                "stars": 3
            },
            {
                "review": "I go here at least once a week to get Malai Kofta and it is the best I've ever had!",
                "reviewer_id": "eMEE7dJd8sSYqMA0NjwoeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45914586530240936,
                    "positive_probability": 0.5408541346975898
                },
                "stars": 5
            },
            {
                "review": "Although it is has a decent unlimited buffet for the price that it is, the food is quite bland and not the real Indian taste. Can do much better with such a good location.",
                "reviewer_id": "GsAglbf1Q-k01XOVmxP7AQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8837596359579935,
                    "positive_probability": 0.11624036404200859
                },
                "stars": 3
            },
            {
                "review": "Unfortunately a bit hit or miss.  Sometimes the food here is spectacular and absolutely on point and my friends and I will gorge until we're stuffed for days and regretting our decisions in life.   But, even when the food is good however I recognize that it isn't as flavorful as it should/could be for Indian cuisine. Other days the food is just almost unpalatable and doesn't look like it should be served.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3528907195126462,
                    "positive_probability": 0.6471092804873576
                },
                "stars": 3
            },
            {
                "review": "buffet is good imo. I went there with my Indian friend and she told me it's pretty close to authentic.however not happy with takeaway buffet option. was charged $9 for food just weighed hair above 1lb ($5.99 for 1lb) which made me feel scammed. When I complained the guy at the cashier *proudly* pressed the scale to 1.5lb. Mind-blown. (plz, your finger is not in my takeaway box) not want to argue over a few bucks but it simply made the customer discontent with the experience. especially for people like me who consider experience and service over taste in rating. highly impossible to revisit.",
                "reviewer_id": "iZXnZSzTUWdXe_ZNIixgUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.44736254972029316,
                    "positive_probability": 0.5526374502797161
                },
                "stars": 2
            },
            {
                "review": "In a town where most of India restaurants are below average. This place is reasonable. Decent taste, well priced.BTW buffet is below average. I always get takeaways which are much better. Don't judge this place by buffet.",
                "reviewer_id": "jxStSYz2atJFuKmUS0iffw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1185995560778426,
                    "positive_probability": 0.8814004439221553
                },
                "stars": 4
            },
            {
                "review": "Best North Indian food I've had in the US so far. I even liked it better than the several fine dinning Indian places I've tried in NY and Chicago. But I may be biased given that I hail from North India.This is more of a student crowd focused place, so the interiors and seating isn't very fancy. The food however is worth every penny.",
                "reviewer_id": "K18Mu_QWfX5FzeXm4HnWIA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0015902370240755048,
                    "positive_probability": 0.9984097629759192
                },
                "stars": 4
            },
            {
                "review": "This is my go place on campus lately- close to my department, reasonably priced, and the food is great. My only complaint is that the naan could be a bit crispier. Their saag paneer and chicken tikka masala is very good. I'm not one to get too hung up on service, but theirs is excellent as well. The only downfall is limited seating- But, if the place is full, as it usually is around 12-1, you can get take out buffet by the lb.",
                "reviewer_id": "K_E_UAk7IQGPHqz8IE7iSw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012310489047197646,
                    "positive_probability": 0.9876895109528051
                },
                "stars": 5
            },
            {
                "review": "No complaints here. The food is really good and the restaurant is run well for the amount of ppl frequenting the location.",
                "reviewer_id": "LN3fB5hx6aWqcpJ9_fOwIQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09599822683790933,
                    "positive_probability": 0.9040017731620912
                },
                "stars": 4
            },
            {
                "review": "We were craving Indian food while on the road about two hours from home returning from vacation.  I assumed there might be some good places near UIUC.  And while this joint is nothing to write home about on the outside, it is the inside that matters.And boy, is that inside good! My party of six all had the buffet, and everyone loved it.  It might have been the best meal we had on vacation, and the price was right to boot.  The food was spicy enough to please my heat-loving palate, but there were mild entrees for the less adventurous.  Service was, in a word, good! And you can't always say that.All in all, I'm glad this restaurant is far enough from home that I cannot just hop in the car and go there any time, because if I could, I'd be there twice a week.",
                "reviewer_id": "oADl6vOR8Dc3qZnHPFQcOA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7479765536512111,
                    "positive_probability": 0.2520234463487907
                },
                "stars": 5
            },
            {
                "review": "Another excellent buffet dinner ($10 cash!). They have a variety of meat and vegetarian dishes, with sides and dessert. Tonight the saag mushroom was verrry creamy. The chicken tikki masala was sooo good! The dal was spicy but the curry was not. The soji was simple but good, not too sweet. Perfect naan. Eat up!",
                "reviewer_id": "osa5VWfKat-N8cW-7tMqWg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005239303209728348,
                    "positive_probability": 0.9994760696790272
                },
                "stars": 4
            },
            {
                "review": "I personally love this little place. Good Indian food for a decent price. The menu is very big and you get to choose a level of spice. I work near Ambar and stop by a few times a month. They are fast and it tastes delicious.",
                "reviewer_id": "p1TaXI9C1G8-mP6m9RdnWw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5719162308592165,
                    "positive_probability": 0.42808376914078566
                },
                "stars": 5
            },
            {
                "review": "Extremely bad... I ate just once and have decided never go to there.",
                "reviewer_id": "qTzeG-hZFwaHHwQlsQBaPw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2529451425554531,
                    "positive_probability": 0.7470548574445475
                },
                "stars": 1
            },
            {
                "review": "Tried the lunch buffet (takeout). Cheaper than other Indian places in the area but due to the small location size less variety of food as well (half the buffet table is salad bar/dessert/sauces), so it evens out. Nice touch: they weigh the buffet takeout, so you don't have to pay the full price if you don't load up.Naan: just ok, but I did get takeout so it might've suffered a bit in transit. Naan is best fresh and hot.veggie korma: very good, nicely spicy, good flavor, vegetables were good quality.pekora: nicely crunchy even after sitting in a styrofoam box for a few minutes, little salty.palak chana: good, nicely spicy and flavorful, right thickness of saucekidney bean chickpea thing I forget the name of: kind of bland, I usually expect more fire in this dish.tandoori chicken: not great, surprisingly. It was dry and surprisingly hot (spice wise) while being less flavorful than I'm used to. Maybe it'd just been sitting around for awhile (its hard to make dark meat dry!)lemon rice: yellow rice with fried peanuts in it. I liked the peanuts, gave it a nice crunch, but didn't really taste anything else flavor wise; could've just been plain old basmati rice.chicken curry: ok, this is why this place dropped a full star. The chicken curry is bone in, which would be fine if it were whole bone, but the bone is cleaver-chopped, which leaves tiny shards of barely-detectable bone EVERYWHERE. Seriously I was picking through this thing like I was dissecting in a lab to make sure I didn't kill myself with every bite. I don't even remember how it tasted. I realize this is 'authentic' but so is using a cow-dung oven to make naan and I'm betting they don't do that. Debone your chicken curry, you're gonna get sued.The interior decor is really quite nice (a huge change from when it was Wonderdogs, you won't recognize the place), the music wasn't too loud, there was a refreshing lack of tv blaring in the corner, the proprietors are very nice and conscientious, and things were moving along well in such a tight space (you're not going to like it at lunch rush if you're claustrophobic/have a phobia of strange people bumping up against/brushing by you). The vegetarian dishes are better than the meat dishes, and I didn't try everything available on the lunch buffet (two or three more items, a lentil soup, desserts (mango custard sounds really good but I didn't want to mingle flavors).Feels like the vegetarian dishes were better than the meat-based ones, and there is plenty of vegetarian on offer. Wish they'd add samosas to the buffet. Overall I'd recommend it if you want Indian buffet but don't want/don't have time to leave campus, just avoid the chicken curry, especially if you're feeding kids or something.",
                "reviewer_id": "tBiAJtAB4RsXiB4uWxtWrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.693000128584674e-06,
                    "positive_probability": 0.9999933069998597
                },
                "stars": 3
            },
            {
                "review": "I ordered the vegetable and rice dish. I asked for mild. I really couldn't enjoy the dish because it was still way too spicy. The portion size was good but the food was just OK. Very few vegetarian choices on the buffet. The staff wasn't very friendly. Definitely didn't feel warm and inviting.  Can't say I'll be back, too many other places to try.",
                "reviewer_id": "TE32eWcZ4jZJlng1Hm0fnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00011819226032326942,
                    "positive_probability": 0.9998818077396754
                },
                "stars": 2
            },
            {
                "review": "I went there for lunch. Honestly I have had better indian food than this but what made me give one star was an incident there. As I was standing in line for buffet, a guy came out and started putting dishes (I guess he was a dish washer) First he stepped on my foot and no apology. WTH. Then he went inside, came out and hit my head. Srsly? I didn't want to make a hassle since I went with my friends but I am never going to go back to this restaurant nor recommend this place to anyone. Owner should train his employees.",
                "reviewer_id": "tG14ADYYiUPRx37S1rQX7w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4053389549710528,
                    "positive_probability": 0.5946610450289476
                },
                "stars": 1
            },
            {
                "review": "This place was pretty good, but it was a bit more expensive than the other Indian restaurants on campus. The waiters were pretty nice,  but the took a while top give us the checks.",
                "reviewer_id": "UDgX4lFX-Jt2KObLhbUyLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.42214143094238277,
                    "positive_probability": 0.5778585690576186
                },
                "stars": 3
            },
            {
                "review": "My review applies to the lunch buffet only, I may (or may not) try the dinner menu. I found it average at best, the kind of Indian food that is good for people who don't like Indian food. Boringly mild, and lacking the range of flavors that is so appealing about subcontinental cuisine. I may return, but it will likely require some kind of sedative, or grand deception.The establishment itself is clean, and the people friendly. As far as restaurants go, it's fairly good (except for the food).",
                "reviewer_id": "UeMX4z69M0IW7H9fyWWT8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3052704617718627,
                    "positive_probability": 0.6947295382281381
                },
                "stars": 2
            },
            {
                "review": "I've always loved Indian food and this is definitely one of the best on campus! You gonna love the tasty curry and the naan!!!",
                "reviewer_id": "UtV2VM0Xl5MfT5gDWieLAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013259716642049028,
                    "positive_probability": 0.9867402833579495
                },
                "stars": 5
            },
            {
                "review": "Go between 3 and 5 and get the buffet for $8 which is really really cheap. For indians - Have the goat curry in the buffet menu ( If available)",
                "reviewer_id": "VFqR4Eim_7oa9mlr4SbFhg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18887666942458667,
                    "positive_probability": 0.8111233305754131
                },
                "stars": 2
            },
            {
                "review": "I personally love this place. It's so tasty and you get a bunch of food for only $8 if you order the buffet option. All of the workers are really friendly too and are really responsive waiters. I crave it every now and then so I'll stop by 2-3 times a month. They have some really good rice pudding and a bunch of awesome Indian dishes that i don't even know the name of but will shove my mouth anyways. I always leave happy and tired from eating too much.",
                "reviewer_id": "xrORYxPMxZQzTsdMUsgXlQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012985657285924516,
                    "positive_probability": 0.9870143427140832
                },
                "stars": 5
            },
            {
                "review": "I didn't go home for Easter and didn't feel like cooking on a somewhat hungover Sunday afternoon. Time for some Indian food!I had heard good things about Ambar and it was unsurprisingly open on Easter so we gave it a shot.The place is really small on the inside, there were not many seats so we snagged a table for 2 after paying for our buffet. I liked the place though, it was pretty cute on the inside, complete with authentic decorations and some catchy Indian radio station.I browsed the buffet and everything looked so mouthwatering! I think I tried 95% of the stuff they had out there. I'm going to try and remember (and spell) the names correctly, but forgive me if I'm a little off. The dishes that really stood out to me were the mutter paneer, saag mushroom, the spicy chicken (65 I think it's called?), and the fried dough balls and spongey dessert thing (sorry I have no idea what the proper name is).Overall I was actually pleasantly surprised at how good the food was. Most of it was pretty fresh, much tastier, and even cheaper than the last buffet we went to (Casablanca). Out of the three Indian places I've tried on or near campus, I liked Ambar the best out of Sitara and Casablanca.I love being able to get so many different cuisines on campus, Indian food grows more and more on me every time I have it!Recommended for sure!",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.000678350312054461,
                    "positive_probability": 0.9993216496879497
                },
                "stars": 4
            },
            {
                "review": "was there for the buffet. was not bad, good quality of food but not a big verity.defiantly the best Indian buffet n the area... very cheapi took a video of the place:https://www.youtube.com/watch?v=FrIp47qMJhg",
                "reviewer_id": "ykUsJijbiub74yQPNcCavQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4077823784121769,
                    "positive_probability": 0.5922176215878212
                },
                "stars": 4
            },
            {
                "review": "I was there on a lunch buffet. Food wasn't great and they were out of some foods or it looked like they weren't interested in refilling it. Won't recommend it if you really want to taste some authentic Indian food. People are nice though.",
                "reviewer_id": "ZnnAgfgbfogDqs9r5IXrkg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49708219972643775,
                    "positive_probability": 0.5029178002735641
                },
                "stars": 2
            }
        ],
        "similar_restaurants": [
            "1tK0k-vRgGFC3oSZNUJ58Q",
            "RSIWC7s6Mq3FCTKxuapd8Q",
            "mbHfXlcPGQyPKtuh5CJ1Iw",
            "0a4lX5VhCXJOwe-idxnVbw",
            "F1UsF9LU5h7xp1k9LytT-w",
            "caK31Iq3TClNCRB9WH9lhQ",
            "-1oj6-fkP-iO6OyW8QBqPg",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "ivZo1goh7HXdep03NfA7Cg",
            "fxYiDAxCK33ANk8-QemInA"
        ]
    },
    "F1UsF9LU5h7xp1k9LytT-w": {
        "keywords": {
            "bigrams": [
                "indian_food",
                "middle_eastern",
                "green_street",
                "pretty_good",
                "rice_pudding",
                "food_good",
                "chicken_masala",
                "fries_came",
                "stopped_lunch",
                "recommend_place"
            ],
            "unigrams": [
                "food",
                "good",
                "naan",
                "chicken",
                "place",
                "lunch",
                "service",
                "indian",
                "rice",
                "lamb"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "F1UsF9LU5h7xp1k9LytT-w",
            "categories": [
                "Indian",
                "Middle Eastern",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "623 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "04:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "04:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "04:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "04:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1102799,
            "longitude": -88.2298014,
            "name": "Casablanca Kabab House",
            "neighborhoods": [],
            "open": false,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/-g7ijCCcoQy3FiGkwKdCIw/ms.jpg",
            "review_count": 45,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Good food ... The service was good, and I got my food pretty fast after I ordered. Good food. ",
        "reviews": [
            {
                "review": "I've been so excited to see this place open, and finally went in for lunch today.  I was anticipating a little more Middle Eastern options (as opposed to Indian), but considering the fact that it is owned by the same people who run Bombay Grill, that isn't too surprising-- and I still love Indian food!  I got the chicken kebab roll.  It was around $7, with a simple salad and pakora-battered potatoes (like REALLY good french fries).  The rolls were some of the cheaper items on the menu, and the rice/curries and more dinner-suitable dishes were a bit pricier, in the $12 range and up.  So probably a bit more than I'd be able to spend unless I am treating myself.  But- even if the prices are a bit more than ideal, the portions are huge! I could easily get leftovers from anything on the menu, so overall the deal is very good.  And the food is delicious!And to the reviewer who complained that their mango lassi has yogurt.... mango lassi's main ingredient IS yogurt! That's like complaining that your milkshake has dairy in it, kind of an obvious/uninformed remark to make.",
                "reviewer_id": "00P4xh_HkxbZ9YzH8psfXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0015052982477293103,
                    "positive_probability": 0.9984947017522714
                },
                "stars": 4
            },
            {
                "review": "I went here last night with a couple of friends of mine. The decor is very fancy for being so close to the Quad. The service was great... the owner was there to explain the dishes to us and help out in picking a variety of dishes. My water was being refilled after only a sip or two, which isn't really a good or bad thing. They have that same yellow rice as Bombay. They don't give much rice with the curries so I think a higher quality brown rice would be more appropriate for the prices. Overall I though it was just okay, and very much like Bombay (same owner). I had the impression that it was very middle eastern but I found no falafel, hummus, or tabouleh to eat. The menu is centered around kebabs and indian food.I tried a variety of dishes including both curries and kebabs. I had the Lamb Makhani which was fantastic. The sauce was delicious and the lamb was cooked just right. The portion size was ideal but at about $14, it could have been cheaper. I can probably go to Bombay and get the exact same thing for a couple dollars less. The other curry that I tried was the Chicken Vendaloo. This is in the same spice family as the Makhani and is also tomato based. It had potatoes and more of a kick to it though. The chicken was tender and overall the dish was enjoyable.  I tasted two kebabs. The beef one I had, unfortunately, was tough and overcooked. The char on it from the tandoor made it quite pleasing to my taste buds. There was also a ground chicken kebab on the table which was rather dry and not very flavorful. The naan was delicious and one order kept 4 of us happy.I'm not itching to go back, but I would go in the future to maybe try something more middle eastern, and possibly get a dessert.",
                "reviewer_id": "2MwGJykDV3Tussbk_KqaJg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.739864005919562e-05,
                    "positive_probability": 0.9999626013599302
                },
                "stars": 3
            },
            {
                "review": "Twice the charm for this place, the food selected was better. Except that the restaurant's identity is confused - formal setting, orders by menu and not on a board BUT they serve you with disposable plates etc. You have to get your own water too and do the clean up. The menu has so much selection that can result to confusion for those unfamiliar with it - need to trim it down to only the more tasty or popular dishes. This place is worth checking out.",
                "reviewer_id": "3GkhffPkTnOr2n113sPXUw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33364521912436035,
                    "positive_probability": 0.6663547808756484
                },
                "stars": 3
            },
            {
                "review": "Went here a couple days ago with some friends.  When we got there it was busy so the five of us had to squeeze into a 4 top instead.  The menu was extensive, and service was pretty attentive.  I ended up getting the lamb chops, which were pretty good.   I tried a bit of my friend's fish curry, and I liked that as well.  I ended up spending 20 dollars after tip.  In my opinion for the amount of food, it was a bit on the pricey side.  Overall, a nice new addition to the slew of restaurants already on Green Street.",
                "reviewer_id": "6D1PuiyYHndLeF8_WHpW6A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9773013686061605,
                    "positive_probability": 0.022698631393832096
                },
                "stars": 3
            },
            {
                "review": "I was completely disappointed with my last visit to Casablanca. As soon as my group walked in, we were met by a waitress that did not smile or greet us but merely slapped a few menus on the table and walked away. She proceeded to be rude and inattentive for the entire dinner, spending more time on her cellphone then serving us. She even messed up on our check twice (and they were not split checks either). In addition to this, I thought the food was average at best. The chicken tikka masala was a bit sour and the portions could have been bigger. The only reason I am giving them two stars instead of one is because my previous experience with them was not nearly as bad.",
                "reviewer_id": "7Sgp9nuO6HZrj4kv7MCmbA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.43468117582144594,
                    "positive_probability": 0.5653188241785497
                },
                "stars": 2
            },
            {
                "review": "good ambiance for campus town. extremely attentive service. price is reasonable for what you get.But i didn't leave this place feeling like I NEED to come back here again. The food was good, but it wasn't mind blowing. Maybe Indian/middle eastern food isn't exactly my food of choice. I'll probably come back here again and try something new (I got a chicken dish which was pretty good, but next time I'm going to try their curry dishes and their rolls). Anyway, this is a good addition to campus town. I liked it more than Bombay even though I believe they're owned by the same guy.",
                "reviewer_id": "9iRDAeoTW08yZgR0JaaOHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.731947348540864e-05,
                    "positive_probability": 0.9999726805265241
                },
                "stars": 4
            },
            {
                "review": "The service is really friendly. I've tried the buffet both times and the chicken curry was excellent. Naan and rice are freshly prepared. Overall a good experience. Can't go wrong. Solid.",
                "reviewer_id": "aX8hmnedCsrLJ7HmD8hwvQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01611990657575087,
                    "positive_probability": 0.9838800934242489
                },
                "stars": 4
            },
            {
                "review": "Tried the Kabab House with College Boy yesterday.  It was a busy place and the service was quick and cheerful.  You order at the counter in the back and then sit down and they bring out food on a little cart and push it through the small dining room looking for its owner.  A lot of people were taking carry out.   I ordered the special Chicken Marsala and my son ordered Chicken Vendaloo, lunch portion.  We shared a naan and had water to drink. The bill was about $21; which seems a little high for lunch on a regular basis.We both enjoyed our choices, and will give it another try.  I want to try a kabab next time.  They also serve beer and wine at reasonable prices.",
                "reviewer_id": "b0e7XSqtTXICy4s6f5dFGg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04710062680825756,
                    "positive_probability": 0.9528993731917506
                },
                "stars": 3
            },
            {
                "review": "Kind of a different place for where it's situated. You have the lunch atmosphere is pretty typical, then it get's quite a bit nicer during dinner time. Still not 'fancy' by any means, but respectable.Although it's called Casablanca, it's really more of a mix of levantine food and Indian food, which is a pretty great combination. The kebabs and various sandwhiches are all great, and the dinner-fare is also on the same level - the curries are the best I've had in town, surprisingly. The fries are, as many other reviews mention, pretty great, and the naan and sauces and chutneys that come with meals are always good.The prices are a little steep, especially at dinner, but it follows the sort of atmosphere it's going for.I've always had really great service here - free food thrown in once or twice, attentive waiter, and quick food. Definitely one of the better choices on that strip on Green street.",
                "reviewer_id": "bHCAZYvsh9LkydyBNl2PGA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0033579312088498456,
                    "positive_probability": 0.9966420687911497
                },
                "stars": 4
            },
            {
                "review": "I stopped by for lunch on a Wednesday during the summer. Campus is fairly empty, but Casablanca was still pretty busy. I ordered the lamb makhani roll to go with a bottle of diet Pepsi. The total was nearly $12 (the roll was $8.99 on its own), so lunch isn't cheap.The roll was made up of a large piece of freshly made naan filled with grilled lamb chunks (perhaps 5), a creamy sauce that had some heat, grilled onions and green peppers, also chunked, and lettuce. The lamb did not have any particular flavor (it could have been almost any kind of red meat), the sauce had no spicing except for the heat, and the green peppers were cut too large and undercooked. The lettuce had gone limp with heat and added nothing to the flavor; it detracted from texture. The naan was decent (chewy, warm), but had little flavor. A really good piece of naan should have a smoky / toasted flavor on the outside while remaining soft and chewy on the inside. A really good makhani begins with meat marinated overnight in yoghurt  and a harmonious blend of spices and aromatics that can include Garam Masala, ginger, garlic paste, lemon or lime, pepper, coriander, cumin, turmeric.This tenderizes the meat and infuses it with flavor -- I would bet my bottom dollar that was not done here. At least the sauce resembled its traditional base of tomato puree, ghee, and yoghurt. The small order of fries that came with the roll was good -- flavorful and crispy. I waited around 20 minutes for the carry out. The gentleman taking the orders was abrupt through most of our interactions. For example, he ordered me to sit down because, he said, \"it's going to take a long time.\" Way to sell the experience. But I could give these things a pass if the food were good. It was filling. But it was not good.",
                "reviewer_id": "Co9VOK72zpB_nSWrgaNkLg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8987335577282292,
                    "positive_probability": 0.10126644227177885
                },
                "stars": 2
            },
            {
                "review": "The food was great, but not quite what I was expecting. Since the restaurant is a \"kebab\" house, I was expecting to find a dner kebab somewhere on the menu. Unfortunately there weren't any but the lamb kebab roll I ate was good enough. The naan bread was delicious, and so were the potato fries that came with it. The service was good, and I got my food pretty fast after I ordered. I liked that the food was easy to take home, but not so good as leftovers. Casablanca has a great location, and I will definitely be making a trip back.",
                "reviewer_id": "Cr9_ImFBGZli8L52aU5UaQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08133437907922188,
                    "positive_probability": 0.9186656209207761
                },
                "stars": 3
            },
            {
                "review": "I've had mixed experiences with service here, but the last time I went the service was stellar. The food has always been great though. They have lunch specials on the naan roll-ups. The atmosphere is very nice relative to others on campus.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07103638262561113,
                    "positive_probability": 0.9289636173743884
                },
                "stars": 5
            },
            {
                "review": "Got to try out some of the curry here. The place is fairly nice and the food is alright. My meal came out to $10.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10417559424295687,
                    "positive_probability": 0.895824405757041
                },
                "stars": 3
            },
            {
                "review": "Definitely one of the better options along green street. The lunch special rolls are by far the best deal. You get a big piece of naan filled with whatever you choose rolled up and served with pakora. I usually eat about half and finish the rest later. If you're vegan sometimes they will accommodate by using Roti instead of Naan.The menu is on eatcu's website.",
                "reviewer_id": "H8wT4jji49mEB_CxXFF5LA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.560556447862983,
                    "positive_probability": 0.43944355213702074
                },
                "stars": 4
            },
            {
                "review": "This place is absolutely wonderful for dinner. Their naan is always freshly made and perfectly done. Their chicken tikka masala is pretty good, but any lamb combination is great, (lamb kaddai and jalfrezi are good choices). Their rice is brackish and not the best you can get.  The service for dinner is alright, they do tend to take a long time to take your order and bring your food.  However, the wait is worth it.  Their portion sizes are very deceptional, they come in a small metal bowl, but the bowl is deeper than you think! With naan you will definitely leave very filled.I would NOT however, recommend this place for lunch. The service is beyond awful and the food is not of the same quality.  There is no waiter during lunch and you are served on cheap paper plates.  Now, I do not necessarily have a problem with the paper plates, but when I am spending a lot of money--as a broke college student--I at least want a decent presentation.  Overall, I would recommend this place ONLY for dinner.  It's good for a date, very nice seating, dimmed lighting.  It is also good for groups as they do separate checks and have tables big enough to accommodate large groups.  If you like Indian food, have a few bucks to spend, this is your place.",
                "reviewer_id": "HUMhxK0xIiilmhpyoqtYEA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0494694994011618,
                    "positive_probability": 0.9505305005988341
                },
                "stars": 4
            },
            {
                "review": "Don't go here on a tight schedule, as some other Yelpers have pointed out there can be a bit of a wait for the food.  That being said, the food here is worth the wait.When people think Middle Eastern, they seem to expect something more Arabian than what this food actually is.  You'll find a pretty good smattering of Persian, Afghan and Indian dishes here, but not much in your Mediterranean or Gulf food.  You'll also find a pleasant surprise when the check comes, meals average about 30% less than I would expect to pay, and in a central campus location too!",
                "reviewer_id": "K1nTcbwalIxaDei6n7wQ8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00939261004383797,
                    "positive_probability": 0.9906073899561596
                },
                "stars": 4
            },
            {
                "review": "I decided to try something new and saw this while driving around. I had no idea what it was and was pleasantly surprised with what I got. The waiter serving us was very helpful and recommended some very delicious dishes. We split the lamb kebab, which was very tender and had amazing spices on it. Dessert was also fantastic. The price was surprising too, overall it cost us about $20 for two of us to have an appetizer, split an entre, and have dessert.",
                "reviewer_id": "lAL9KK9LDm4vxMHqc4E5Yg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.019461526112007268,
                    "positive_probability": 0.9805384738879918
                },
                "stars": 4
            },
            {
                "review": "We had a lunch roll (like a wrap with naan) and a chicken kebab and everything was delicious! The service was fast - based on the other reviews we were skeptical but the food arrived within 10 minutes (Saturday afternoon, a little past the normal lunch hour).",
                "reviewer_id": "MlLLlXxHMks5NyETf74XZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01407333385886084,
                    "positive_probability": 0.9859266661411371
                },
                "stars": 5
            },
            {
                "review": "Casablanca is a new Middle Eastern restaurant that has recently opened on U of I Campus. There are so many different ethnic restaurants to choose from on Green Street: Mexican, Japanese, Korean, Chinese, Thai, Indian, and American. I was excited to see a Middle Eastern restaurant added on our diverse plate. Casablanca is a kabob house, offering many different varieties of kebabs from the Middle East. Meat eaters and vegetarians are all welcome. The menu features dishes with variety of spices in categories of vegetarian, chicken, lamb, beef, goat, shrimp, and a variety of fish entrees. In addition, each entree comes with rice.  More importantly, you can't forget the irresistible Indian bread, naan. Naan is an oven-bakes flatbread that generally resembles a pita bread. The price of naan ranges from $2.99 to $5, which isn't too bad. However, as a hungry-poor-college-kid-in-love-with-ethnic-cuisine, I wish they gave you a little bit more naan. It's always fun to dip the fluffy bread into the curry and eat it. My boyfriend and I ordered the lamb vendaloo (spicy curry with lamb and potatoes) and casablanca chicken masala. The casablanca chicken masala was the dinner special which was $7.99. However, the other entrees priced around $12.99 or more. I'm not very familiar with Middle Eastern cuisine, but I have grown to enjoy it. However, I thought the sauce on both entrees tasted the same, except the Chicken Masala had more vegetables added to it. It was good, but basically we had the same entree. I recommend ordering a kabob and a curry entree if you go with another person. Also don't forget the naan. :) Overall, the service was good and the food was good.",
                "reviewer_id": "NbvKwZEmGW-6NTEVrfZHPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.2877600340979283e-05,
                    "positive_probability": 0.9999871223996555
                },
                "stars": 3
            },
            {
                "review": "Food was great. The server comes out cold but he is cool. We had lamb and chicken curry",
                "reviewer_id": "ntqQ6qrwkKX9Cyky782B4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13653819832143463,
                    "positive_probability": 0.8634618016785653
                },
                "stars": 5
            },
            {
                "review": "Their mango lasso is mixed with too much yogurt",
                "reviewer_id": "oL9jteYUk5VLpWSvIVF3Hw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6749550071637039,
                    "positive_probability": 0.3250449928362965
                },
                "stars": 2
            },
            {
                "review": "I was intrigued by the $9.99 buffet and stopped by for lunch. There were about 6 different dishes including chicken kabobs, a couple different chicken curries, and a cauliflower dish. There were also two different dessert soups (one was like tapioca or rice pudding). I was expecting the restaurant to serve more kabobs, which was a let down. The food was mediocre.",
                "reviewer_id": "ppzbDTEoLJGWc6knVdoo7w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005507352556424779,
                    "positive_probability": 0.9944926474435793
                },
                "stars": 3
            },
            {
                "review": "The food was very good and the service was good too.  The only reason I only went there once is because I am a poor college student and the prices are a bit expensive.  The food is very similar to Bombay Grill (I've heard it's the same owners) but the prices were a little high for me.",
                "reviewer_id": "pSxXCwlE_djZ4RcLl2c4Sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4817893497416591,
                    "positive_probability": 0.51821065025834
                },
                "stars": 3
            },
            {
                "review": "I went there with my girlfriend a few weeks ago for lunch and we both love their lamb dishes. I think the portions are great and the price is reasonable. It is a welcome change from the subway,chipotle, pizza hut, and chinese food that populate Green street.",
                "reviewer_id": "ptHeckSwrYzbo_NVrwZ0Zg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15063500035852173,
                    "positive_probability": 0.8493649996414756
                },
                "stars": 5
            },
            {
                "review": "Good food. Too pricey for a college town. They serve halal chicken if you wish though which is great!",
                "reviewer_id": "R-en1tx1j5iW2KyHT49GiQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6855100242229898,
                    "positive_probability": 0.3144899757770124
                },
                "stars": 3
            },
            {
                "review": "Great food.  Clean restaurant.  Super nice people running the place.  Probably too much garlic if you're planning on going back to work after lunch.  I'll definitely be back.",
                "reviewer_id": "RE0dAd5Roih1CwIL2JLTsA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15030520154291824,
                    "positive_probability": 0.8496947984570843
                },
                "stars": 5
            },
            {
                "review": "like a previous post, i was told i couldn't have curry vegetables, because it would take too long.i was wanting something vegan, without onions.  so, what i ended up with, was...  a little bowl of chickpeas in a really, really salty sauce.  for which i paid about $10.00.the food aside...  the restaurant is very pretty.",
                "reviewer_id": "rG46pZnrRMCj_1VyILwltg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06844077163186019,
                    "positive_probability": 0.9315592283681429
                },
                "stars": 2
            },
            {
                "review": "Decent food, went here on my brothers recommendation. Don't get the Chicken Jalfrezi its not even mildly hot as stated on the menu. Its plain, chicken wasn't too tender. However the paneer makhani roll was pretty good. For the price, I think the food should be a tad bit better. We went on Sunday and according to my brother, we should have been confronted by a waiter and be given things rather than doing it ourselves. But anywhoo, I have to rate Casablanca 4 stars because the food wasn't like what it was described to me.",
                "reviewer_id": "rhbl-rMDkbHM0Pg9CWigZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3019554073662158,
                    "positive_probability": 0.6980445926337853
                },
                "stars": 4
            },
            {
                "review": "Definitely an OK deal for students.. My friends and I visited for dinner and it was 9.95 plus tax per person for blend, salty, and mediocre buffet style indian food. I'm sure they do other menu items too but I'm not sure I will visit another time to try them out.",
                "reviewer_id": "rHTfkOlNF3nQr96146ckmA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.47178464812013593,
                    "positive_probability": 0.5282153518798616
                },
                "stars": 3
            },
            {
                "review": "One of my favorite Champaign restaurants. Excellent food. Menu is pretty extensive. The service and atmosphere is second to none. Every time I am in Champaign, I try and stop through.",
                "reviewer_id": "rPbYmHhKQ1EU7cSOqH-TFw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5141162558851735,
                    "positive_probability": 0.4858837441148269
                },
                "stars": 5
            },
            {
                "review": "Casablanca is a decent spot to get relatively well-priced lunch.  The kebab specials are great as they come mercifully packed with naan.  Sweet, wonderful naan.  The ambiance is nothing extraordinary, but the staff are friendly, the food is tasty and freshly and quickly sent to you.  It's well worth adding to your meal rotation.",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09820404214073629,
                    "positive_probability": 0.9017959578592646
                },
                "stars": 3
            },
            {
                "review": "Two words: food poisoning. ACUTE food poisoning. Knew I should have trusted my instincts when I saw them prepping food on the same cutting board they had just cut raw meat on. Food was pre-cooked and reheated and still tasted overly salty and the wait was ridiculous (said 10m, waited over 20). This is the second time I've given this place a chance and the second disappointment. Won't be a third.",
                "reviewer_id": "tBiAJtAB4RsXiB4uWxtWrA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8884849474417061,
                    "positive_probability": 0.1115150525582931
                },
                "stars": 1
            },
            {
                "review": "Good food ... But priced a little higher for student crowd ...",
                "reviewer_id": "UGxJ0B4Uto7crbkuJf16vQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.30721572939508274,
                    "positive_probability": 0.6927842706049178
                },
                "stars": 4
            },
            {
                "review": "Food is decent, there are better Indian places around. No waiter service at lunch, and the guy at the counter was quite possibly higher than a kite the last time I was there. My roll was quite large, but my bf wasn't as impressed with his food. I had a similar experience as A.W. with the service, people working there always seem confused and the food comes out in an odd way.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009064621105930683,
                    "positive_probability": 0.990935378894071
                },
                "stars": 3
            },
            {
                "review": "A large group of friends came here for dinner on a Friday night before 6 and found the place deserted. Service is slow and can be confusing, but they were happy to do 9(!) separate checks with most of us paying by credit. Some people ordered rolls and others kababs; the portions were equally large, which means the rolls are a much better deal price-wise. The food was fine--a solid 3 stars' worth--but I'm giving an extra star just for the fries that came with the rolls, particularly the SAUCE on the side. It tastes like spicy ketchup, which combined with pretty decent thick-ish fries, makes for an addictive meal. I would come here again just for the naan and fries.",
                "reviewer_id": "wBtPzdzr-IUVuEXdcViEYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010684055725824974,
                    "positive_probability": 0.9893159442741775
                },
                "stars": 4
            },
            {
                "review": "Super tasty!  The Naan itself is worth a trip to this place for lunch or dinner.  The rolls are super filling and now they come with these awesome tempura fries!  If you choose rice instead of naan to accompany the entrees, the portion is rice is HUGE so be prepared.  Lunch gets busy and this place is kind of small so it's sometimes hard to find a seat.  And when it's crowded, it can be a little confusing for the server to find your table to deliver food to you, as someone else said, the system for order delivery is not exactly the most effective.  But the tasty tandoor-made breads makes up for it!",
                "reviewer_id": "wZ2B3_9CiWUQCd6hS156Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008763253552504737,
                    "positive_probability": 0.9912367464474982
                },
                "stars": 5
            },
            {
                "review": "Good quick Indian food.",
                "reviewer_id": "xJHMTAPCWevN18F4_A999w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5505050505050506,
                    "positive_probability": 0.4494949494949494
                },
                "stars": 4
            },
            {
                "review": "Stopped in for the $8.99 lunch buffet.I must say that I was expecting more Mediterranean food but this place is most certainly Indian food, at least from what we had.They served fresh naan and had probably 3 chicken dishes, a couple of curries, some pankooras and rice pudding.I did like the chicken in the really vibrantly red sauce and also the pankooras and rice pudding. Everything else was pretty mediocre, typical buffet quality food.For $9 I was definitely filled up and the place is good if you'd like to try Indian food in a relaxed atmosphere.Otherwise we were a little let down by the kabab house not having any actual kababs. We thought there would be a few other options, maybe a menu or something, but I guess not.Oh well. It was fair, 3/5",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06698824457085359,
                    "positive_probability": 0.9330117554291458
                },
                "stars": 3
            },
            {
                "review": "Checked this place out for the first time today. Unlike some of the other reviewers, I entered with few expectations. And was more than pleased with what I found. As others have noted, the decor was nicer than expected and mos def on the high end for campus. Not spacious, but big enough. Also, the man taking orders was plenty friendly. My friend had lots of questions and he was happy to answer them.Now to the grub. I ordered the Beef Kabob roll. It was wrapped in a beautiful sheet of naan. Yummy yummy bread. The beef was well seasoned and tender. Also, this meal included fries which were unique but quite tasty. Not super cheap at $7.99, but I would say you get your money's worth here.All in all, this is a great addition to the campus restaurant lineup. I'll be back!",
                "reviewer_id": "YspYJdCQzoXq76KNacivSQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008161675270266516,
                    "positive_probability": 0.9918383247297339
                },
                "stars": 4
            },
            {
                "review": "Beautiful location-- 'specially for a Green Street establishment.  The restaurant is big, lots of seating, but with lunch/dinner rush, you'll have people lining up to the door while the one service counter handles everything-- orders, food, drink, etc.  There's no menu until you reach the counter (unless people cut the queue to get them, which isn't as much a taboo as it might sound).  Everyone is exceptionally friendly.  The host is funny and the people that come to your table with the food are tremendously gracious.  Always willing to help.Portions are IN-SANE.  Entrees are between $9 and $14, and I'll level with you-- this place is expensive for it's location (which probably helps steer the college kids away), but for what you get?  Two meals easily.  I'm not just saying that because I eat light.  For a light eater, you're probably looking at four.The nan is fantastic.  It comes out hot and if you want it buttered or stuffed or just plain, it's _always_ good.  Their vegetarian dishes are superb.  Excellent use of spices in all save the rice (which is served with every dish).  The rice is a little bland, so if you're looking for all of that beautiful flavor that radiates from your dish to be there, it's not.  But that's more a delivery system, anyway.  And something a little blander with all that spice is probably a good idea.  Their kabobs are fantastic.  Huge and well seasoned.  Whether you get it wrapped in nan or in the platter (with salad!), you won't be disappointed.I think their soft drinks are too small for the price, but they do offer the option of water, though (and good thing, too with their spicy menu)!  All in all I'm happy to go back!",
                "reviewer_id": "YtbXNQJEJAHZK_2DFXSa6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0003908037276213606,
                    "positive_probability": 0.9996091962723959
                },
                "stars": 4
            },
            {
                "review": "I came here on Sunday and decided to try out their buffet, which is $9.99 per person. They serve rice, naan, a few main dishes and dessert. It was a very good selection for me! I have not tried many Indian dishes, but I would recommend this place if you want try Indian food. It's not too expensive and you can eat as much as you want. I would also recommend trying their rice pudding!",
                "reviewer_id": "zycn0w7rlpMfMv3sgc8SNw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03583739155044276,
                    "positive_probability": 0.9641626084495537
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "1tK0k-vRgGFC3oSZNUJ58Q",
            "mbHfXlcPGQyPKtuh5CJ1Iw",
            "6UftUvNBqANqybf8wpWeNA",
            "0a4lX5VhCXJOwe-idxnVbw",
            "-1oj6-fkP-iO6OyW8QBqPg",
            "RSIWC7s6Mq3FCTKxuapd8Q",
            "GpxGxY8Txj509bbQPCvNQg",
            "7LAtL5exU4nrC-5W6HT4cQ",
            "caK31Iq3TClNCRB9WH9lhQ",
            "QUZUgIHFKgYEgM-QNROgHw"
        ]
    },
    "caK31Iq3TClNCRB9WH9lhQ": {
        "keywords": {
            "bigrams": [
                "hot_bar",
                "indian_food",
                "indian_restaurants",
                "chicken_tikka",
                "special_rice",
                "tikka_masala",
                "rice_dishes",
                "authentic_indian",
                "grocery_store",
                "best_deal"
            ],
            "unigrams": [
                "food",
                "rice",
                "chicken",
                "indian",
                "good",
                "dosas",
                "masala",
                "naan",
                "mirsung",
                "came"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": true,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "caK31Iq3TClNCRB9WH9lhQ",
            "categories": [
                "Food",
                "Grocery",
                "Indian",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "49 E Green St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1097873,
            "longitude": -88.2404819,
            "name": "Mirsung",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/JMDK6RZ_6WbdID0KBH4p_Q/ms.jpg",
            "review_count": 9,
            "stars": 3,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This place has truly authentic Indian food at good prices. I came here earlier in the week and ordered the spicy masala dosa. I ordered the chicken tikka masala with rice AND naan. ",
        "reviews": [
            {
                "review": "Mirsung is given representation mostly as a grocery store (at least according to its listing on Yelp), but several months ago, it annexed a modest, \"fast food\" cafe next door to the grocery.  Frankly, the purpose of my visits have been to pick up prepared lunches, not groceries, so I can't really comment on the latter.Like other Indian restaurants in town (except for the Bombay Grill on First Street), this place is mostly a greasy lunch counter for college kids.  There are a few tables for anyone who wants to eat there, and while the space is brightly-lit by large shopfront windows, the decorations are sparse and uninspiring.However, don't be deterred by general criticisms on the restaurant's interior.  Mirsung probably has the best deal on Indian food in Champaign.  When you walk up to the front counter, you'll see a food-laden hot bar, along with a white-board listing the daily menu and prices.  If you're not familiar with Indian food, this might be a good way to try it out, as you can just pick out dishes that are visually appealing to you.  Each day, Mirsung serves 2 vegetarian entrees, 2 meat entrees, a special rice dish, soup, appetizers (including samosas), and DOSAS!  The combination meals are around $7 to $9 (depending on whether you order meat or vegetable entrees), which is quite reasonable as your take-out containers will be bulking with food when you leave.  Most of the food you receive will be rice, a contentious point for most diners (who prefer more meat for their money), but given the spiciness and richness of many Indian dishes, I usually like having more rice.  If this is indeed an issue for you, I would recommend ordering the daily special rice instead of plain basmati rice, which costs $1 more per combo plate, but can easily serve as a meal by itself.I've had good experiences with the special rice dishes, including the lemon rice, tamarind rice, and chicken biryani.  These rice dishes are flavored generously with spices, mustard seeds, and fresh curry leaves.  I like the sauces on most of the entrees, including the chicken tikka masala, chicken vindaloo, and okra masala.  The only real complaint I have regarding food is that the paneer has been a bit tough when I've had it in the past.Mirsung is located a pleasant distance from the busiest part of Green Street, which means: (1) free parking is available, and (2) you won't feel that you're trapped in some hellish war between pedestrians and traffic.  Students shouldn't be discouraged from stopping by, though, as it is still an easy walk from the campus neighborhoods on First Street.",
                "reviewer_id": "6nqakbu2zU6fjOmbE83_-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.0060500134368555e-13,
                    "positive_probability": 0.9999999999999212
                },
                "stars": 4
            },
            {
                "review": "AVOID THIS PLACE!!!!!I've been here twice in the past week and maybe once before that, about a year ago... they have dosas.  I LOVE dosas.   And maybe just the fact that they have dosas made me delusional.   I came here earlier in the week and ordered the spicy masala dosa.   It came out in all it's golden brown crepe-like goodness, served with mint (?) chutney and lentil soup.   I tore into it and boy was it good.  I was eating bits of the crepe and dipping it in both the chutney and the soup.   It had a bit of a kick to it!  Then I realized that I wasn't getting any \"masala\" part.  I opened it and there was maybe two tablespoons worth of filling.  Red flags should've been going up, but I just kept eating and dipping.  I was satisfied. I figured that since there was so little filling, I was keeping my calorie count down for the day! Bonus for me!!!  It cost about $9 for the dosa. I returned two nights later to pick up some takeout for dinner.  I ordered the chicken tikka masala with rice AND naan.   During the day, they have a hot bar/buffet going on which runs from 11 - 2:30.  (When I went in earlier in the week -- I came in at noon and the buffet STILL wasn't ready -- by the time I left at 12:30 -- it still wasn't there so who knows when it starts) I came in around 4pm.... the hot bar/buffet hadn't been cleaned up and there were bins with the dredges (hardened and dried and OLD food that are left at the bottom).   I kind of look grossed out by what was left and the man (cook? waiter?) assured me there was food in the back.  After I ordered, he went into the kitchen and came back out with a plastic container of rice (which looked as if it was microwaved -- there were bubbles of moisture on the inside of the plastic... if it was fresh, there would've just been cloudy steam.... these were water droplets already!!) and some naan wrapped in foil.   Then he took a takeout box and went to the hot bar and stirred up one of the containers (it was red and there was an oily lake of grease lying on top of it) and started to spoon it into a container.   I was in shock that I couldn't speak.   He remembered that I also ordered a mango lassi --- he went over to the sliding door fridge and pulled out a pre-made lassi that for all I knew, had been made yesterday!   Anyway, it was $10 and all I could think was, \"This can't be good, this can't be good.\" Picked up my son from school, went home and we sat down at the table.   I unwrapped the naan and there was a huge hole in the middle (it wasn't a rip... it was a HOLE as if somebody had eaten it from the middle!! Plus it was hard as a rock) and as I put the first bite of tikka masala in my mouth, I pulled out stems from some unknown herb..... needless to say, I couldn't/didn't even want to feed it to my son.   I wound up throwing everything down the garbage disposal and warmed up last night's leftovers of rice, shake&bake chicken and heated up some corn.    Nasty --- will NEVER EVER go back .... and even if ChampaignTaste gave it a good review.",
                "reviewer_id": "aSyHqB5QIybJb3npJUy78A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4002651258352879,
                    "positive_probability": 0.5997348741646763
                },
                "stars": 1
            },
            {
                "review": "On our way from Iowa to Indianapolis, we decided to stop and have lunch. Much to my dismay, the restaurant has a sign that says they aren't serving food despite their website not reflecting that. So I proceeded to go into the store to tell them that they should update the website but the store is closed too, albeit a half hour after the posted opening time! Poor business!",
                "reviewer_id": "chxPozez9b5bWg3E8TUk8Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8660300951084332,
                    "positive_probability": 0.13396990489157093
                },
                "stars": 1
            },
            {
                "review": "it was a terrible experience - they do not offer the full menu daily (dosas are on the menu but i have been 4 times and they have had some excuse each time).  we ordered chat, one samosa, an entree (chicken tikka) and naan.  The whole thing took 15 minutes - and not to mention, we didn't get the naan for another 15 minutes after that.  a 30 minute wait is NOT fast food.  the icing on the cake was that the samosa was soggy.there is one cook and one server working both the food and grocery side, making service TERRIBLE.  avoid this place at all costs until management decides to add some more workers...",
                "reviewer_id": "f0fKhyu9BsCMhGgCtSQlEA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08272801333805488,
                    "positive_probability": 0.9172719866619407
                },
                "stars": 1
            },
            {
                "review": "Service can be spotty, and the space is often as messy as the other campus food spots.  However, Mirsung cannot be surpassed in balancing price, quality, and quantity.  You won't get many choices each day, so plan in advance and come in when you know they are making something you want (like muttar paneer).  Haven't had any bad entrees (butter chicken, palak paneer, muttar paneer, dal) and they always hook me up with loads of good, fresh rice.  The grocery store is fine.",
                "reviewer_id": "i7XBtYaJLQcMrXD4s7COzA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09139538915039491,
                    "positive_probability": 0.9086046108496001
                },
                "stars": 3
            },
            {
                "review": "Mirsung Groceries is a great low-price option for anyone daring enough to try something new! I always find cheap read-to-eat mixes that I add plain yogurt to take down the hotness a notch.There are fresh vegetables delivered twice weekly. And FRESH samosas on Fridays. These are AMAZING!",
                "reviewer_id": "kXhFuI3Kgkb5OAIUE7eQdg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4179017594023801,
                    "positive_probability": 0.5820982405976242
                },
                "stars": 5
            },
            {
                "review": "WOW! I am sooooo happy I ate here today and I'm still thinking about it late into the evening. This place has truly authentic Indian food at good prices. We had a Masala Dosa, which tasted just like it came from India Square in Jersey City, and a Veg/Non Veg combo which consisted of Garlic chicken (spicy) and Aloo Palak. The best deal is the buffet however, for which you can try everything (except Dosas) for $9.99. I saw another table get two of those and it was a HUGE amount of food. If you like AUTHENTIC Indian food and a clean but no frills dining experience, this is an excellent choice. The other great thing: they deliver for both breakfast and lunch.",
                "reviewer_id": "Z4czntQund-OgvYca3i6lQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.2964554445776556e-06,
                    "positive_probability": 0.9999967035445586
                },
                "stars": 4
            },
            {
                "review": "One of the best Indian restaurants in town. The dosas are great, the tandoori chicken is fabulous, the butter chicken is awesome and the naan is delicious. Enough said!And they deliver; which none of the other indian restaurants do.",
                "reviewer_id": "ZP1BSogas55ND0r02TvBXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06305734469945692,
                    "positive_probability": 0.9369426553005429
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "1tK0k-vRgGFC3oSZNUJ58Q",
            "mbHfXlcPGQyPKtuh5CJ1Iw",
            "RSIWC7s6Mq3FCTKxuapd8Q",
            "6UftUvNBqANqybf8wpWeNA",
            "F1UsF9LU5h7xp1k9LytT-w",
            "0a4lX5VhCXJOwe-idxnVbw",
            "0P0XckSv_2_ZNKoYlhT4Gw",
            "YkKEsYsSpOkDBbHBGKuWQA",
            "OQIDPNTLuOD8io9FoKKIKA",
            "TD11IPIlFL9sLAWbN9FzdA"
        ]
    }
}