{
    "IZOKtFjm_hiL4OGmCq2NNA": {
        "keywords": {
            "bigrams": [
                "vegan_restaurant",
                "vegan_food",
                "dancing_dog",
                "dirty_dog",
                "lavender_cake",
                "chocolate_chip",
                "chocolate_cake",
                "fish_chips",
                "place_great",
                "tofu_scramble"
            ],
            "unigrams": [
                "vegan",
                "food",
                "place",
                "great",
                "good",
                "menu",
                "dog",
                "restaurant",
                "time",
                "think"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "beer_and_wine",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": true,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wi-Fi": "free"
            },
            "business_id": "IZOKtFjm_hiL4OGmCq2NNA",
            "categories": [
                "Food",
                "Vegetarian",
                "Juice Bars & Smoothies",
                "Vegan",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "126 W Main St\nUrbana, IL 61801",
            "hours": {
                "Friday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "14:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "20:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.112757,
            "longitude": -88.2085029,
            "name": "The Dancing Dog Eatery & Juicery",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/C7QIQ57fVm2kO6UdXOyN1Q/ms.jpg",
            "review_count": 33,
            "stars": 4.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Their soup of the day (veggie chili) was great and their tofu scrambled burrito was out of this world. Great place for vegan food, will be back for sure! YOU DON'T HAVE TO BE VEGAN TO LIKE IT. ",
        "reviews": [
            {
                "review": "My friend and I came in for lunch one afternoon and I am so glad that we did! I was very excited to try an all-vegan menu. I enjoyed their broccoli soup, a fresh glass of orange juice, and the dancing dog nachos. Everything was great from service to taste. My orange juice and soup were exceptional!The ambiance that afternoon was very calm and perfect for the two of us. I love the decor and the wait staff is very kind! I finished my meal with a freshly baked chocolate chip cookie - which was easily one of the best cookies I've ever had. Definitely recommend!",
                "reviewer_id": "-yYFnBCAVc3mgFt7m3syTw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014484166878821056,
                    "positive_probability": 0.9855158331211802
                },
                "stars": 5
            },
            {
                "review": "I don't know, I liked the food here but I was also somewhat let down because I hold vegetarian and vegan food to a higher standard than what they seem to serve here. The food here is alright but it has so much more potential to be great, and more flavorful, especially for such a price. I think they need to become more creative and up their standards here until they can be compared to the trendy vegetarian restaurants in Chicago.",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05624719612993224,
                    "positive_probability": 0.9437528038700683
                },
                "stars": 3
            },
            {
                "review": "Wonderful vegan food! The tacos, quinoa salad, bruschetta and hummus are all delicious! The desserts; specifically the mousse was great. The wait staff was very friendly. Whether vegan or carnivore this place is a great spot.",
                "reviewer_id": "4ltqEIRZk7eVVjgIdKhT9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.40673566902739916,
                    "positive_probability": 0.5932643309725989
                },
                "stars": 5
            },
            {
                "review": "I wandered in from the biting cold to find a cozy eatery with so many vegan choices. It's a vegan's dream to find a restaurant with this many options. And the atmosphere was warm, colourful, & inviting. The tofu scramble burrito ($8.50) is so good! Tofu scramble with black beans, roasted red peppers, cheddar cheeze. There are hints of curry, black beans, & potatoes in every tasty bite. The burrito is rather large & they don't skimp on the scramble. Yet, I was able to consume all of it because I have an enormous appetite that I justify with biking everywhere. It's served with fries, salsa & guacamole. The burrito comes with the choice of a side & I chose fries because I have a fetish for quality fries. These fries did not disappoint. They were potatoey, crisp on the outside, & lightly salted. I had all this with a Tingler ($4.95, 8oz) - a concoction of spinach, kale, beets, carrots, cucumber, parsley, ginger, lemon, line, orange & apple juices. Everything was delicious but the whole time, I was making eyes at the lavender cake so of course I had to have a slice ($4.95). After the first bite, I was contemplating getting a whole cake for myself. I departed full & happy. It was a fantastic brunch/lunch/whatever at Dancing Dog",
                "reviewer_id": "8O97RbJ486J3qQVOq98Obg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001753640168126604,
                    "positive_probability": 0.9998246359832033
                },
                "stars": 5
            },
            {
                "review": "Not a lot of vegan places in the area, certainly a gem in town. Good vegan food and awesome dessert!",
                "reviewer_id": "A3Vyf2gAC4z6BhFiO1WTGg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07018640808595217,
                    "positive_probability": 0.9298135919140483
                },
                "stars": 4
            },
            {
                "review": "Urbana has a vegan restaurant! Definitely a fan. Their desserts were GOOD; my favorite is the carrot cupcake! You must try it if you go! Their food is very tasty; however, I'm hoping in the future that they can expand their menu to include some creative vegan dishes that don't depend on fake-meat. There's a plethora of options available! Until then, I'm sure this will satisfy any vegan and NON-VEGAN's taste buds. :)",
                "reviewer_id": "bILKQuls9XyCmUgXU-25iQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07137453513958682,
                    "positive_probability": 0.9286254648604158
                },
                "stars": 4
            },
            {
                "review": "I came in nutrient-deficient, craving fruits and veggies. I've been back a couple of times and really enjoy their smoothies.  A couple reviews mention the smoothies are overpriced, but I think they're quite reasonable, given the high quality (real, fresh) ingredients -- if you want to save money, go to the local mega smoothie franchise and enjoy your blend of ice and artificial high-fructose concentrate something-or-other, but personally I'm glad places like this exist!",
                "reviewer_id": "bJsVht7Ayo1KNVFVca7N0w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.016924519239437736,
                    "positive_probability": 0.9830754807605641
                },
                "stars": 5
            },
            {
                "review": "We came in after yoga last Saturday for lunch. It was surprisingly busy. It's good to see an urbana business doing well.  When I saw the menu,  I was disappointed to see that most of it consists of things from the vegan frozen section at the grocery store - things that are just as convenient for me to make at home for a fraction of the price since the prices are a little inflated here in my opinion. We got the soup and the tempeh salad sandwich and ordered a beer and a smoothie while we waited. For some reason, our waitress felt it necessary to apologize 3 or 4 times for the wait on food. We gave no indication that we were in a rush.  It made us uncomfortable. She eventually started blaming inexperienced kitchen staff which was unnecessary. When she brought out the smoothie, it was about 2 inches shy of filling the glass which was odd. They need to either make bigger smoothies or buy smaller glasses to serve them in. I couldn't help but feel like I had been shorted. When the food came out, we both felt like it was under seasoned. There wasn't salt and pepper at the tables for me to fix my soup. When I considered asking for some, I decided against it. I didn't want our waitress to have more things to apologize for.In the end, we were underwhelmed. The smoothie was good but not worth the price. Save yourself some money and make yourself a veggie hot dog or fibbish fry at home.  If they add some more homemade items to the menu, I might try it again but I don't think we'll be back.Also, I'm not sure if it's a great idea to attempt to make gluten free desserts in the same facility where you make seitan from scratch. I know from experience that pure wheat gluten has a tendency to make its way everywhere.",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08072562477052361,
                    "positive_probability": 0.9192743752294901
                },
                "stars": 2
            },
            {
                "review": "I wanted to love this place as I'm a vegetarian and this place is very conveniently located for me, and I like the vibe/atmosphere.  However, after eating there twice, I can say I found the food really disappointing.  I got their lentil soup and it was totally flavorless! I asked the waitress if they could add some more spice to it. She said okay but then didn't return for another 15 minutes. By then I had given up and just added salt to the bowl and ate it.  I also got one of their smoothies and was similarly unimpressed. I'm not sure why they are so expensive; I don't think they even use organic ingredients. Really surprised by what a high rating this restaurant is getting.  To me the food and smoothies severely lacked flavor.",
                "reviewer_id": "DL8GF-ptGsBeegb6OWFptg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1033222504992994,
                    "positive_probability": 0.8966777495007057
                },
                "stars": 2
            },
            {
                "review": "Love this place! Stumbled upon it and found fresh and creative smoothies, crunchy veggies, well seasoned soups, baked fries of high quality, friendly service, and a quaint environment. Need I say more?! This place is the real deal and I highly recommended it. I'll be back tomorrow!",
                "reviewer_id": "drKE6cwj218-wlLP5TuoTw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012304520543895817,
                    "positive_probability": 0.9876954794561047
                },
                "stars": 5
            },
            {
                "review": "The vanilla lavender cake tastes exactly like the weird cakes from Strawberry Fields :/.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9519060041414538,
                    "positive_probability": 0.048093995858545686
                },
                "stars": 2
            },
            {
                "review": "Best for lunch in Urbana. YOU DON'T HAVE TO BE VEGAN TO LIKE IT. EVERYTHING IS SO YUMMY! You won't be able to tell you're eating vegan. Everything is made fresh from scratch. Service is fast and friendly.",
                "reviewer_id": "gSsG7SxlyPiTjzWF2DLYFg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5028226190053395,
                    "positive_probability": 0.49717738099465936
                },
                "stars": 5
            },
            {
                "review": "Had the FIBBISH sandwich......very good. If you are non, or part time vegan...this is the way to go. Comes with choice of sides...we had the home cut French fries...also very good. Smoothies are good. And the salads were HUGE.....well worth a trip, and reasonable. Fibbish plate was around $7.00, but had nice huge portion, plus big tomato slice,and more. Love the serving sizes.",
                "reviewer_id": "HaI9Cxe3P5bE_ByfmnrktQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013072793452374817,
                    "positive_probability": 0.9869272065476232
                },
                "stars": 5
            },
            {
                "review": "Really great experience my second time here. It seems they have worked out the kinks in the menu. Fish and Chips were excellent. will definitely be back.",
                "reviewer_id": "IIRBF6_xbWYPbP_mjGI8RA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5112439665793401,
                    "positive_probability": 0.48875603342065854
                },
                "stars": 4
            },
            {
                "review": "Sooo good!!! The  desserts are unreal and they're healthy!!! It's a must to stop by this local gem. Don't leave Urbana without doing so!",
                "reviewer_id": "jqXIEG4t6NwHQEbkWjHBgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15257498354406873,
                    "positive_probability": 0.8474250164559307
                },
                "stars": 5
            },
            {
                "review": "After spending over a year researching vegan eats all over the east coast, I knew the thing I would miss most about NYC and Philly is the array of vegan dining options that central IL is severely lacking. Luckily, this Dog came dancing into my life and did more than soften the blow...Specific favorite things about DD:1.) Dessert: Ever heard of Vegan Treats in Bethlehem, PA? It was named one of the top 10 bakeries in the world. I can honestly say that after trying ~ 20 treats from there, I have had DD desserts that I've enjoyed more than many at VT. DD has new desserts every day, so it's my favorite part each visit to walk in and see what's on display. Some days have a better selection than others, so I wish the pastry department would expand to guarantee at least 2-3 cakes/cupcakes each day (always so moist and decadent). Some gems I've tried are GF vanilla lavender cake, \"ricotta\" cheesecake trifle, peanut butter fudge, and an oatmeal cream pie that would make Little Debbie abandon her reign and go veg for life.2.) Lunch/Dinner options: I'm happy to see the menu is expanded, although I certainly don't have a problem with the kitchen continuing to experiment with even more options for me to try. (; Here are some highlights:-- Soups. They have an actual soup wizard working for them. One Soup of the Day I was particularly impressed with a couple months ago, humbly titled \"mushroom\", was full of beautiful shiitakes, shining in a rich and silky umami broth of love. The chili is offered daily and it is also very tasty, hearty yet light and full of vegetables in addition to the beans.-- Down & Dirty Dog.  This dog isn't made of random appendages from who knows how many species of animal. Nor is it the beige rubber stick that vegans have been begrudgingly choking down at bonfires for years. It's the best dog I've ever had. And the slaw and baked beans are even better, offering a hint of sweetness and a creamy crunch. There's also a pickle involved if you want even more crunch and tang, but I kind of liked eating the pickle separately because the slaw and beans are too good to be \"speared\" like that (ha).-- Seitan Rueben. I've had other versions of this, including the famous Chicago Diner one, but DD's is special in its own right. I love that the seitan is made in-house because I know many vegan restaurants (even Vedge, the best vegan restaurant in the country) use seitan from outside sources. Plus DD's thousand island relish is crazy good. -- Quinoa Scoop On A Bed. I once heard another customer tell a server the salad should be renamed to \"Mound of Goodness\". I wouldn't disagree. Mostly because of that tangy avocado dressing, but also because I when I want a salad, I want a legit sized bowl full of dark green and purple leaves, not a handful of lettuce with a tasteless tomato on top. 3.) The Veggs Bennedog for Sunday brunch. The Hollandaise sauce is insane. Who needs egg yolks ever? Even better with spinach!4.) Staff: Everyone I've met here has been awesome; not just knowledgeable about the food but actually excited about it too (an unfortunate rarity in the food industry). I've even had a some interactions with the owners Linda and Brian (who are usually around - another sign of a great restaurant), and I can tell they are wonderful people who care about the food being served, and treat their employees well.Overall, the Dancing Dog executes well what it has set out to be: a place where vegans and non-vegans can happily mingle with plenty of satisfying and tasty options, mostly reminiscent of traditional cafe/diner fare. They're still new and have a ton of potential to grow, which is exciting because they are off to an excellent start. This being said, the main suggestion I'd like to see more of in the future is fresh produce shining in more dishes.. Especially seasonal; it is winter so I'd love something like sweet potato gnocchi and roasted kabocha squash in sage brown butter sauce. (Also I hope real lemons are used in lemon cakes, not lemon extract, for example.) (Final note, in response to a previous comment about using items from the vegan section of a grocery store... First, only a few menu items here even contain faux meats, certainly not the majority of the menu. And much like how non-veg restaurants do not construct chicken cutlets out of pantry ingredients and witchcraft, I'm guessing DD chooses certain faux meats because they cannot produce them in the kitchen. No, vegan restaurants do not NEED to use processed faux animal products, but the truth is that many vegans and non-vegans alike are intrigued by dishes that resemble childhood favorites, for instance, that we no longer eat because of the poor practices of the meat and dairy industries. Regardless, while 3-4 dishes on the menu use such \"meats\" as a component, the kitchen does their own seasoning/treatment to them, and all the accoutrements they are served with are house-made and delicious!)",
                "reviewer_id": "kExw8TGrYqHhGbpv8JAO3g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.9653169369917044e-18,
                    "positive_probability": 1
                },
                "stars": 5
            },
            {
                "review": "Great ambience, it's a quirky restaurant that you can take out or dine in. Awesome juices and vegan dishes. Their soup of the day (veggie chili) was great and their tofu scrambled burrito was out of this world. It was so good we went back twice in 2 days!",
                "reviewer_id": "OMZAGyR1TX6qT3Y7WBOa5g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8253087687733551,
                    "positive_probability": 0.17469123122664337
                },
                "stars": 5
            },
            {
                "review": "I like how calming and casual this place is. And the food is great. I got this one type of carrot juice that I think about often.",
                "reviewer_id": "OvNUbUGurlG6jtWLV2sxgw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7754958780984463,
                    "positive_probability": 0.22450412190155603
                },
                "stars": 5
            },
            {
                "review": "I have visited five times and each time the food and service has been wonderful. Linda and Brian do an amazingly creative job with vegan fare. The fruit is always ripe and the smoothies are divine. My favorite is the burrito - so good. Love the cole slaw. We had our company Holiday Party there in January and it was a big success with great appetizers and wine. The prices were very reasonable, and the atmosphere was great with candles on all of the tables and festive music. Such a welcome addition to Chambana.",
                "reviewer_id": "pZhhLfJQGiRsJmvgZJZZwg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010945481175061451,
                    "positive_probability": 0.9890545188249309
                },
                "stars": 5
            },
            {
                "review": "This place was recommended to me by a friend who is a regular here. I am not vegan, but I love to try almost anything. I really wanted to try the Fibbish and Chips, but they had run out. So, I ended up going with The Down and Dirty Dog with the quinoa and corn salad as my side. I also had a Pineapple Blueberry smoothie. Just drinking that smoothie made me feel healthier (technically one smoothie won't make you healthier, but that's besides the point). I get my smoothie first and they had made it wrong, it tasted a little off and looked kind of not right in color, but I actually wasn't going to say anything. They knew though and had another made for me that looked much better when I got it.  Then, my food came. The quinoa and corn salad is very light. I like it, although I think if they use lemon at all in it, maybe a little more. The Down and Dirty Dog is delicious! The beans and slaw on it are the pice de rsistance. I love the slaw! :) I decided that I might as well finish with a dessert since I was going to do a review. I was going to get a piece of their double chocolate cake, but someone literally ordered the rest of it before I was able to acquire a piece. Oh well, another time. I did however, get one of their big chocolate chip cookies. It has walnuts in it and I don't normally like walnuts in my chocolate chip cookies, but the walnuts added to the flavor and texture of the cookie. It was a little crispy on the edges and nice and soft otherwise. It was a really good food experience and I will be back.",
                "reviewer_id": "qBBt0BfW4gXUWbYxX08JnA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14113071119679807,
                    "positive_probability": 0.8588692888032173
                },
                "stars": 4
            },
            {
                "review": "Holy crap, this place is great. My boyfriend and I came down from Chicago to visit family and decided to check this place out. We started with the hummus plate and the hummus tasted fresh and so were the veggies. I got the dirty dog, which is a must-try. It is a veggie dog with baked beans, coleslaw and a pickle on top. Yum!!!My boyfriend got the tofu scramble burrito and it was delicious as well!We weren't expecting to find such an amazing vegan cafe in Urbana, everyone needs to try this place out!",
                "reviewer_id": "t9SJIGLN7LU1nRofonS4rA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010686240684054302,
                    "positive_probability": 0.989313759315939
                },
                "stars": 5
            },
            {
                "review": "Fresh squeezed juices! Thank you for delivering healthy options. Nice cozy spot to get some lunch and work done.",
                "reviewer_id": "uhw4jPdmMBqJXHg5KvLJww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12663819291882342,
                    "positive_probability": 0.8733618070811777
                },
                "stars": 4
            },
            {
                "review": "I visited The Dancing Dog this evening, had an excellent meal, and the service was wonderful as well. The staff are very friendly, and everything on the menu (including the wine) is 100% vegan. I had the vegan fish and chips. I think the vegan fish pieces (there were three) are Sophie's Choice brand, and they are deep fried, so if you are looking for vegan health food, this might not be the dish for you. However, if you want the closest thing I've ever tasted to British-style fish and chips, this would be it. The tartar sauce was tasty and the coleslaw was some of the best I've had anywhere. For dessert, I ordered the chocolate chocolate chip, cookie, which was also excellent. Dense and chocolatey, slightly crispy on the outside and soft on the inside.I will definitely visit here again the next time I'm in Urbana. Any vegans and vegetarians in town should feel lucky to have this wonderful restaurant.",
                "reviewer_id": "UlmQStYUblQpHtdKLNXnOg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 9.080209075586569e-05,
                    "positive_probability": 0.9999091979092434
                },
                "stars": 5
            },
            {
                "review": "Had dinner here tonight and ordered The Tingler (with kale, beets, lemon, and ginger) along with the vegan lasagna (which came with a side salad).  The juice, lasagna, and salad were all excellent.  Portions seemed generous and fresh.  We also ordered the German chocolate cake and the frosting was delicious, but the cake itself was a little dry and had a sawdust texture.  Otherwise, it was decent.Overall, however, this proved to be a better experience than my first time dining here, when it was becoming very chilly this past winter and I ordered a tempeh wrap thinking it would be a hot sandwich--only to have it arrive cold.  Not appetizing.  I hope they continue to experiment some more, and consider offering more rice or quinoa dishes that deviate from the expected (spaghetti, for example).",
                "reviewer_id": "uT5j3gacwwzZ3LO5P4_1KA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006261905058107405,
                    "positive_probability": 0.9993738094941902
                },
                "stars": 4
            },
            {
                "review": "Who would have thought, that an amazing vegan restaurant would be nestled in the main street of Urbana, IL. I had not eaten all day and I was ready to chow down. Usually in situations like this, I think Mexican food. But my friend Issac said we have a cool vegan place 2 blocks from where you are playing you should check it out! Oh man Im so glad we did. I got this wonderful Peanut Butter thai veggie bowl with rice that had the most amazing flavor and totally hit the spot for a perfect dinner option! The place was cool, you can order anything off the menu vegan, and they have amazing looking deserts! I went back the next morning to get coffee for the road and I loved how they had Soy Creamer (not just soy milk) for the coffee! Really wonderful spot! I must stop of the highway next time I'm driving through to hit this place up again!",
                "reviewer_id": "vlWwsOG5fL8byQRZ7IIBZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3125437956195457,
                    "positive_probability": 0.6874562043804546
                },
                "stars": 5
            },
            {
                "review": "So nice to finally have a place dedicated to cruelty-free and people with special diets. The nachos are amazing.  I hadn't had a Reuben in 5 years and finally had the vegan one which was awesome.  It's a great place for an intimate lunch or a dinner out. My husband took me there for Valentines Day this year and we left so happy. The desserts are amazing too.",
                "reviewer_id": "XOKy3A0DCZuzeglHZw76XQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.011287856669636703,
                    "positive_probability": 0.9887121433303617
                },
                "stars": 5
            },
            {
                "review": "I usually dis vegetarian food/ place, but this place is different. I had the quinoa on a bed, which was just like salad you would find anywhere - it was ok. However, my friend had the vegetarian chorizo, and it was awesome. It tastes just like meat!! I think the type of vegetarian meat that they serve changes every now and then. We also had the lavender cake for dessert. It was a little too sweet, but it's still yummy!",
                "reviewer_id": "xUu9gORsM_AEWJjiEN4fHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.36272614840405926,
                    "positive_probability": 0.6372738515959444
                },
                "stars": 4
            },
            {
                "review": "How is it fair that Urbana has a vegan restaurant, and all the way in Naperville I have to settle for my infrequent trips to the city in order to eat at a restaurant that actually serves food I'll eat???!!! Yes, I'm jealous!!The menu here wasn't super extensive, but I actually really like that in a vegan restaurant. I spend less time agonizing over what to order, and more time looking forward to eating it. I got a seitan reuben, and it lived up to all of my expectations. I did think it was on the rather small side, but it was still filling, and came with a nice, heaping pile of fries. Yummmmm.I guess I'll just have to be back to visit my good friend in Urbana more often and try out the rest of the menu!",
                "reviewer_id": "yjRh-hnfVdTQ_wpgiDbAgQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9388094213375845,
                    "positive_probability": 0.06119057866241093
                },
                "stars": 5
            },
            {
                "review": "A friend recommended me this place. The Lasagna and chocolate cake with vanilla frosting both were great. Overall everyone loved whatever they tried. I have heard that Tingler is good too, although I haven't tasted that yet. Great place for vegan food, will be back for sure!",
                "reviewer_id": "z8pj_lrILY57qU2zvrROpQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5355197629347311,
                    "positive_probability": 0.4644802370652641
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "cmLB5X26RJXWdZ2qrS5KOg",
            "0a4lX5VhCXJOwe-idxnVbw",
            "4UG9uGnByKgoiuVpC0DthA",
            "YkKEsYsSpOkDBbHBGKuWQA",
            "SeQv-RJ2rS070NvSRh_siQ",
            "doCqqCuoDsIQYDSY2gkUtQ",
            "fYE54FZCIFYYdFs-AkqRuw",
            "R3dSeFD8k_Z-EHNLlUELiw",
            "cab8Jri_Zdz2487hG5em6w",
            "i0_W9_1abdjBS7d5-pWORQ"
        ]
    },
    "tSObxv4wRa99nEDaB8Xisw": {
        "keywords": {
            "bigrams": [
                "bubble_tea",
                "milk_tea",
                "green_tea",
                "mango_green",
                "half_hour",
                "tea_tasty",
                "come_back",
                "tea_house",
                "gift_cards",
                "place_bubble"
            ],
            "unigrams": [
                "tea",
                "bubble",
                "milk",
                "sweet",
                "mango",
                "back",
                "great",
                "green",
                "come",
                "try"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "tSObxv4wRa99nEDaB8Xisw",
            "categories": [
                "Food",
                "Bubble Tea",
                "Cafes",
                "Desserts",
                "Juice Bars & Smoothies",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "410 E Green St\nSte 2\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.110554,
            "longitude": -88.232373,
            "name": "Milk Tea House",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/mplhXeodLMzrLZPBJoF_Kw/ms.jpg",
            "review_count": 15,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Would definitely come back if I come down for a visit again to try a new flavor. I had to wait half an hour for my drink and there weren't even that many customers at the time. Came here on grand opening day and although it did take a while to receive my order, I came back the following weekend and the service was indeed much better! ",
        "reviews": [
            {
                "review": "The first time I went with my girlfriend she had a disappointing experience with their macha bubble tea while I got the mango bubble tea which was so-so. I went again and order the almond bubble tea and it was complete trash. I only took two sips before throwing it out. This place is garbage.",
                "reviewer_id": "B6CG3zfADjG6DoVnj6U04Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3900706438151546,
                    "positive_probability": 0.6099293561848435
                },
                "stars": 1
            },
            {
                "review": "We've been waiting half an hour for our drinks and still haven't gotten them.I came earlier in the day and their milk teas are very weak, tastes like water and powdered flavoring with no semblance of a tea flavor. It's all hype but  they are ridiculously slow and the product isn't even good. Never coming here again.",
                "reviewer_id": "fgaQKuljQcO9xTVzqL-81Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8920686190553638,
                    "positive_probability": 0.10793138094463307
                },
                "stars": 1
            },
            {
                "review": "I had to wait half an hour for my drink and there weren't even that many customers at the time. The drinks tasted watered down and the only taste I could gather was the jelly they added because they ran out of boba, which I didn't even request. The product was not worth the long wait. Definitely do not recommend.",
                "reviewer_id": "iiUTeJN_iJBhxp5VuwoDDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2972103855592387,
                    "positive_probability": 0.7027896144407596
                },
                "stars": 1
            },
            {
                "review": "Most authentic bubble tea place in the entire Champaign-Urbana area! For those looking for real bubble tea that's not over sugary with a plethora of flavors, look no further! The gift cards are also a great investment too - $50 gift cards have a $10 bonus, and $30 have a $5 bonus! Will definitely be back in the future.",
                "reviewer_id": "J1mSzzc2UQN9r5TvWJvWgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02154743045393613,
                    "positive_probability": 0.9784525695460599
                },
                "stars": 5
            },
            {
                "review": "The grand opening buy 1, get 1 free deal ended, and that might also be the end of my visits here. They just opened on 4/24, and I think they're off to a shakey start. I do enjoy the taro milk tea though! I also really like their cartoon animal cups and lid covers that sort of teach you Chinese fruit names. Depending on when you come, there may be a large crowd of people, which means your order will take some time to make as they make everything to order - nothing is premade. Also, they don't allow for customizations. You can only get what's offered on the menu - no fruit substitutions, etc. Unfortunately, there are only two tables to sit at, so you'll likely be standing around while waiting. I hope they'll get more chairs and tables because there's a lot more room in the shop.My one pet peeve is that some of the fruit syrup they use to flavor their milk teas tastes weirdly artificial. I got a strawberry milk tea and it tasted like I was drinking a liquid, watered down strawberry ring pop. I tried a friend's mango green tea and it was ridiculously sweet with a tang of mango. Otherwise, it's not very remarkable milk tea that would make me come back.I'd give them two and a half stars, but I bumped it to three because the service is really nice and the employees do try very hard to get the orders correct. Also, when I came on Friday as they were closing up and finishing the last orders, the owner lady gave me and my friends free drinks to try anyway, which was sweet of her. Everything on the menu is relatively inexpensive and under $5.",
                "reviewer_id": "JsHky2NY-FvugF8WTMsZtQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10522950143547392,
                    "positive_probability": 0.8947704985645382
                },
                "stars": 3
            },
            {
                "review": "Taste is awesome, the space is small but cute. They play Chinese music, which takes me back to my summer abroad. Just a little pricier than I would like, 3.50 for the smallest size which is labeled medium but is more like a small. Original Milk Tea is so tasty :)",
                "reviewer_id": "jzHYOVZbns5qY08149moKg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0223016133538187,
                    "positive_probability": 0.9776983866461794
                },
                "stars": 4
            },
            {
                "review": "The wait is long but I can understand it. They don't pre make things. However, the powder they use for the drinks is too sweet and overwhelming. And my coffee jelly was hard :( not a fan.",
                "reviewer_id": "KBsh9Y0qz9O9uaZqfkSG9Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27395334301921753,
                    "positive_probability": 0.7260466569807841
                },
                "stars": 2
            },
            {
                "review": "So randomly visited my alma mater and stumbled upon this place since I was craving a smoothie and apparently smoothie king is gone.  They just opened up recently or maybe even today.  Looks nice and clean and they have like way more workers than they probably need. I ended up getting a taro bubble tea and the gf got matcha milk tea.  Not sure if it's a promo or something but the tea was free!  Whoo hoo.  Anyway,  the bubble tea was delicious for 4.50 for a large. Would definitely come back if I come down for a visit again to try a new flavor.",
                "reviewer_id": "kKhktrVTWqDUom8ZbxE8JA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04662851196544147,
                    "positive_probability": 0.9533714880345534
                },
                "stars": 5
            },
            {
                "review": "Milk tea house is great! If you've had a bad drink, I encourage you to go back and try something else - they have tons of things on their menu (especially since they just added a lot of new things) like boiled tofu, chicken wings, and great shaved snow ice in several flavors (taro, coconut, mango, chocolate, green tea, etc.) in addition to lots of great drinks. C",
                "reviewer_id": "lJw_0CG8isgttEMIVUEtkg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06015472195129363,
                    "positive_probability": 0.939845278048703
                },
                "stars": 5
            },
            {
                "review": "Came here on grand opening day and although it did take a while to receive my order, I came back the following weekend and the service was indeed much better! One of my personal favorites is their mango green tea. It isn't made too sweet, but isn't too bland, either.The staff there are friendly, price is reasonable and with the new addition of the daily 25% off specials as well as having met my current boyfriend here, I have no choice but to give it 5 stars!",
                "reviewer_id": "mUlzfW1cEL4qtEXfB4_y2g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11762654360909547,
                    "positive_probability": 0.8823734563909034
                },
                "stars": 5
            },
            {
                "review": "A great place to go for bubble tea! The decor is nice and homey, and the staff is very friendly! It's more or less the bubble tea shop I wish we've had on campus for the last 4 years. And they actually have non-milk fruit teas (which I highly recommend)!",
                "reviewer_id": "nMLiGbzq7C6iogrlcUejPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09679383108089878,
                    "positive_probability": 0.9032061689190996
                },
                "stars": 5
            },
            {
                "review": "I just tried their new products..like eel don and boiled food (i forgot the name)... Do not recommend at all",
                "reviewer_id": "p6ex4oQN1D0WU4xdAIHlYA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9256769802557836,
                    "positive_probability": 0.07432301974421866
                },
                "stars": 1
            },
            {
                "review": "Tried this for the first time. They've added about a half dozen more tables, have some privacy screens up, decor is cute. Workers were earnest and ready to help. I had the mango green tea and it was tasty, not too sweet, hint of green tea flavor and the jelly was soft and fresh. Only three bucks for a medium too. Service only took a few minutes, no line, just steady customers, few people sitting down. No complaints here!",
                "reviewer_id": "tBiAJtAB4RsXiB4uWxtWrA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005181278916143657,
                    "positive_probability": 0.9994818721083795
                },
                "stars": 4
            },
            {
                "review": "I come here almost every day! Milk tea house is hands down my favorite place for bubble tea. I used to only get their bubble tea, but since I have been coming here so often, I decided to try everything on their menu. Though some things are pricey, they are all so delicious and worth it! (Except maybe the roasted sweet potato because it was just a sweet potato lol)",
                "reviewer_id": "tltp1yeqycXSUF73zXJ5uw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08667961623948627,
                    "positive_probability": 0.91332038376051
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "9nmeU-OOyxkn8vRy5dolNg",
            "p8GMdsCCy-NV_wZuDaU2Jw",
            "IZOKtFjm_hiL4OGmCq2NNA",
            "oHKjjwehNipcGIYBThWg9w",
            "4UG9uGnByKgoiuVpC0DthA",
            "wO8c-FbduauxCGiEHchGRA",
            "0P0XckSv_2_ZNKoYlhT4Gw",
            "caK31Iq3TClNCRB9WH9lhQ",
            "YkKEsYsSpOkDBbHBGKuWQA",
            "DntkMrzlbFPdOdxJtEWLBw"
        ]
    }
}