{
    "DjJS8vJXzmpwMUEAcxCexg": {
        "keywords": {
            "bigrams": [
                "stir_fry",
                "flat_top",
                "food_good",
                "warrior_sauce",
                "unlimited_bowls",
                "peanut_sauce",
                "sauce_choices",
                "weeks_ago",
                "make_sure",
                "lunch_time"
            ],
            "unigrams": [
                "food",
                "bowl",
                "good",
                "sauce",
                "sauces",
                "place",
                "stir",
                "fry",
                "great",
                "try"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "full_bar",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": true,
                    "lot": false,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "free"
            },
            "business_id": "DjJS8vJXzmpwMUEAcxCexg",
            "categories": [
                "Mongolian",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "301 N Neil St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "22:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1190386,
            "longitude": -88.2438816,
            "name": "301 Mongolia",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/NElXhAx2RaNT9l2JdCAVRQ/ms.jpg",
            "review_count": 48,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This place has delicious food and great service. The food is good but  over priced. This will come into your bowl later. ",
        "reviews": [
            {
                "review": "My wife and I ate here this evening, looking to have a vegetable-infused meal to end the weekend. I bought a Ci Saves coupon several weeks ago and was looking forward to using it.Service: We ate late in the afternoon/early evening. Only a few other tables were occupied. Our server, Cole, was excellent. He was polite, kept our glasses full (water and ice tea), and hit that nice sweet spot of coming around frequently enough to check on us, but not so much that our dinner was continually interrupted.Food: Although the bowl for the veggies looked small, we had more than enough to satisfy ourselves without getting a second bowl. Having the rice put in separate from the veggies by the cook  helps.The vegetables were typical for stir fry restaurants. They all appeared fresh and appealing. My only disappointment was not having jalapenos to add in the veggie bowl.There was a good selection of sauces. Unless I missed it, the only regular type that was missing was a plum sauce. Looking back, I wish that I had used more sauce in my mixture. However, a little soy sauce added after we received our cooked food worked well.The proteins all looked great. I selected a combination of beef, calamari and white fish. I did try a little Andouille sausage, which was quite interesting to add in at a stir fry restaurant.The cooking time seemed appropriate. Hot, steaming bowls were delivered to our table in a short time. The bread served with the stir fry was excellent.So ... our trip to 301 Mongolia was very nice. It was a great way to end the weekend.",
                "reviewer_id": "-KZ0k14H3zdZVzEnhVq1ag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006935464896946349,
                    "positive_probability": 0.9930645351030714
                },
                "stars": 5
            },
            {
                "review": "I enjoyed my trip to 301 Mongolia enough for a 4-star review. For create your own stir fry, the vegetables were fresh, the meat was good, and I liked the sauces very much!The reason for 3 stars? The price. Lunch is $9.99, not bad, but we went for dinner; $15.99 definitely was steep, esp. since there was a $2 takeout charge. For $11.99 or $12.99 even it was a quality meal, I just wish there was a way to not have a $40 dinner bill for two meals and no drinks or appetizers!",
                "reviewer_id": "10kJE1gtgnzXxrqmfVq9FA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03060285015967953,
                    "positive_probability": 0.9693971498403205
                },
                "stars": 3
            },
            {
                "review": "Tried it for the first time last night... Had really good service... It's a really nice atmosphere... The food was fresh and there were a lot more meat options than I had expected.... Salmon, crab, shrimp... They've changed their dinner options to one bowl and unlimited... I got the unlimited... Tried a noodle soup with shrimp and warrior sauce... It turned out so good and then got noodles with chicken with a combination of the peanut and chilling sauce... Definitely going back ... I want to try their appetizers ... They looked so good on the menu",
                "reviewer_id": "3hWvdEFSVW_-aSI2FvDDEQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.37606667873093785,
                    "positive_probability": 0.6239333212690699
                },
                "stars": 5
            },
            {
                "review": "great food and tons of choices although i was overwhelmed with the sauce selection. better to eat at lunch time it's cheaper and it's unlimited. tip: if you are going for seconds after handing off your 1st bowl to be cooked go sit down and ask for another bowl and then go make that one and that way your eating the 1st bowl while your 2nd bowl is about to be or is being made. i learned my lesson the previous 2 times iv'e dined there when it took 15 to 20 minutes to make my 2nd bowl. lunch time it's $10.95 at night it's $13.95.",
                "reviewer_id": "5ZIbB1o742vx77ZgO67ZQw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005643681890902327,
                    "positive_probability": 0.9943563181090933
                },
                "stars": 4
            },
            {
                "review": "The food is good but  over priced. It was $17 for a bowl and I was disappointed that shrimp was not an option.",
                "reviewer_id": "60juruDHOc7-yhc2bE2Elw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7224751809981258,
                    "positive_probability": 0.2775248190018737
                },
                "stars": 3
            },
            {
                "review": "Finally got around to trying this place last night...Overall, the food was fresh and tasted great.  The selection of veggies/add-in's was fairly extensive.  They offered a great protein selection...including big fresh chunks of salmon, which tasted awesome!  There was also an odd tasting spicy sausage which I wouldn't recommend unless that's particularly your thing.If you're not familiar with the format of mongolian bbq places, I recommend asking the server how it works if you're confused.  They offer to turn your meal into a \"salad or soup\", which I think basically means the veggies are cooked or served raw.  I went for the soup version, and while the broth it's served in seemed like a lot, overall I have no complaints on the taste.  I might opt for the \"full\" order of rice next time to soak up some of the broth.I'd say the service we got was adequate.  Our server wasn't the best at explaining the system there, and was somewhat slow at times, but I'm sure that's more the individual as opposed to the overall service of the place.  The ambiance was great, and the prices were fairly typical.  $13.99 for a one-trip bowl, $15.99 unlimited with a $2 take home fee.  Lunch is cheaper at $9.99.  I'm definitely going back to try the Mongolian nachos, which sounded delicious!",
                "reviewer_id": "60uI3H_9u86AyL2vCaLW_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.0523926412858125e-05,
                    "positive_probability": 0.9999394760736
                },
                "stars": 4
            },
            {
                "review": "J pointed out 301 Mongolia to me on our way in to Destihl the night before, and I must admit I was pretty excited to try it out as we both love Flat Top Grill.  So, when she informed me that's where we were going for dinner the next night... woohoo!When we arrived around 7pm on a weekday, I was impressed by the look of the place.  Personally, I loved the muted red color of the globe lights and the open feeling of the restaurant.  The hostess and our server were friendly.  Practically empty, customer-wise.  I perused the food options as we were seated and liked the variety of veggies, sauces and proteins.  So far, so good!We ordered drinks and an app - the Mongolian Nachos.  I liked my Martini, another smooth sipping winner... J's Margarita packed quite a liquor whallop... and I hated te nachos (even with some help from sauces from the stir fry bar, it was dull city).On to the main event - and I'll compare my finds at 301 to Flat Top for those of you who've tried FT.  301 had more basic veggie choices (no premixed 'stir fry veggie' bins), and a whole bin of bean sprouts (yah!  my fav stir fry veg).  There appears to be an equal amount of sauce choices at both locations, but the sauce flavors at 301 were not as robustly seasoned.  301 had many more protein choices than FT but no vegetarian options that I could see (FT kicks butt on veg protein options).  I was able to make my 301 stir fry into a soup, but there was not enough broth and the flavor just wasn't there (and I swear I put 6 ladles of sauces into my stir fry).  301 had more herb and spice shakers too.  301's roti bread was good (and they'll give you extra, same as FT), but FT's roti is just amazing.If I'm craving stir fry in Champaign, I'll stick with Flat Top.",
                "reviewer_id": "71e2m7D3ul5TPB5OKBKQZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 4.024531756685936e-07,
                    "positive_probability": 0.9999995975468192
                },
                "stars": 3
            },
            {
                "review": "My bowls are always so delicious here, so fresh and i could eat three or more. Price is reasonable and staff friendly. Try the warrior sauce!",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2868661501079887,
                    "positive_probability": 0.7131338498920093
                },
                "stars": 5
            },
            {
                "review": "has some of the best sauces that i have had the coconut curry with shrimp and the thai basil omg this is a great combo very nice and clean they are sister and brother restaraunts to dublin oneal cant wait to try this shepard pie with what i has seen to be full of lame and chucks of delicues beef",
                "reviewer_id": "9KvSViJk_Z5FkxkYTwryhA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06987624441387982,
                    "positive_probability": 0.930123755586117
                },
                "stars": 4
            },
            {
                "review": "I had dinner there a few weeks ago it was great. the end result is typically your own fault since you create it yourself. It was our first time dining at 301 mongolia & I must say I will return with friends. The waiter Tk was fantastic. She pin pointed every aspect. She was attentive but not so much where it became annoying. Even though it was pretty busy and looked as if she were the only one waiting tables  Our drinks were always on refill at the right time. & although the buffet was 2 steps away she brang us extra sause upon request and was just a joy all around. Two thumbs up!",
                "reviewer_id": "_ap__8xPcUxhxP4DvhT-wQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.9407484559057658e-05,
                    "positive_probability": 0.999970592515445
                },
                "stars": 5
            },
            {
                "review": "The problem with this concept is that the food is only as good as YOU make it. If I were king of this castle, I would have some pre-established recommendations for those of us not well versed in sauces and combinations. They also don't mix any of the rices with your stir-fry, but they may do it if you ask. Also, someone in my party had shrimp in their dish that were part of someone else's dish...sloppy. Overall though, I would go there again because I found a combination that I liked. The server's were great, the decor was great, and I liked the background music.If you are a vegetarian and like a mostly noodle dish, I recommend the lo mein noodles with carrots, mushrooms, baby corn, and broccoli. My sauce was 2 parts teriyaki, one part garlic water, one part ginger water, and 1/2 part of pineapple sweet and sour.",
                "reviewer_id": "_qHqGt4TRu86J83NMxgsvw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14878022575637043,
                    "positive_probability": 0.8512197742436276
                },
                "stars": 3
            },
            {
                "review": "I was questioning whether to eat at the restaurant or not for dinner on a Sunday night, and as we were pondering outside, we thought that the restaurant was very trendy and the hostess looked very professional and put together. So at the end we decided to go eat there. The food was very good, the hostess and the waitress was extremely adorable. The service was very good. I liked it and highly recommend it. p.s. the chocolate wontons were delicioso",
                "reviewer_id": "Aa99R_ld-Dl0wk8N9SUWlg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002429997250096193,
                    "positive_probability": 0.9975700027499016
                },
                "stars": 5
            },
            {
                "review": "I thoroughly enjoyed my experience here. You get to pick exactly what you are going to eat and they cook it right in front of you!",
                "reviewer_id": "amxtfaoqV0JEwbJUFeCyLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3377063749362409,
                    "positive_probability": 0.6622936250637587
                },
                "stars": 4
            },
            {
                "review": "I don't LOVE this place but I wouldn't hesitate to recommend it to anyone who is craving a good place to eat stir fry. Flat top Grill would be a direct competitor, yet this place is much better. They had a fresh array of vegetables, sauces and meats/seafood which is a HUGE plus. They have Calarmari and Salmon for seafood lovers, chicken, beef and pork so theres something for everyone! (there is no vegetarian protein option) The Servers recommend eating small portions so you can go up and try as many combinations as possible. Also, It is easier for them to cook with smaller portions as well. Just remember to set your portions This place might be pricey for some but I believe its reasonably priced. If you want the most out of your money, I would suggest going there for lunch since it is only $9.95 for unlimited bowls. My friend works at 301 so I got a great experience. We started off with the Mongolian Nachos which I was quite impressed with it. The chips were fried with wonton batter i believe, and topped with a mixture of sour cream, green onions, tomatoes & chicken. I would definiltey give this a thumbs up and worth the try!!Once I got the bowls I went up and added all my ingredients, but when i got to the sauces i was overwhelmed with all the choices. Even using the small cups to try out the sauces didn't make my decision making any easier so I asked the chef for his suggestions and i was VERY happy with my stir fry. I used sesame soy, hunan and warrior. The warrior gave it a little spice so don't put too much if you don't like spicy. He suggested also the coconut curry, peanut sauce, warrior sauce and 301 BBQ sauce for more of a pad thai mixture which I didn't get to try. We ended the day with the Chocolate wontons for dessert which I'm sure would've tasted 10X better if I wasn't so full. It came out with caramel, strawberry dipping sauces along with whipped cream so it was hard to turn them down. Overall, 301 was a great experience, and would recommend to anyone unless you aren't craving for it. TRY IT OUT!",
                "reviewer_id": "b8dBV47z9Hhj6QzOs4QNqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09729568138128425,
                    "positive_probability": 0.9027043186186805
                },
                "stars": 3
            },
            {
                "review": "If you don't like your food here, it's because you're doing it wrong. That being said, I think you could also end up making this food at home for yourself, but I digress.It's got a nice theme to it, it's decorated nicely, there are tons of options, and most of the sauces are pretty good. You can definitely get a lot of food, so its best to bring a large appetite. It was very very empty when we stopped in, which was kind of a bummer. All in all, it's definitely not bad, but it's also nothing too special either.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.607639621145077,
                    "positive_probability": 0.39236037885492037
                },
                "stars": 3
            },
            {
                "review": "My favorite stir fry noodle place. The buffet part is amazing especially if you go during lunch timings.",
                "reviewer_id": "C9PJQEgHTh0ERQ8BTbVjZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1812755152734815,
                    "positive_probability": 0.8187244847265184
                },
                "stars": 5
            },
            {
                "review": "We happened upon 301 Mongolia when Destihl wouldn't seat us at one of their 15 empty tables claiming an impending influx of reservations at 2:30 in the afternoon.  Jigga what?  Oh well, their loss is our gain.  I love unlimited make your own stir fry and 301 did not disappoint.  I tried a couple variations and it was all delicious. The veggies were fresh, the ingredients were constantly replenished and the portions were huge!  All of that for $9.99 per person is a great deal.  They even have a check in offer for free edamame.  If you are in the C-U area check it out!",
                "reviewer_id": "cnL8sdl7vlmAidSJIDhvFg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.28107909769929545,
                    "positive_probability": 0.7189209023007013
                },
                "stars": 4
            },
            {
                "review": "Great food and healthy. Good location, and concept! You choose the veggies, proteins, and spices. Nice service and the food was delivered in 13 minutes on Saturday night. I will go again!",
                "reviewer_id": "CnZJAb8yjkxz3lW4hBWxtQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5499512907473015,
                    "positive_probability": 0.4500487092526995
                },
                "stars": 3
            },
            {
                "review": "As of March 2014, 301 Mongolia has reopened. The owner, who also owns near neighbor Dublin O'Neil's, had originally intended to extend the Irish pub into the space, but has now reversed course and reopened this Mongolian grill. We'd eaten at Mongolia 301 several times before the closure, mainly for lunch, and always had a good meal. We like the healthier options and the clean, contemporary decor. I especially like the funky red and white globe pendant lamps.Today, on a Tuesday, we stopped by the newly reopened 301 Mongolia for an early dinner (around 5 pm). There was only one other couple in the place, one waiter, and one cook. When we went up to select our vegetables, it was clear that many of them were not fresh, both the raw and the blanched. The snap peas had streaks of brownish-gray with depressed marks running down the side. The white slices of the bok choy had browned and shrunk. Half of the green beans were gray. The spinach had browned on the edges and begun to wilt. Even the bottom of the mostly empty chopped peanut container had a hardened mashed peanut residue that had been there awhile -- I scraped at it with a spoon, but it was so hard, the residue remained. I was only able to choose about half of the veggies I normally would have done because of browned, graying, or wilted items. The bowls for selecting veggies and meat were so small, my husband joked they must have shrunk. I wasn't sure. But dinner is around $14 for a single bowl, and my husband could not get enough to eat. I was fine with my $14 single bowl, but it was far from a value. I didn't see much difference between dinner fare and lunch fare (perhaps the squid or white fish items on the meat bar?), although there is a jump in price. The cook did a decent job preparing our meals on the grill, except that the cubed potatoes in my bowl were actually still crunchy. The one high note was the very good waiter; he was a professional who apologized for things beyond his control and did what he could to make the meal a good experience.We also believe the food has declined in quality at Dublin O'Neil's. We've complained there after our last three meals, and have now decided not to return. Unfortunately, we have decided we won't be back to 301 Mongolia, either. It's too bad. We'd love to love new styles of restaurants in Urbana-Champaign. They are something this town desperately needs. Like most people, we can't afford to eat out as often as we used to. It's really disappointing when we spend our hard-earned dollars for a treat that isn't such a treat after all.",
                "reviewer_id": "Co9VOK72zpB_nSWrgaNkLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011290564056716963,
                    "positive_probability": 0.998870943594348
                },
                "stars": 2
            },
            {
                "review": "Make sure that you come with an appetite. My first bowl involved a variety of veggies and the hoisin sauce, delicious!!! My second bowl I decided to mix it up and add a scoop of the spicy peanut sauce which kicked up the spice. Another tasty bowl. Another addition is the bread - make sure you check this box on your order form as it is like naan or a tortilla. Either way, it is a must! One complaint is the time to get your food but like anything, so long as it is hot once it reaches my table, no harm no foul. I will definitely be returning here soon!!",
                "reviewer_id": "dfmolAcG5Wv1C1Eu5p3h9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05202592344687942,
                    "positive_probability": 0.9479740765531272
                },
                "stars": 4
            },
            {
                "review": "This is on the college side of town so it can get packed.  The trick is for those of us well past our college days is to come when the students are still in bed nursing their hangovers or at midday while they are stuck in class learning things which they'll almost never use.  At these times of day you practically have the restaurant to yourself.   As for the restaurant itself, the decor is modern and very spacious. So no jammed packed table seating here.  The wait staff is nice and somewhat tentative.   I've been to Mongolian type restaurants before so for the most part I knew what to expect.  When seated you will note a pad of paper which is where you select the type of rice you want, an option between egg or bread and if you want the option to have your meal served as a soup.  The wait staff will also provide you with two bowls, a large one for veggies and a smaller one for meats.   Don't worry, you can pile a good amount of meat in the bowl they provide.   Once you've made your selection on the pad of paper, tear it off and head over to the veggie counter and start loading up your bowl.   Don't be shy, it's okay to have a heaping mound.   Then circle around the corner and select your sauces/spices.  It is hear that experience does help out.  When you think you have added enough sauces, then add twice as much more, although be careful with the spicy ones as the spicy heat can flash up a few notches when cooked.   The veggie bowl is bigger not so much so it can hold more veggies, but so you can get the right amount of liquid which will help keep everything from drying out... especially the meat.   I would suggest you spoon in one or two of the thicker sauces (such has the chili paste), then spoon in one or two liquid sauces (such as soy) and then around three spoons of the flavored water (such as the garlic water).   Then proceed to loading up your meat bowl.  At the end of the counter you'll find a few spices, add on what you will, and don't be sparingly about it, as these are in powder form.  Most of it will burn off in the high heat.    At the end of the counter is a large flat surface.  This is where you leave your bowl and most importantly that little piece of paper you written on as that gives the cook last minute instructions when he sets up your meal on the large cooking surface.   Not to mention it also has your table number on it so they know where to deliver the final product.  Once you set down your bowl you can either watch the cook in action or go back to your seat.    Overall, my experience here was really good.  The bowl came to the table with the food well blended and hot.  It tasted really good, was not dry, burnt or underdone.  (mind you, I add a lot of the liquid sauces and flavored water... it does not come out soupy)  Their quality of food is really good and I must say, I enjoyed the boc-choy and water-chestnuts.  I'll certainly come back here again !",
                "reviewer_id": "dh1ZXGKbT3tRcDH1Tr-_cQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00011088591463646759,
                    "positive_probability": 0.9998891140853525
                },
                "stars": 4
            },
            {
                "review": "I really dislike flat top, so I was nervous about going here. It was way better than flat top. The ingredients were just fresher. The cook who stir fries the food was also very helpful when I didn't know which sauces to pick. I really enjoyed it here.",
                "reviewer_id": "DupeB3vvv7FY911lfhJJfw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08238473755317698,
                    "positive_probability": 0.9176152624468185
                },
                "stars": 4
            },
            {
                "review": "I ate there for lunch...first time diner. Our waitress was very nice and guided us through the process. I tried chicken the first time through and it was good. But the second trip I opted for noodles and shrimp which was delicious. The bread was tasty, although I'm sure unhealthy! I would suggest making small bowls and going back multiple times to try different things.",
                "reviewer_id": "e-QA3fpgVvOu2a4fBvN8Vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.17017969264784208,
                    "positive_probability": 0.8298203073521612
                },
                "stars": 3
            },
            {
                "review": "For $13 lunch or $17 dinner, you get unlimited bowls so I definitely suggest bringing your hungry selves over for lunch. The bowls look small but two Mongolian bowls will be enough to satisfy your famished stomachs. There's a wide variety of sauces and vegetables to choose from. The meat is limited to beef, chicken, sausage, and tofu. On some days, a seafood item will be available. Your food can possibly go wrong if you start mixing and matching sauces, but such is the price of food experimentation. The flat bread with the food is also really delicious.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20083095020439062,
                    "positive_probability": 0.7991690497956045
                },
                "stars": 4
            },
            {
                "review": "After my 2012 the restaurant closed for a while in 2014.  So we tried this place a few weeks ago and it's a total skip.Why.. Service and the quality of food.  When you're significantly pricier than your competition you should deliver a superior product and they didn't.Waited for someone to come ask for drinks etc for 15 mins and we just walked out.  Person workings response was oh well.  What a shame.",
                "reviewer_id": "fcOSikb8hNmO2AK8OtaRkA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5193702438411404,
                    "positive_probability": 0.48062975615885445
                },
                "stars": 2
            },
            {
                "review": "The food was bland and flavorless, I tried 2 different combinations - 1 with \"warrior sauce\" and peanut sauce, the other with coconut curry sauce, both were just terrible, like I might as well have not put any sauce on at all. The place is really over priced 13.99 for 1 small bowl of mediocre food, or 16.99 for all you can eat. They have a bunch of meat selections, but shrimp is extra - how is shrimp worth that much more than beef or fish? Every thing in my bowl was floppy and mushy in texture. They ran out of ice cream for fried ice cream, then we had to double check the receipt because they still charged us for it, so we had to flag down the 1 waitress they had there. I ordered diet Mt. Dew, and the waitress eventually brought me a refill of diet Pepsi which I sent back, even though when she asked, I stated diet Mt. Dew repeatedly. They play really loud dub step so I had to put up with that. All of the tables are so out in the open that it feels like you are on display. Not a good atmosphere if you just want to eat and talk to your date.  If I could give this place negative stars I would.On top of all of this I looked at my bank statement and they have yet to refund our money for the dessert. There are now 2 charges from them on our account!",
                "reviewer_id": "fyM3QJOHGwtF3M-R7JO8-g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5401799803440407,
                    "positive_probability": 0.459820019655971
                },
                "stars": 1
            },
            {
                "review": "This place was very disappointing. The floors were sticky, they didn't have enough cups to even serve water, there was no system for managing the dishes so we got skipped over, and ultimately this was the first restaurant where we got so fed up we paid for the drinks and left. Only reason it got two stars was the sake selection was tasty, the decor was nice, and the waiter was fine.",
                "reviewer_id": "htpYzb_VnPLzhgFO9mBp6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.18305799883001922,
                    "positive_probability": 0.81694200116999
                },
                "stars": 2
            },
            {
                "review": "I am giving this one star because YELP would not allow me to post zero starts. I refuse to darken the doorsteps of this place ever again. Where to start?I called to set up a surprise 40th birthday party for my husband utilizing their private dining area. Don't bother calling before 5 pm because apparently they don't answer the phone prior to that (tried on 3 different days) and forget about getting your voicemail messages responded to. When I got a real person, we set up the reservation and I explicitly told them it was to be a surprise party, when the guests would arrive and when the \"man of the hour\" would arrive. I called the day before the event to confirm. Not only did they confirm but had even made notes from the previous conversation. I felt confident this party would go swimmingly!The day of the party, I arrived with my unsuspecting husband in tow at the prearranged time. After waiting to be noticed by the host, I said \"we have a reservation for XYZ\" and winked at the attendant to prompt him that the guest of honor had arrived. And what did he say? \"Oh, your party is waiting back here....follow me.\" Thanks for ruining the surprise dimwit.On to the meal. There were 22 of us with one waitress. She did a very good job all things considered, but due to the number in our party everything took twice as long as it should have. Would have been nice to have one other person.My husband loves Mongolian BBQ so he knows the ropes...when his food arrived there was 2 pieces of shrimp in his bowl. My husband DETESTS seafood of any kind. I took the shrimp, no harm no foul. But I did consider the following: what if he had an allergy to shellfish? Or what if he couldn't eat shellfish for religious reasons? Better precautions are NECESSARY.As I said, he LOVES Mongolian BBQ and went back for a second round. His food arrived from the grill and what was in his bowl? Yes, shrimp! How does this happen TWICE???? This is sloppy work....and potentially dangerous to the wrong person.Due to the prevalence of kitchen/waitstaff retaliation, one can not speak up for bad service nowadays...but I will never be seen at 301 Mongolian again.",
                "reviewer_id": "ij2g-5Mgth6W7EvCyoSdPA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9584342794642626,
                    "positive_probability": 0.041565720535731265
                },
                "stars": 1
            },
            {
                "review": "If you get the CI Saves offer ($15 for $30) this place is an excellent value.  The raw bar has an appropriate variety of vegetables, proteins, and sauces. I've been there several times (weeknight) and it is rarely busy. That being said, I don't think they have enough business to turn around their liquor. On a few occasions the wine I've had seems to have been oxidized from being open too long, also they were still featuring Sam Adams Octoberfest on draft as of January 2015. It's definitely worth trying out.",
                "reviewer_id": "jfnxH8u5ksFVLoZlyzIkEA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09156051947809647,
                    "positive_probability": 0.9084394805219066
                },
                "stars": 4
            },
            {
                "review": "When I lived in Bloomington, I LOVED Flat Top!  I haven't really enjoyed the Flat Top in Champaign during my visits and decided to try 301 Mongolia.  Love it!  I really enjoy their salmon and crab when it's available.  We've always had great service which is a huge plus!  If you're new to the place, try it at lunch when it's cheaper.",
                "reviewer_id": "JgHGyWS2emyHq6aq144SLQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14724533277689578,
                    "positive_probability": 0.8527546672231053
                },
                "stars": 4
            },
            {
                "review": "Went for the first time last night, a Saturday. We made a reservation which was good because it was busy. I really enjoyed the food. For me personally the selection was great; all my favorites were there. I also liked the sauce selection. However, the service was not so good. I don't think it was our waitress, it was that they didn't have enough wait staff. Our waitress seemed to have a huge number of tables to serve. We tried to get another round of drinks for over 20 minutes. By then we were so close to finished we just asked for our check. I felt like the price was reasonable. Someone with me got unlimited (1 bowl was plenty for me), got a 2nd bowl for $2 more then paid $2 for a to go box but got a huge amt to go for $4. I'll be doing that next time as I do plan to go back. I appreciated that they had a drink special that was very reasonable, just would have liked a 2nd one.",
                "reviewer_id": "L6c0kmTHV5cQhDHHFZJb7w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16017802813847565,
                    "positive_probability": 0.839821971861518
                },
                "stars": 3
            },
            {
                "review": "The food is amazing, best stir fry around, peanut sauce is amazing, good quality meats and veggies.The service however, ehh. Went in at evening got seated and nobody came to even say hi I'll be with you shortly as we sat there for 12 mins to which I asked for a manager and he got us our food promptly and even gave us a free dessert. He handled it well and professionally",
                "reviewer_id": "LBLCmg2aYjwrlBAwHZ-jlg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.10096194379220512,
                    "positive_probability": 0.8990380562077933
                },
                "stars": 3
            },
            {
                "review": "First: the good.  301 Mongolia has a cool atmosphere, great selection of ingredients for their bowls, and excellent cocktails.Now: the bad.  The sauces just weren't very flavorful.  My husband had to go back to the buffet several times to get more sauce just to try and get some flavor!  The roti bread was only ok...  Finally, we both got bits of food that were not in our bowl, not cool!  If I want Asian grill... I'll probably just go to Flat Top.",
                "reviewer_id": "OrbBDfge09DzIospdw2Xgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025461359411158246,
                    "positive_probability": 0.9745386405888407
                },
                "stars": 2
            },
            {
                "review": "HORRIBLE service!  We went there right after the Pride parade and there were only 2 waiters for the whole restaurant. We sat outside and apparently were forgotten for 2 hours.  Both my partner and I had to go inside at least 7 or 8 times to get someone's attention. We waited 45 minutes for our first dish.  We had refill bowls so we wanted to try other combinations and it was another 45 minutes wait for the second serving.  Worse yet, then the manager offered nothing but excuses for poor management and poor planning. He made no offer whatsoever to compensate us or to rectify the horrible experience. This place is a big ZERO compared to most restaurants in big cities where customer service actually matters. A small town restaurant with a small mind mentality. We will never return, and we will be telling visitors to Champaign to go elsewhere. Shame on the manager for under-staffing on the day of a parade and for neglecting his customers. This place needs better management training!",
                "reviewer_id": "QrSwXWvOC9OmYB_zXYmrvg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5318365281991753,
                    "positive_probability": 0.4681634718008153
                },
                "stars": 1
            },
            {
                "review": "So when it comes to stir-fry in Urbana-Champaign it was always flattop grill. Now flattop grill is no longer the monopoly in town and 301 Mongolia are its number 1 rivals. I went to 301 Mongolia last weekend and I have to say it is my new number 1 stir-fry place in town. The meat are much more fresh,less frozen and there is better variety in comparison to flattop. The sauces are much more interesting and fresh since they are homemade and you get a deeper bowl which is much less messier :) Now, I know the dinner price might be a bit too much since it is 20 dollars but a fair argument is that it is unlimited amount of food that you can eat :) the restaurant ambience is very nice too. I'm giving this place 4 stars because of the little pricy dinner bowl. Other than that,im definitely going again some time soon!",
                "reviewer_id": "RtNqrjRRrIuEWqbu4U-VEQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004041405168383932,
                    "positive_probability": 0.9959585948316176
                },
                "stars": 4
            },
            {
                "review": "We had the crab-pineapple dip with wontons for an appetizer. Crab and pineapple in a tasteless white goo, really a bad idea. We really did not want to put together our idea of a bowl of food, but that's the way it works. The beef in our dish had several pieces of gristle, and the rest of the dish was a bit overcooked for my taste. We did try several of the sauces but none did anything worthy of mention. The chocolate-filled wantons with a whipped cream side were very good, and my extra-dirty traditional gin martini was very cold and surprisingly good. Service is friendly but untrained. Several times our server should have seen we needed extra plates or silverware, but she was oblivious. We were sadly disappointed.",
                "reviewer_id": "RYPnL1Me-qmd7415YiUuNw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9970747759989529,
                    "positive_probability": 0.0029252240010489935
                },
                "stars": 2
            },
            {
                "review": "I went here for Lunch not too long ago, and I was impressed.  They have a better layout than Flat-Top, but otherwise It's very similar.  Would definitely go there again",
                "reviewer_id": "TiSrb2z0UmsF-Vw91cEVDg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6927743149658816,
                    "positive_probability": 0.3072256850341197
                },
                "stars": 5
            },
            {
                "review": "You can't be disappointed by this place. Not only are the staff helpful and kind, but they also are patient while explaining the idea of the restaurant to you.You also get to literally pick out what you'll eat, along with, if you want, being able to stand and watch your food be cooked.The idea is that you pick out a rice you want, along with either bread or an egg. This will come into your bowl later. Then, your server gives you two bowls - one for veggies, spices, sauces, and fruits, and the other for proteins and meats like calamari, chicken, beef, or even fish. Then you pick out what you want at a buffet style set up in front of a huge grill, where the food you picked out will be stir fried along with the rice you chose.Prices are reasonable, with it only costing about 70 bucks to feed 4 people a meal large enough for a huge dinner, and then some leftovers you can take home.Overall, I highly recommend this place if you're in the mood for an interesting place, with a great atmosphere and even better food, which all combines for one of the best eating experiences I've ever had.And if you're lucky, you could catch live music outside on the patio.",
                "reviewer_id": "Tk6hQC9NZEUY5U7AqTKHDg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001688416445787143,
                    "positive_probability": 0.998311583554207
                },
                "stars": 5
            },
            {
                "review": "This is one of those places that if people want to go have dinner/lunch there I will go with them but it is not a place I will suggest. The food is good but its mainly create your own stir-fry so if it is not good then you didn't put the right food in your bowl. The small plates are good but nothing is spectacular. I find the prices to be decent for what you get. The quality of the stir-fry ingredients is very good and you can tell they keep an eye on it. Good place if you like stir-fry, but definitely get the bread!",
                "reviewer_id": "vgx_L9BBd8DSSGidBJ6GUQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09668302233299962,
                    "positive_probability": 0.9033169776670026
                },
                "stars": 3
            },
            {
                "review": "UPS: reasonable price for a potentially HUGE portion, awesome location, busy and fun with friendly waitstaff and cooks, cheap drinks for downtown, GREAT quality ingredients and they 'use local farmers when possible' which I love, love, love. Oh, and you get to watch the food being cooked!DOWNS: Red lights make my eyes bug out...and um yup that's about it.Other things:Don't order an appetizer unless you can eat a LOT of food.The wonton appetizer is flavorless - I squeezed lime and added salt and pepper to the dip and it was much tastier.",
                "reviewer_id": "wtsl05RJj5f6YBDQPEwP2w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6270133937595853,
                    "positive_probability": 0.37298660624040497
                },
                "stars": 4
            },
            {
                "review": "Good food, nice quality and variety of ingredients, love the sauce choices. Also, we went on a Monday and all beers were $1 OFF. Not sure if this is a normal Monday thing, but I like it!Hats off to the owner - there was a mishap and my food was messed up, but the owner and chef were both very apologetic, had my *new and correct* bowl cooked up as soon as I was done re-making it, and took half the price off of the meal for me. Glad they made up for the mistake.",
                "reviewer_id": "x7Qec9s8yGSqh1E2wLDwMQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.034865250766770065,
                    "positive_probability": 0.9651347492332334
                },
                "stars": 4
            },
            {
                "review": "Had a wonderful bowl at lunch today that blew me away.  The key seemed to be the additional Siracha added to my bowl.  That flavor was amazing.Try your bowl with some siracha next time!",
                "reviewer_id": "xZhXEZnxK9eJ-gMzAn5GRg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12367543987659567,
                    "positive_probability": 0.8763245601234027
                },
                "stars": 5
            },
            {
                "review": "This place has delicious food and great service. You choose your meat, vegetables, and sauce and they grill it up for you and will add eggs and bread (which is so good) if you like. I have been to other Mongolian restaurants and they had super greasy food, but this places Food is delicious and fresh. Be prepared to pay for it though! Their prices are high.",
                "reviewer_id": "z3mdu0mmmpGKkxhKDc0mWw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008328513864951446,
                    "positive_probability": 0.9916714861350471
                },
                "stars": 5
            },
            {
                "review": "It's always fun to try a new spot and when you can have unlimited bowls for Stir Fry for 9.95, it's even more fun!We were also happy to be welcomed here because at the brewery down the street there was a 20 to 25 minute wait when half the tables were empty.  I never quite get that concept but hey, nice to walk on down  the street to where you are welcome.If you check in on Yelp, you get a free app of steamed Endamame which while we didn't really like them, was still a nice gesture.  My first bowl had a brown motif - beef, brown rice, teriyaki sauce and bunches of veggies.  I liked it a lot but you know those baby corn that were so hilarious in the movie Big?  Really I didn't need more than two!  I decided to not finish that bowl so I could have a yellow themed masterpiece - chicken, pineapple, pork, orange ginger sauce plus pineapple sweet sour sauces with lots of onions/green peppers.  Also a masterpiece but I couldn't finish it all.  If I lived close, I would have done the deal where you get to bring home a bowl for like 4 bucks.Nice server, good bathrooms and a wonderful time visiting with my daughter and son in law after yet another crushing Illini defeat.  Eating here couldn't make up for that boo boo but it sure is a nice alternative to the snotty attitude at Destihled.  Nice job, 301 Mongolia but tell me the truth, do people really eat that steamed endamame?",
                "reviewer_id": "zfuJwHFip_KoJlb9SR-g4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15335725060923158,
                    "positive_probability": 0.8466427493907778
                },
                "stars": 4
            }
        ],
        "similar_restaurants": [
            "fYE54FZCIFYYdFs-AkqRuw",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "ivZo1goh7HXdep03NfA7Cg",
            "UrxAu3jjRM_u6iQXDPzkSQ",
            "wGp0fgsmqCL8ovLwQrlSKw",
            "oP8KsXHOUA_otHHI5JHScQ",
            "6UftUvNBqANqybf8wpWeNA",
            "cT9uP_Lr5bz6jhIqZPlLcw",
            "-1oj6-fkP-iO6OyW8QBqPg",
            "rE8048_DAh3Z8Tep466wrA"
        ]
    }
}