{
    "rzH3NU9teI9WVKt-hBsJjg": {
        "keywords": {
            "bigrams": [
                "chinese_food",
                "crispy_tofu",
                "golden_harbor",
                "best_chinese",
                "authentic_chinese",
                "chinese_restaurant",
                "fried_rice",
                "chinese_menu",
                "salt_pepper",
                "family_style"
            ],
            "unigrams": [
                "food",
                "chinese",
                "menu",
                "place",
                "good",
                "tofu",
                "order",
                "dishes",
                "crispy",
                "restaurant"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": true,
                "Delivery": false,
                "Dogs Allowed": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": false
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": true,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 2,
                "Take-out": true,
                "Takes Reservations": true,
                "Waiter Service": false,
                "Wheelchair Accessible": true,
                "Wi-Fi": "no"
            },
            "business_id": "rzH3NU9teI9WVKt-hBsJjg",
            "categories": [
                "Taiwanese",
                "Chinese",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "505 S Neil St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "21:00",
                    "open": "16:30"
                },
                "Saturday": {
                    "close": "21:00",
                    "open": "16:30"
                },
                "Sunday": {
                    "close": "20:30",
                    "open": "16:30"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "16:30"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "16:30"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "16:30"
                }
            },
            "latitude": 40.1111456,
            "longitude": -88.2441689,
            "name": "Golden Harbor Authentic Chinese Cuisine",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media3.fl.yelpcdn.com/bphoto/tXD8Pjz7we1m1AJAT6Pjmg/ms.jpg",
            "review_count": 228,
            "stars": 4.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "Actually *authentic* Chinese food. The dishes we ordered weren't very good. Everyone says this is the best place to get Chinese food, and it look like they are right. ",
        "reviews": [
            {
                "review": "Not very fond of this place. I think Lai-Lai does a much better job with lower prices. I went with a Taiwanese friend on a Sunday afternoon. It was very crowded, noisy, with a confusing ordering process. It felt like a high school cafeteria with Chinese food that cost a lot. The dishes we ordered weren't very good. I had my Taiwanese friend make the choices and he didn't think much of what was served. All in all, a disappointing experience. There are lots of Chinese restaurants in C-U and some of them are good! Try them...",
                "reviewer_id": "-FqXwGg8isV0ap9U1q7p6g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.39340565621806856,
                    "positive_probability": 0.6065943437819326
                },
                "stars": 1
            },
            {
                "review": "I don't like to write reviews, but have to recommend this place. The food here is awesome. Will definitely come back again.",
                "reviewer_id": "-mh2sQvb1JncScrc2qhUXQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.584385206436943,
                    "positive_probability": 0.41561479356305653
                },
                "stars": 5
            },
            {
                "review": "Hello Urbana-Champaign!  It's nice to see you again, although a lot sooner than I had anticipated.  This was a glorified road trip pit stop for my family, and it was everything it promised to be -- efficient and delicious.Golden Harbor pretty much took the most hated part of Chinese food -- the service -- and put it upon the diner.  They do charge a very small \"seating fee\" (I think it's $1 a person), and for that they bring you all your dishes and clear the table, but you're responsible for ordering at the counter and bringing your own pots of tea to the table, along with any other beverages.  Fine by me, I love not chasing down servers for glasses of water.Since my parents are Chinese, we ordered off the wall and got the following:809 (I think), Crispy Tofu - So, so good.  I thought that sauce would be overwhelming but it was the perfect complement, not too sweet but also not too salty.  Do order this when you're with a larger group as I can imagine this isn't very good as leftovers.745, Sea Cucumber with Beef Tendon - This is an uber Chinese dish but I loved the fatty beef tendons (sounds grosser than it tastes). 561, Sliced Lamb with Ginger and Scallion - I think lamb is the new pork.  Gamey, but still tender. We also ordered a beef with flat noodle dish (in Chinese:  gan chao niu he) that is not on the menu, but they whipped it up anyways.I would recommend going through the website menu first before going there so that you're not overwhelmed with the range of choices.",
                "reviewer_id": "-o4h6R65vlJaTBrfxOEYCA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6540376444437735,
                    "positive_probability": 0.34596235555624083
                },
                "stars": 5
            },
            {
                "review": "This place is amazing.  If you don't know what to order, ask the woman at the counter, she is super friendly and helpful.  Forget all the lower reviews that complaining about busing your own table, getting your own silverware, drinks, etc.  The food is amazing and authentic.  Don't order off the American Chinese menu!  Pick a meat/vegetable and a description that sounds good.  If you want to know the difference ask.  Come early or late for a better chance of a table.  Some of our favorites include:  Steam Pork Buns, Crispy Tofu(not good leftover), Spicy Eggplant, Salt and Pepper Anything(though ask for light on salt),  BBQ Duck or Spicy Duck, and their soups, one was a spicy pork with wide noodles, really good and huge.",
                "reviewer_id": "-swXonAzCYdZMpkDo0i_FA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22002419864160921,
                    "positive_probability": 0.7799758013583923
                },
                "stars": 5
            },
            {
                "review": "If you want REAL, AUTHENTIC asian food, this is the place you want to go. On the wall, you'll find their entire menu in chinese - I love the character it brings to their space! They offer an english paper menu as well - and more \"americanized\" asian dishes. We went for an early dinner and did not have to wait for a table. We ordered our entrees and they were brought to us very quickly. Great portion sizes and *amazing* taste. Additionally, the staff were very nice and attentive, and we were in and out in no time at all! This is one place that I would bring my asian grandparents to in a heartbeat. They offer tripe, duck, and a wide variety of other dishes that make many feel right at home!",
                "reviewer_id": "-yYFnBCAVc3mgFt7m3syTw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0008196612580463442,
                    "positive_probability": 0.9991803387419609
                },
                "stars": 5
            },
            {
                "review": "I love eating at Golden Harbor! The owners of this place used to own Mandarin Wok and Cravings. They have also owned restaurants in Taiwan as well, so I always come here when I need a taste of home. When I first walked in, I was overwhelmed by the extensive Chinese menu that is plastered on the wall. There are so many dishes to choose from. There is also an English menu as well. The entrees are pretty pricey, but you get a large portion. I recommend bringing friends to split the bill so you can try more dishes!Things to try:-crispy tofu-sacha lamb-three cup chicken-hou fun-taiwanese pork soup (forgot the actual name)Overall, great authentic Taiwanese food! A must try!",
                "reviewer_id": "04-E5-69Se-vW8heDXI_gA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00043694959625219026,
                    "positive_probability": 0.9995630504037459
                },
                "stars": 4
            },
            {
                "review": "Great food, but long line.We waited for about an hour. However, they are delicious and fresh. Not so sweet.",
                "reviewer_id": "23_X-_T1sGU54pXr4iIEag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.34907466890475214,
                    "positive_probability": 0.6509253310952474
                },
                "stars": 4
            },
            {
                "review": "Golden Harbor is good, but expensive. By no means does it make it over-priced. It's probably the best choice for authentic/good Chinese food in the middle of the cornfields.This place is great for Chambana, but there are better places out there that are too far.",
                "reviewer_id": "2eICeRlxg8Mb51cTnw4r0A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16957410332409634,
                    "positive_probability": 0.8304258966759019
                },
                "stars": 4
            },
            {
                "review": "The food here is spot on authentic. It has been busy everytime I have been here, adn everythign I have tried has been delicious!",
                "reviewer_id": "2fJBtUVqTrSZdczLBlOoJQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25238721725453195,
                    "positive_probability": 0.7476127827454683
                },
                "stars": 5
            },
            {
                "review": "A bit pricey for not fancy Chinese food, but as a very Chinesey person I definitely found it to be authentic and enjoyable. The portions are decent and the dishes are very flavorful. The clients were a good mix of Chinese students and everyone else, so I suppose they have something enjoyable for all.The \"xiaolongbao\" soup dumplings were somehow worse than what you can buy pre-packaged in supermarkets... Don't order it!! But I did enjoy the hot boiled fish and cumin lamb.You do have to pay for everything at the counter when you order tho, which makes it seem more like counter service food rather than an actual restaurant. The good news about this is that you don't need to tip anymore as it's all included.",
                "reviewer_id": "2jNfhVFUtqB9lFTT8Jr0Kw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015636410773585158,
                    "positive_probability": 0.9843635892264122
                },
                "stars": 4
            },
            {
                "review": "Service: 1 StarAmbiance: 1 StarFood: 5 StarsYou will not find better Chinese food in C-U or perhaps all of Illinois.",
                "reviewer_id": "3Dwx4NpsopuZHbYA4kl75g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.48628450366828074,
                    "positive_probability": 0.5137154963317203
                },
                "stars": 4
            },
            {
                "review": "I had a great experience at Golden Harbor. I would recommend going with a group of people because the entrees are rather large. We ordered 6 entrees for 8 people, but I think we could have finished a 7th entree if we had it.My favorite things that we ordered were the fried basil chicken, the crispy tofu, and the pork buns. The basil chicken was nicely spicy and the texture of the breaded meat was wonderful. The crispy tofu was in a sweet sort of sauce that I really enjoyed. We assembled the pork buns ourselves because they were served as a plate of meat, a container of buns, and a plate of garnishes (crushed peanuts, some sort of veggies, and cilantro). The menu is very extensive, so be prepared to spend some time looking through it (though you really can't go wrong with the basil chicken or crispy tofu!) When you arrive at the restaurant, you take a table number, menu, and ordering slip to a table of your choice. Then after you decide what you want, you bring your order slip up to the counter and pay. It works best for a group if everyone brings cash to split the cost because I'm not sure that they allow separate checks from one table. Then someone will bring your food to your table. Tea is free, and you can simply serve yourself. At the end of your meal you clear your own dishes, or else pay a few dollars to have them bus your table for you.",
                "reviewer_id": "3DXQC2JALx0UQhpzSPMi6g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.093852656662992e-06,
                    "positive_probability": 0.99999790614735
                },
                "stars": 5
            },
            {
                "review": "Best Chinese Restaurant around the Champaign-Urbana area. As a Chinese I am picky about the taste of dishes, and Golden Harbor just can satisfy our tongues and stomachs. If they can have better decorations it would be even greater.Recommendations: Taiwan Guai Bao, Fuzhu Niunan Bao, XO Baby Squids, etc. The fishes are also good. (Pity that I cannot type the Chinese names for these dishes, that would be of great help for Chinese gourmets like me!)",
                "reviewer_id": "3HpveVwR-6DWCdSuzzy6Kw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12965927413787803,
                    "positive_probability": 0.8703407258621226
                },
                "stars": 5
            },
            {
                "review": "Golden Harbor Authentic Chinese Cuisine sounds like the type of place where the cuisine is not even near authentic but the name could not be more truthful. This is a real, authentic, delicious Chinese restaurant. The fried tofu and eggplant dishes are simply exceptional. The selection is enormous, as are the portions, and the prices fit the amount of food one gets well. Therefore, I would recommend sharing one dish for two people, even when hungry. I would take a minute to adjust to the way that ordering the food is done, not customary in the US, as well as taking some time to look at the all-encompassing menu; no tipping here too!",
                "reviewer_id": "3NU4UJWlsVIl6kSYouaFxA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014182725086184596,
                    "positive_probability": 0.9858172749138152
                },
                "stars": 5
            },
            {
                "review": "Just like many of these reviews echo, Golden Harbor is an awesome place to get Chinese food. It is on the pricier side running about $10-15 per person if you go family style, but it's definitely worth it. They are the old owners of Mandarin Wok and the restaurant that was in Mahomet. They cater to all different styles of Chinese food.PROs- They have a thoroughly comprehensive menu. Whatever you can think of in terms of Chinese food, they can make it.- The lady behind the counter is AWESOME at catering to what you want. If you describe it in half mandarin / half English or even pure English, she can tell you what you're looking for. If you're looking for a suggestion of what to eat, she can list off a bunch of dishes and ask you if you like it spicy / non-spicy or a certain style.CONs- You have to clean up your own dishes. It's a place where they are so busy they just don't have time to do it. If you don't enjoy doing this aspect of it, there are lots of other places around town that will do it for you.- The wait can be a long time. If you go during peak hours which is basically the major meal times on weekends, you can expect to wait from 30 minutes to an hour just to order your food and then an additional half hour to get your food. They only have a couple of chefs so it takes awhile to get your food, but it's usually delicious.- Again, you're going to pay $$ for it and you're not going to fill up completely until you spend about $10-15 per person.- The atmosphere is noisy so it's not exactly a great place to go for a quiet date.I typically order:- Crispy Tofu - a soft tofu on the inside but crunchy on the outside that comes with a garlic sauce and green onions on top.- The fish fillets with garlic sauce - just as it's described, most people that like seafood like this.- Three cups Chicken - if you ask for it extra spicy and like spicy stuff, people generally like it.The food quality goes beyond any measure of any local Chinese restaurant in the Champaign-Urbana area making this place WELL worth it if you're looking for chinese food in the area.",
                "reviewer_id": "3tqlK4acUbM5Kgnk1h5DRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.869983851965591e-08,
                    "positive_probability": 0.9999999613001652
                },
                "stars": 5
            },
            {
                "review": "This place is amazing!  They have a chinese menu on the wall, and an english version book menu!  I mean BOOK!  its so extensive i didn't think there was anyway  that much food could be in one place!  lol  I cant remember what i ordered, but it was really good, chicken with chiles maybe? There doesn't seem to be anything sweet on the menu :-(  Its pricey, but a total experience worth having!  I thought i was back in China town in NYC!  Loved it, you gotta go, but be prepared to spend 30 mins looking at the menu before you get in line to order your food.  Get your own beverage passed the cashier, and find a seat.  They have Extra large tables like in real chinese restaurants, with a lazy susan in the middle to share.  Sharing is the cornerstone of chinese eating, love that!",
                "reviewer_id": "44PEBOp6UwYrgiQzCFetTA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15045231668459785,
                    "positive_probability": 0.8495476833154038
                },
                "stars": 4
            },
            {
                "review": "this is the best Chinese food I've ever had.  The Crispy Tofu was outstanding and seasoned very nicely. Since I will probably never visit here again, I also ordered a small portion of the Taiwanese Salt and Pepper Chicken. It wasn't as good as the tofu, but certainly flavorful. I was already full from the large portion of tofu, so that may have affected my judgement.  The staff was very pleasant and helped me order even though I didn't follow the simple directions posted at the door.  If this is authentic Chinese food, I am a big fan!The Jasmine tea was free and lovely. The amount of food for $20 could have fed two hungry adults.UPDATE: After dinner I got very sick to my stomach...  I'm not sure if it was MSG or something else in the food.  Although the crispy tofu tasted very good, I'm downgrading to four stars based on the lasting after effects and the mediocre Salt and Pepper Chicken.",
                "reviewer_id": "4nb7RcF15RZQwm13OxrACQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.877752237584204e-06,
                    "positive_probability": 0.999994122247766
                },
                "stars": 4
            },
            {
                "review": "My teenage son (who eats nothing green) loves this place because they will happily leave off green onion from his General Tso's, which is screamingly delicious without it.  I appreciate the Chinese vegetable dishes, the Chinese okra and eggplant is amazing, spicy and light.  I also love the Crispy Tofu or the Crispy Eggplant, perfectly fried and spiced, served with a delicious sauce and herbal garnish.  I've tried many of the dishes, especially those in the chicken domain, and have never had a bad dish.  I come back to my favorites over and over again.  The freshness of the vegetables and each dish could not be better.Sophie, who takes orders, is friendly and smart, with an amazing memory.  She always starts typing in our order the minute she sees us.  I like being known as a \"regular\" and the overall zeitgeist of this place is just buzzing and fun.  Our orders are always perfect.",
                "reviewer_id": "4qm3IG8VAZ57YdxwyHaTZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.1673478799985428e-06,
                    "positive_probability": 0.9999988326521103
                },
                "stars": 5
            },
            {
                "review": "Between here and Lai Lai, Champaign has some very good Chinese choices on campus. Not to say that the other local choices aren't good as well but these two restaurants serve some of the more classy authentic Chinese dishes that you wouldn't expect other restaurants to serve. Fortunately for the students, these restaurants cook well enough that there is no immediate need to run to Chinatown to enjoy good Chinese cooking. Don't miss the tea smoked chicken here. Although it's not as friendly to non-Chinese and usually very busy, don't let that deter you from visiting this gem.",
                "reviewer_id": "5BNI8ukGTlwUI2CCeyjZOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.223784220971018e-05,
                    "positive_probability": 0.9999277621577823
                },
                "stars": 5
            },
            {
                "review": "Wonderful food. Amazing flavor! So much fresh!!!",
                "reviewer_id": "5RrSV_EVvG57M-5kKax93Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.49109263657957236,
                    "positive_probability": 0.5089073634204274
                },
                "stars": 4
            },
            {
                "review": "Absolutely delicious food. Actually *authentic* Chinese food. I love their steamed Chinese broccoli. My favorite dish is their Crispy Tofu with green onion in a sweet chilli sauce.Note about venue: Golden Harbor is not the right place to go if you're wanting a classy and quiet atmosphere (for a dinner date, business lunch, ect). The dining section is dirty, the furniture is cheap, the lighting is not flattering, and it gets pretty loud during rush hours.",
                "reviewer_id": "6Gy2xDPe01rbFOqeVAc-tA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023543181214728398,
                    "positive_probability": 0.9764568187852671
                },
                "stars": 5
            },
            {
                "review": "KISS, keep it simple students. So simple, but oh so yummy.  Was sad when Pickles closed, but after too many years I finally tried what took its place.  Followed yelp reviews and had crispy tofu and pork fried rice. Great serving size and both very simple but good. Not super bang for buck but very fair prices. More people with more dishes to share seem to be the way to go.  Also bring cash to save 5%.",
                "reviewer_id": "6lLTQ5Vl5983Di-8sa-IsA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08734120620494354,
                    "positive_probability": 0.9126587937950598
                },
                "stars": 5
            },
            {
                "review": "While Golden Harbor lacks the atmosphere and service of many \"fine dining\" restaurants in town, it compensates with over 100 different dishes brimming in flavorful sauces and expertly prepared meats, vegetables, and other Chinese specialties.  The restaurant serves everything from popularized American dishes (e.g., General Tso's chicken, fried rice) to more \"exotic,\" authentic cuisine (e.g., frog legs, \"stinky\" tofu).Of the items I've tried so far, I've really enjoyed the (legendary) crispy tofu and crispy beef in pepper sauce.  The dumplings were a little disappointing as they seemed like a standard pre-made frozen product rather than something made in-store (though honestly, I think most Asian places in town serve pre-made dumplings).  Unfortunately, they also seem to run out of leafy vegetables fairly often, so consider yourself lucky if you have the opportunity to sample the traditional Chinese vegetables. The woman who usually works the register speaks English very well and can be helpful if you are overwhelmed by the menu options.  Even though the menu is translated into English, the names of dishes are not always very descriptive (\"What's the difference between spicy chicken and chicken in hot sauce?\"), so you can just ask her for advice.For vegetarians, there is a clearly marked section of veg-friendly dishes on the back of the English menu.  This guarantees that your Chinese dinner will be free of chicken broth or other cleverly-masked animal products.  However, given the limited number of items listed in this section, I would also encourage vegetarians to browse the rest of the menu.  For whatever reason, there are veg-friendly dishes (marked with a cute cabbage icon) in the regular menu that are not included in the vegetarian section.The only disadvantage of Golden Harbor is that it does not yet offer a take-out or online version of their menu.  While they still allow customers to pick up food to go, you will probably have to place your order in-person at the restaurant, or already know what you want if you plan to call in advance.",
                "reviewer_id": "6nqakbu2zU6fjOmbE83_-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 4.87323105366922e-06,
                    "positive_probability": 0.9999951267689111
                },
                "stars": 5
            },
            {
                "review": "My husband and I decided to give them a shot based on the reviews here.  We had a difference of opinion.  The food was very authentic and was very good.  The decor was piss poor and left a lot to be desired.  I go for the complete experience and he prefers to focus on the food.The food was very good.  The service was also very good.  However, it was confusing when you come in because no one helped us and we stood there for a moment before we figured out what to do.  You have to ask for an English menu. They have WAY to many tables crammed into the room.  You have no room to move around.Although, they do have large family tables with the rotating lazy Susan in the center for 10 to 15 people.  The problem is that they have too many of those tables.All in all, I think we will give them another try.",
                "reviewer_id": "6oAKlPjZypU_mWF1AJl_Pw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9876005765346482,
                    "positive_probability": 0.012399423465347458
                },
                "stars": 3
            },
            {
                "review": "The menu is too extensive hence very overwhelming.   But my favorite is the crispy tofu.",
                "reviewer_id": "7-ElFGYAY3RvclygpsixzA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35848242652185386,
                    "positive_probability": 0.6415175734781469
                },
                "stars": 3
            },
            {
                "review": "Some lame person flagged my review and it got pulled. Take 2. Don't let the \"authentic Chinese\" in the title fool you. The standout food at Golden Harbor is authentic, homestyle Taiwanese dishes. Also for those who are interested, this is the rough history of the owners' time in the area:(Pre-2000 - 2004)  Mandarin Wok(2005 - ? )               Cravings (Drastically different from its current state)(? - early 2010)       The Wok in Mahomet(Mid-2010 -     )       Golden HarborI'm in the area approximately once an year and this is on my must-try list (along with Jarling's Custard Cup). I left the area in 2005 and the owner still recognizes me... Ask all the alumni that have passed through the doors of the original Mandarin Wok and they'll tell you in all of their worldly travels, they haven't found a crispy tofu as good as the one here. Go easy on the service and ambience - the food is worth it.A friend made reservations for me since it sometimes gets busy. You get a table # and look for your table # on arrival and use it to place your order. With each order, you get a big bowl of rice (based on the number of diners), plates, fortune cookies, and chopsticks. I think the prices may have gone up over the years, but I guess certain items are harder to come by in Champaign. The overwhelming Chinese menu on the wall is supposedly fully translated into English (look for the menus on the lefthand side). I'm not sure how complete the translated menu is. And for those who prefer Chinese-American takeout food, I believe those items are still available. You don't have to tip because you're expected to clean up your own table.My order:809 Crispy tofu (let me know if you figure out the recipe to the sauce)204 Spicy basil chicken balls876 Chinese cabbage (gotta have some veggies!)2000 Chicken rolls",
                "reviewer_id": "7a5tgR4lbdAefJIbCmSuUg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.029900464847057214,
                    "positive_probability": 0.9700995351529609
                },
                "stars": 5
            },
            {
                "review": "Love it! I love the Basil Chicken!",
                "reviewer_id": "7DeiAJPPP5T5sNh4YG1etw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4537511308831431,
                    "positive_probability": 0.5462488691168568
                },
                "stars": 4
            },
            {
                "review": "I felt it was time to update my review since they changed a lot since my last review.  Don't worry though, everything they did was for the better, and the place is still as good as ever.  I will note the things that have changed though.  They have new menus now, since the old ones were all scribbled on, torn, falling apart.  The Mandarin menu is still up on the wall, but they now have a beautifully done full menu in English (feels like a textbook almost!) that contains all the dishes in English.  My favorite though is that they also now offer a smaller, \"Americanized\" menu, with the stuff Non-Asian ethnicities are likely to expect at a restuarant.  Even this though is still 100s of choices.  Second, you now have to pay a table cleaning fee.  Before, you were expected to clear your table (just remove all dishes and trash to bins located all around the restaurant) but I guess too many people were just leaving their dishes and no tips either.  Hell, I often would leave tips even when we cleaned off our tables because the staff is always so nice.  But yea, it's like 50 cents I think per person, and they now clean your table off at the end, so it's actually very reasonable.  Still no tips expected, you just pay the fee on your bill.   We still clean our table off for courtesy, but you don't have to.  You also get your table number after your order now.  Also, lot's of people will stand up front and look through their menus, but we always just take them back to our table first and look while also grabbing a table we want.  :D  All and all, the food is still amazing, and I've never had a bad dish here.  I'm definitely starting to get to the point though where I have found so many excellent choices that are so superbly good, I just stick to them.  As always, the staff is super friendly and courteous too.  The front counter lady, I believe her name is Tina, is one of the nicest people I know.  Seriously, she puts a smile on my face, and I just want to give her a big hug.  She treats everyone like family, and it makes me so happy to know there are people still like that out in the world when there is also so much bad going on.All and all, this place is still top notch, and do yourself a favor and check it out if you haven't already. Pro Tip:  Go with a large party and share your platters.  Even the small size meals are enough to feed two people heartily.  It's a ton of fun though to just have everyone order different stuff, and pick a little bit of everything!",
                "reviewer_id": "7JQ8n15WeW4D5AnNulQOCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.1425791562936956e-06,
                    "positive_probability": 0.9999988574208385
                },
                "stars": 5
            },
            {
                "review": "I was a bit apprehensive after seeing their 200+ menu items. Usually a place that serves so many dishes does a sub par job on all of them but that was not the case here. Went with a party of 6 and ordered enough food to feed a small army. We actually ordered so much food... i can't even remember all the dishes we had. The owner was very nice and accommodating. I accidentally ordered the basil chicken thinking it was the salt and pepper chicken and the owner brought out the salt and pepper chicken gratis! You can definitely tell that this is the type of establishment that maintains customer loyalty. We ended up eating the food leftovers for 2 additional meals with food to spare. I wish this restaurant was in nyc... i would def be a regular...I would recommend some dishes but i really don't think you can go wrong here... try them all if you can!",
                "reviewer_id": "7UTna-VDkttit9PLeJQ__Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00826165366951606,
                    "positive_probability": 0.9917383463304839
                },
                "stars": 5
            },
            {
                "review": "The food was great, waitstaff was nice. We had the crispy tofu and teriyaki chicken. We talked to the guys who bus though, and they said that if you don't bus your own table (and leave a tip instead) the bus boys don't get to keep it. It goes to the owners. So, bus your own table.",
                "reviewer_id": "83zqgCH5V0if3X0L_DVgug",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22597415894528672,
                    "positive_probability": 0.7740258410547137
                },
                "stars": 4
            },
            {
                "review": "True the ambience is not the best but that's not why you come here. The ordering system would be confusing if you didn't know about it in advance. But just like mandarin wok used to be this food is great! Recently they added a more Americanized menu attached to the main one and the only reason to order from that is they have the option of a smaller portion for less money. Maybe you could get that on the regular menu but it doesn't say and I didn't ask. They give you more rice than you probably need. If you are planning to save some leftovers you might not have any because it is hard to stop eating!",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9988939285506842,
                    "positive_probability": 0.0011060714493059478
                },
                "stars": 4
            },
            {
                "review": "authentic good Chinese food in the Midwest. You don't come here for the service or the ambiance. You come here for the food, and the food here is REALLY good!",
                "reviewer_id": "9iRDAeoTW08yZgR0JaaOHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2868143294015632,
                    "positive_probability": 0.7131856705984366
                },
                "stars": 5
            },
            {
                "review": "I've been coming here since it opened, and before that, I was driving to Mahomet to eat at the Wok.  So I am not unbiased.I love this place.  Over 1000 meal choices, and everything is translated into English from the old menu.  There are your normal \"Americanized Chinese\" meals like sweet and sour pork, and beef and broccoli.  I assume they're pretty good, but I'm more excited about the more exotic meals.I've had three cup chicken, stewed goat (with skin), eggplant and garlic, yellow bean fish, crispy tofu, Peking (or Fire) duck, peppered beef, squid with garlic sauce here, and salt and pepper squid.  I also had the soft pork buns, though those may have another name now.  There are so many more options, I've hardly scratched the surface.  The Peking duck in particular is amazing - fried to crispy, crackly perfection and served with a thick dipping sauce.  It's just awesome. The crispy tofu is also excellent, and is served with a sweet sauce and cilantro leaves.  I'd say it is the best in town.  The yellow bean fish is pretty consistently good, as well.  The food has always been good.  The prices are higher than what you see at a lot of Chinese places, but you get a lot of food and it is very good quality.  You get a big bowl of rice to eat with your food, too.  Generally, my girlfriend and I get a couple meals out of a visit here, where we get two entrees and usually pay about $30.  The dining room definitely does fill up, especially during the school year.  I'd give yourself some extra time to eat here, especially at dinner.I guess the ordering system confused some people to start with, but I don't mind it.  They recently streamlined it, too, along with improving the previously kind of Spartan decor.  You just write down the number of people in your party and what meals you want, pay,  and then they bring it to you.  Simple and easy.  You do have to clean up your own dishes (unless you want to pay a little extra) but they don't take tips, so it kind of balances out.This place has pretty much become my first stop for a Chinese-type food craving.  They're friendly, the options are immense, and the food is very good.  I was able to take my sister's vegetarian boyfriend here no problem, and the large sizes mean you can feed more people more affordably than if you're just going by yourself or with a date.Highly recommended!",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.970600867441717e-06,
                    "positive_probability": 0.9999940293990968
                },
                "stars": 5
            },
            {
                "review": "\"Authentic Chinese food. Huge Selection.\"Golden Harbor is one of the most authentic Chinese restaurant in the area. I recommend #514 the Szechuan Water Fish Fillet, if you like spicy food. The Kung Pao Chicken, Kung Pao Shrimp and Garlic Shrimp are also good if you are not a huge fan of spicy food, but want some heat. The side of beef fried rice from the menu is huge and is not the same type of fried rice that comes with as a side dish of a meal. Order it if you like fried rice - this fried rice is of better quality.There is a huge Chinese menu on the wall, but have no fear, they now have a large translated Chinese menu and a Americanized Chinese menu, both in English. This is not a place to go to expect the fake Americanized Oriental Chinese atmosphere with Chinese music playing in the background, but is a restaurant that actually serves authentic Chinese food. Like most restaurants in China, it is order, pay, and be served with little interruption from the staff after the food in delivered. Do not a fancy Red Americanized Chinese atmosphere, and you will not be disappointed. As this is one of the most frequented local restaurants for international students from both China and Taiwan, if you like authentic Chinese food, you will not be disappointed.",
                "reviewer_id": "9PkJdFbEAh6bJgDaHJ18mA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03553773986946559,
                    "positive_probability": 0.964462260130543
                },
                "stars": 4
            },
            {
                "review": "Good food and friendly service. They treat you like family. Best Taiwanese / Chinese food in town. Make sure you order from the wall!",
                "reviewer_id": "9TJKKPGJrlX089fX6332MQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2279087512098229,
                    "positive_probability": 0.7720912487901777
                },
                "stars": 5
            },
            {
                "review": "I must preface this review by saying that for about 364 days per year, I have no desire to eat Chinese food. For about 90% of those 364 days, I would say I actively dislike Chinese. For one magical day, however, I must get my Chinese fix.Today was that day. A friend recommended Golden Harbor as the place to go and thus we went. Honestly, it's not your traditional Chinese restaurant. In fact, I would call it a cafeteria where they bring your food to you. You don't really see a server except when the food comes. You clear your own table or you pay them to do it. It's kind of absurd how it's all organized.At the same time, it's Chinese food I would eat more than once a year. I actually liked it and since Golden Harbor didn't really score any points for ambiance or any of that cute stuff, it's four stars on the basis of food alone. In addition, when the rice cooker crapped out, the manager apologized for the inconvenience and hooked us up with lo mein instead. It's a little more expensive and a little more complicated to order but I would say the food is more than worth it.",
                "reviewer_id": "_9uvL80xzBxDjWzFM7Da5g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011487268677061427,
                    "positive_probability": 0.9988512731322782
                },
                "stars": 4
            },
            {
                "review": "Very good food, lots of interesting choices that are not available anywhere else in town. A funky atmosphere and unusual ordering process, but the service is fine for what it is. Don't eat here if you want the typical sit-down with a waiter dining experience, and don't eat here if you are unwilling to take a little time to parse the menu. They have English translations of it, but come with Chinese friends and have more fun figuring it all out.",
                "reviewer_id": "_xQTWG2yudpfnVIN8ZqsCw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22292099056851225,
                    "positive_probability": 0.7770790094314834
                },
                "stars": 4
            },
            {
                "review": "The best Chinese food I've tasted in the US. Thousands of items on the Chinese language menu, and quite a lot of them on the English menu(s) too. Recommend Crispy Basil Chicken, Signature tofu, Crispy eggplant, mala  and numb oil dishes, beef tendons, and many others!",
                "reviewer_id": "ANEH8yVbkxhwgilzKnu4ug",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5516824731727703,
                    "positive_probability": 0.44831752682722736
                },
                "stars": 5
            },
            {
                "review": "This place makes living in Champaign worth it!As far as I'm concerned this is the best Chinese food restaurant in Champaign! Their ordering process is a little bizarre at first, but once you get used to it, it gets better!I don't read Chinese but I've gone with people who do. I write down numbers that I like and order the same items later. Tina, who works there, does a GREAT job deciphering what I've ordered before as well. I've been known to say \" I had this great chicken dish last time but I don't know what it is.\" I'll describe what it looks like and she's like \"Ding! I know what it is.\" Tina has also given me great recommendations as well. More than once she's said \"If you like X, give Y a try!\" I end up ordering both X and Y and Y always becomes my new favorite dish! My favorites are:1) Potato strings with green peppers2) Snow fish with soy3) Crispy Tofu 4) Desert PorkI love that I always have leftovers for at least two more meals after eating at Golden Harbor! What a great way to stretch my dollar!",
                "reviewer_id": "AsT_XKaBSi-w_3M2SOGD6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.163758661506794,
                    "positive_probability": 0.8362413384932044
                },
                "stars": 5
            },
            {
                "review": "This place certainly feels quite authentic, especially given the (completely overwhelming) menu. I was only in a party of two, but this place is incredible for groups, with huge circular tables with a spinning platform in the middle - great for sharing dishes. I had a most delicious sesame chicken lunch special and a decent egg roll. No wait staff / no gratuity. (50 cent table clean up fee included on your order)",
                "reviewer_id": "Au8zxtMKpouKEfG0GnXo-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010892410052326133,
                    "positive_probability": 0.9891075899476667
                },
                "stars": 4
            },
            {
                "review": "This is the best tasting chinese food I've had here.  Lai Lai is still on the list to try, and Cravings is one of my favorites.This brings me back to the good ole days when they ran Mandarin Wok.  Self-service so it operates a little differently than what most people are used to.Food was top notch, served family style, and reasonably priced.",
                "reviewer_id": "auUfJU6y7293ORFb_tO1sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.044327944367000584,
                    "positive_probability": 0.9556720556329997
                },
                "stars": 5
            },
            {
                "review": "I'm not exaggerating. This is the best Chinese restaurant in central, if not the entire state of Illinois. When you walk in all you see are Chinese people laughing and having a good time. The entire menu is in Chinese so you either have to remember the number or have a local that can read the menu here. I was skeptical at first when someone told me that this was the best Chinese food. After one bite of their crispy tofu, I shed a little tear of joy and just kept eating.",
                "reviewer_id": "bCeCd7g_G2IQGwEVAKl3fQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008960902563409204,
                    "positive_probability": 0.9910390974365937
                },
                "stars": 5
            },
            {
                "review": "My favorite Chinese restaurant. Take a menu write down the numbers you want and order... Check the wall for dim sum and specials. Don't know what they say ask a fellow guest. Wonderful dim sum and wonton soup. Many dishes are shareable.?Fresh, hot and truly special. Loved the place. Pay cash and save 5%. Free hot tea and water. I will definitely be back.",
                "reviewer_id": "BHrQos_SwrrDiRQYSD_nIA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.301813088618444,
                    "positive_probability": 0.6981869113815583
                },
                "stars": 5
            },
            {
                "review": "This is a sweet place. So many people recommended it to me and it took my two years to finally go.My party ordered:Braised Beef (excellent)Crispy Tofu (yum)Three Cup Chicken (my favorite)Steamed Fish (HOT -temp)Dumplings (it was okay - definitely NOT homemade - probably from the package)Service? There isn't any except people bringing out your food. You pick out what you want, write it down on a piece if paper and go up to pay/order. Food came out fast and it was so good! Their chinese menu is extensive (which makes me happy because it reminds me of my mother's cooking). I highly recommend this place. BEST sit-down Chinese place!",
                "reviewer_id": "BhSbrzJt1HzYTBKplcw6qg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005441080188822206,
                    "positive_probability": 0.9945589198111807
                },
                "stars": 5
            },
            {
                "review": "This meal was an improvement over my last visit.  Let's face it, with a menu of close to 1000 items, not everything is going to be great.  But, most of it is at least pretty good.  They've updated their menu and the place is super busy, filled mostly with Asians and a few adventurous non-Asians.  Service remains bare bones but the kitchen is fast.We got the usual standbys - fried tofu, pork-belly buns, steamed fish, mock duck - all were pretty good.  We tried the braised beef tendons and brisket with turnips - this was also pretty good.  The only bad thing we had were the Shanghai rice cakes with pork - bland and too much gravy.  For dessert, we tried the steamed buns with sweet black sesame filling - pretty good.We Chinese are pretty close to the vest with compliments so I would say this place is \"pretty good!\"",
                "reviewer_id": "Bjr1R8WNLgMrf8fa3u3Dxw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9361329957885662,
                    "positive_probability": 0.06386700421143301
                },
                "stars": 4
            },
            {
                "review": "The food is fantastic and they're generous with their portions. Could do some takeaway and eat them again for days. Love the crispy tofu and mala pork slices. Long bean stir fried with garlic is not bad as well",
                "reviewer_id": "BUsBE6NeqGbT5jXJ3VESJg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04474283683637229,
                    "positive_probability": 0.9552571631636286
                },
                "stars": 5
            },
            {
                "review": "Yes, I was one of those confused customers as many of the reviewers are talking about. We looked around for a good 5 minutes before finally seeing the sign about taking a pad and menu and writing the numbers down. There was one menu left and there were only a couple people that were using them, so they definitely need more menus! It's not a quiet place to eat by any means. It sort of has a crazy, crowded, people running around vibe. They bring your dishes out in random order and we had to harass the guys bringing the food out because we still didn't get what we considered the appetizer until we were already done with everything else. The food tasted AMAZING. Whatever meal you order, keep in mind that it feeds two or even three! So even though it seems pricey, a group of three could share a meal for $14.99. We wished we knew this before we got 4 meals for the three of us.. Talk about leftovers for weeks!",
                "reviewer_id": "Bz72H3uYMxkcVs1RzwlKog",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025399007019808233,
                    "positive_probability": 0.9746009929802028
                },
                "stars": 4
            },
            {
                "review": "I went here or the first time with my family to celebrate a birthday!! Let me tell you, walking in my whole family were like 'what the ffff...\" The inside's atmosphere was nuts! Long line, some gave not learned, and no waiter insight! We then found out that you have to go in lie order food which is unorthodox! My family decided to find a table d leave it up to me  to order. I ordered: crispy basil eggplant (amazing!!) perfect tempura texture coated with basil sauce! It was perfectly balanced and the cripyess of the eggplant made the dish! beef brisket and tendon mala pot (TO DIE FOR) - oh my gosh!!! Holy tendon!! The brisket and tendon absolutely  melts in your mouth! My aunt kept talking about how wonderful this dish was! Clams w/ black bean sauce - meh. Nothing special.. Get something different. pork belly with bokchoy( great but reminds me too much of Paksiw which is a Filipino dish) the pok belly was very soft ad tasty! Whole fish #500 - SO EFFING goooooooddd!!! The fish was well seasoned and tasty! The fillet melts in your mouth! Yum! I am vey happy with this experience! The only reason I'm giving it a four is because of the organization of the place. Truly go here if you want AUTHENTIC Chinese food!! Can't wait to come back!,Btw the pace is BYOB!",
                "reviewer_id": "C-YjZ0XqJvRZr7Jya8hE6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005966500827283588,
                    "positive_probability": 0.9994033499172689
                },
                "stars": 4
            },
            {
                "review": "best asian restaurant on campus. usually i dont like eating at asian restaurants but i would go to Golden Harbor everyday. the tofu is good but a bit pricey for tofu. the salt and pepper pork is delicious. can get very busy during peak hours. pay with cash a receive a slight discount.",
                "reviewer_id": "c14YxDzwCVnCyj6os4R21Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8826699834816224,
                    "positive_probability": 0.11733001651838244
                },
                "stars": 5
            },
            {
                "review": "Yes, the ordering process was horrible. The restaurant seemed understaffed, and I couldn't believe that awkward sign detailing all the fees if you want them to clear your table.  However! It was all worth it for the crispy tofu, topped with that amazing sweet sauce. I'm a huge tofu fan and it was definitely some of the best I've had. Will be back the next time I'm in the area.",
                "reviewer_id": "ca3QVHm5jwdL9MIkQcz88w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19402837030407552,
                    "positive_probability": 0.8059716296959264
                },
                "stars": 4
            },
            {
                "review": "Most authentic chinese food in time. May be a bit pricy, so check your wallet before you come here. Always come in a group, sharing gives you a bit more options as to what you can eat! Crispy tofu here is really good.",
                "reviewer_id": "co71gkfZJGRZbXvZNGxZEw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15939588163085677,
                    "positive_probability": 0.8406041183691442
                },
                "stars": 5
            },
            {
                "review": "I am addicted to numb oil chicken, which is not everybody's thing, but they definitely have something you will love. It can be overwhelming to decide what to order, so go with a friend in the know the first time, or look at their weebly site in advance.",
                "reviewer_id": "CRIob-JMCmMe3JAFKuAtCA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8770502246053915,
                    "positive_probability": 0.12294977539460589
                },
                "stars": 5
            },
            {
                "review": "As a Chinese, I am really happy to find a place that actually make real chinese food. This place have the best spicy style dishes in the whole cham-urbana area. If you like real chinese spicy food, come here.",
                "reviewer_id": "Cz6rfr05U6vN_Zix7nufFw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05426737704689436,
                    "positive_probability": 0.945732622953107
                },
                "stars": 5
            },
            {
                "review": "This isn't the best Chinese food in champaign, it's the best Chinese food I have found in this country. It's amazing. First off there are about 2300 items per Sophie; who is the nicest person ever. Second, those items are amazing. All of them...and the portions...wow. Inexpensive and your bowl or plate will be packed trust me. Come here. Do not worry if you see tables full and five people waiting. Somehow the service is still quick",
                "reviewer_id": "DJhCX7TvKetUR8aBYZAT_g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.043035959821331654,
                    "positive_probability": 0.9569640401786715
                },
                "stars": 5
            },
            {
                "review": "It is not one of the best Chinese  restaurant in Champaign, it is the best.",
                "reviewer_id": "dPjYfacluGoHiCRjDmIIlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.35439818025356384,
                    "positive_probability": 0.6456018197464364
                },
                "stars": 5
            },
            {
                "review": "Yumyum in the tumtum wouldnt go else where for tuntum feeding through under my gumgum.Get the dong puo lohMore taiwanese traditional dishesThe owner is taiwanese and always feels great to be able to speak in a native tongue. But really good food and friendly with big smiles from everyone",
                "reviewer_id": "dRtsp3DS5gVPSMLa4enhoQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3179266627112109,
                    "positive_probability": 0.6820733372887878
                },
                "stars": 5
            },
            {
                "review": "Amazing food with countless items to choose from! A little pricier than the other restaurants in the area, but definitely worth it!",
                "reviewer_id": "dWrsoRZSOfbwvdwXGI_5RA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3887788050128717,
                    "positive_probability": 0.6112211949871293
                },
                "stars": 4
            },
            {
                "review": "Authentic chinese food for a good price. I went with a Chinese friend who just ordered a bunch of dishes for us; otherwise I would have had no idea what to get. We got the pork buns and crispy tofu and chow mein. All were awesome.",
                "reviewer_id": "Dxhyi5b0obJZurIxrpTCVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.040963872542023,
                    "positive_probability": 0.9590361274579767
                },
                "stars": 4
            },
            {
                "review": "So good!  There are tons of choices but even from my first visit I've never been disappointed.  All staff are super friendly/nice.Take a second to read the directions when you walk in.  Discount if you pay cash.   The place could appear cleaner, I think it's the floor that really drags the place down, and the to go seating/area.  But the food is so delicious.  I recommend pork belly, hollow vegetable with fresh garlic, Taiwanese Salt and Pepper Chicken, red bean buns.",
                "reviewer_id": "E3EFB-ZH9Cr_MZ8ovYhUQg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09764252739782202,
                    "positive_probability": 0.9023574726021821
                },
                "stars": 4
            },
            {
                "review": "9 months later, and this place has become a weekend staple for me. There's a 5% discount for paying with cash, so make sure you bring enough.Highly recommended for larger parties as well, since there are many large tables available and you'll get to try many of their delicious items.Note: I do not recommend the noodle soups, which are kind of bland and boring. But much of their menu can't be matched by their competitors in town.",
                "reviewer_id": "eAwlEPPnWniLDYtyB9cyXg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06886252902475762,
                    "positive_probability": 0.9311374709752371
                },
                "stars": 5
            },
            {
                "review": "Their best item is the crispy tofu. They also have great eggplant. The portions aren't as big as the ones I get back in SoCal but this place is arguably one of the best Chinese sit down restaurants in Champaign.",
                "reviewer_id": "eFIlrOz3TnuZQeh2Y1e17Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06845051002563537,
                    "positive_probability": 0.9315494899743619
                },
                "stars": 4
            },
            {
                "review": "SHUT UP AND TAKE MY MONEY!This is one of the most authentic Chinese restaurants I have ever been to in the United States. They have 3 versions of menus here: an American menu, a translated authentic Chinese menu, and a menu in full Chinese written on the wall. Though I could be wrong, I could not find all the items listed in Chinese on the wall in the translated Chinese menu. Your best bet is to bring someone with you who reads characters if you are looking to get the full experience. I got the following:sesame balls: These were not as large as I hoped though they arrived at my table hot and crunchy and the red bean paste oozed out in exactly the way I hoped.Crispy tofu: these are large chunks of soft tofu which have been breaded and friend with a slightly sweet sauce on top. Crunchy on the outside, soft on the inside. Very nice.Spicy basil chicken: this seems to me a variant of orange chicken in that it is similarly fried and smothered in sticky sauce. A little too American for my taste though it seemed to have great reviews here on Yelp.The best thing I ate: a whole spicy fish. This was one of the items that I couldn't find in the translated menu but was on the wall. I think it was number 2099 though a double check with the cashier wouldn't hurt. This fish was deep fried and covered in a spicy soy sauce based sauce that included hot chilis. The frying left the small bones of the fish completely edible and slightly crunchy and paired with the tenderness of the fish meat in the middle....*drrroooollllllsssssssss*Finally, most things are DIY such as ordering at the cashier and grabbing your own chopsticks and napkins as well as filling up your own tea kettle. The busboys are ever-present and eager to help should you have any misshap you can't handle (my brother spilled a cup of water and they cleaned that up like lightening).  And just like in China, tip is not expected here. They just charge $0.50/person to clean the tables.I am ecstatic that I ate here and cannot wait to come back again!",
                "reviewer_id": "EI7QpLiJ4XYaUH35XkdndA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.3873927684757504e-05,
                    "positive_probability": 0.9999761260722791
                },
                "stars": 5
            },
            {
                "review": "I have friends that adore this place.  To me, it is a typical Chinese joint with utilitarian non-decore, crumby toilets, filthy carpet in a nondescript strip mall.  Although the presentation and atmosphere are uninspired, the food is good.  You see a lot of Chinese customers in this place.",
                "reviewer_id": "EIEE9tOYbaTgDpiMDms-RA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010000411680012283,
                    "positive_probability": 0.9899995883199871
                },
                "stars": 3
            },
            {
                "review": "So excited to find a place with Taiwanese food! Went here for lunch with my coworker and it's a really casual, help yourself, kind of place. You walk in, get stunned by the wall of menu items, figure out what you want and write down an order. Go to the counter and pay (cash is 5% off!), then find a seat and wait for your food! The tofu is what they're famous for, so we ordered the Crispy Tofu. I wanted to get the Stinky Tofu but had to get back to work and didn't want to stink up the office. The prices are not cheap because they are big portions. So be prepared or bring people to share it all with!Pros: yummy foodCons: limited service",
                "reviewer_id": "ErgbL4PS-ybDsOJyj4Tvxw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.016525349977657974,
                    "positive_probability": 0.9834746500223402
                },
                "stars": 4
            },
            {
                "review": "Most of the meals here are good and they have different food for Chinese and non-Chinese people. Without a doubt, the Chinese menu is much better than the English version. The food is fast it is popular in both Chinese and non Chinese people.",
                "reviewer_id": "etuZywOGmPhsZAKRneaCQQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.20691995835572846,
                    "positive_probability": 0.7930800416442694
                },
                "stars": 4
            },
            {
                "review": "I've been here a few times in the past, but my most recent experience warranted a five-star review.I ordered on the phone during lunch on my way out of work, and the woman who answered the phone was so nice! I know that the woman who works the front counter there is great at interpreting what you want and helping you order, but I wasn't expecting such thorough service on the phone! She made sure I was ordering exactly what I wanted (and asked me if I wanted the authentic Chinese recipe- of course I do!) Then, she offered to have it ready in ten minutes, or hold the order until a time of my choosing.I got there and met the nice lady who took my order, who immediately recognized me. She greeted me, and I paid in cash, receiving a  small discount! The entire time, she was smiling and making me feel very welcome. She gave me my food, which was all ready to go, and said \"enjoy, it's all nice and hot.\" A huge component of my job is customer service, and this experience was A+ customer service.Of course, as we all know, the food was amazing! My \"lunch\" portion for $7 was enough food for me to fill up now, and still save half for whenever I want it later. I've been around to the other Chinese restaurants in the area that have very good reviews, and they are good, but not quite as good as the Golden Harbor.The only negative point is that it is hard for me to justify ordering the same thing I always get each time, as I know whatever I order will be fantastic!",
                "reviewer_id": "eUr1wjuVp3K_fcjGLHkMGw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.017595706004122788,
                    "positive_probability": 0.982404293995884
                },
                "stars": 5
            },
            {
                "review": "Restaurant reviewThis is the asian restaurants to end all restaurants. The variety is limitless. Don't be fooled, they do have there limitations. If you look at the menu closely you will notice there is no fresh fish or seafood items which are staples of asian food, however you will not be disappointed with the selection. They have a little of everything from the different provinces of China. Your head will spin when you walk in as you try to figure out what to order. Your best bet is to check out the menu at home online before going to the restaurant itself. You order cafeteria style and write down the numbers of your order. There is no gratuity which is nice, but don't expect the busboy who double as servers to help you out. There main job is to dump the food off at the table and take your number back. There is a fee of 1 dollar for each person for clean up and free tea. The cashier is quite friendly ad does not get overwhelmed even when the line is super long. We ended up trying a variety of dishes which you can see from the pictures. Here is a quick run down:1. Smoked tea duck- sort of salty and dry unfortunately, but still tasty2. Beef ribs with some sort of glaze- deep fried and a bit dry, but plenty of sweet sauce over it3. Glazed pork- a hybrid dish that is similar to orange chicken. Again a bit dry on the underside4. Fish fillet with veggies- tasty and a lighter dish. Cooked well, but the white fish is your typical asian stir fry fish5. Salted egg coated shrimp- the egg was not salty at all, but the shrimp were cooked well and crunchy6. Soup dumplings- pretty good, not sure if they are the freezer variety or if they make there own. The skin is on the thicker side, but this is expected in the midwestIn summary, I have tried tried asian food in China, Hong Kong, Thailand and this is by no means anywhere close. The food is good given the variety and the location in Central Illinois. The extensive menu is really different proteins with variety of ingredients. Often the meat is cooked in a wok with high heat and then a sauce is applied. Given the volume a lot of the meats were a bit overcooked and dry. If you have a large party it is great given no need for TIP, BYOB; but if you want real authentic asian food you will have to go to Chinatown!Pros: super large menu, relatively good prices, BYOB, no gratuity (1 dollar service fee for table cleaning), free tea, large tables for groupsCons: very busy, small parking lot, no real \"service\", food is a bit dry and overcookedHidden deals: Pay in cash for 5% off, I am sure this is for there own tax write off purpose......Health code rating: B, some issues based on the report for food temperature. http://champaign.il.gegov.com/champaign/estab.cfm?facilityID=1523",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.003653558369251649,
                    "positive_probability": 0.9963464416307513
                },
                "stars": 3
            },
            {
                "review": "This was great when it was the Mandarin Wok, and it is great that the owners are back in town.  Service is minimal and you bus your own table in exchange for not having to tip (you can pre-pay like a buck or so to have it bussed if you really care), but who goes to a chinese restaurant for atmosphere?  Go for the food!  The Awesome, Awesome food!",
                "reviewer_id": "fDKIoBx8QrgiVtLpab5wqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3661684703084755,
                    "positive_probability": 0.633831529691522
                },
                "stars": 5
            },
            {
                "review": "Super good. They have something for everyone here. They have an enormous menu. I havent been very adventurous my three times I've visited Golden Harbor, but I haven't been disappointed. Good family style Asian cuisine for a fair price. Will be back.",
                "reviewer_id": "fDXALtk5kBuQgUD5GLkrhg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12127259443062391,
                    "positive_probability": 0.8787274055693775
                },
                "stars": 5
            },
            {
                "review": "I read up on reviews of this restaurant before I went there as I was intimidated by their huge menu, unique ordering style, and my unfamiliarity with authentic chinese cuisine. I was determined to try a non-Americanized chinese dish, so I went through all of the pictures and descriptions on Yelp. I asked the person taking orders to explain the difference between a couple of dishes and make a recommendation. She was very patient and thorough, and her explanations were easy to understand and decipher.  Due to raving reviews I read about crispy tofu, that was what I went with. I got the dish to go- It was a Tuesday night and I waited about 15 minutes for the food to come out. I don't mind waiting- must really be cooked to order! My only regret is that I didn't get it to go. The tofu had been sitting in a puddle of sauce in a container (as opposed to a shallow pool of sauce on a plate) that it lost is crispyness. The sauce, which is rather sweet, was a little too sweet for me to enjoy it as a main dish. I would have loved to have gotten a smaller portion of it as an appetizer.All in all, I'm excited to go back to Champaign and try another dish next time.By the way, portions are HUGE. I mean, seriously huge. 1 order can easily feed two!",
                "reviewer_id": "FIyqKXw2qH9QdDHsR0AEwg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005550853423874444,
                    "positive_probability": 0.9994449146576284
                },
                "stars": 4
            },
            {
                "review": "We come here every time we're in the area. The food is always good and portions big. Service is very friendly.  The menu is in Chinese and is very intimidating to a non-speaker, so I'd suggest coming with someone who can read it! English menu seems limited next to it. Today, we had beef soup noodles, beef chao fan, crispy tofu, white boiled fish (english translation), and soy sauce eggs with ground meat. This was plenty of food for our party of 4. The beef chao fan and soup noodles were just okay. Chao fan was over sauced and on the salty side. The soup noodles were too soft and the broth was bland. Soy sauce eggs were alright as well- surrounding meat and sauce was very salty, and eggs themselves needed more flavor. The crispy tofu was delicious as always- love this dish, and order it every time. I highly recommend it! The white boiled fish sounds better in chinese, but the dish itself was excellent. Soft pillows of fish- very light. Overall, our meal was decent here. Because of our small group we didn't have some of our favorites like the braised pork belly buns. We will be back for more cheap yet good chinese good in the future!",
                "reviewer_id": "fjQAOHSkRj-zbPvLJfvu3A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09277720063849072,
                    "positive_probability": 0.9072227993615092
                },
                "stars": 3
            },
            {
                "review": "Good food and nice people. The girl at the front rest is so sweet. Reasonable price with big portion",
                "reviewer_id": "fRNS4GMOoQeCwzLDbKcOZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3960118536954035,
                    "positive_probability": 0.6039881463045955
                },
                "stars": 5
            },
            {
                "review": "I keep hearing how good this place is and I finally checked it out. I was not disappointed! I read a lot of reviews about the ordering process and how it was confusing. I think they must have heard because when we went it was really clear how to do it and I found it very easy. They have a big sign with instructions and instructions inside the menus, also. To be clear, you go in the door, there are menus, the American and the translated. You take an order pad and a pen, write down the number of what you want, take it to the counter and pay. They give you a number then bring the food to your table. After you pay, there is a table with flatware for you to grab. They bring your plates, napkins, and chopsticks to the table for you. Simple and easy!The translated menu has SO many choices! I didn't know what to order so I went with the standard General's chicken and my hubby got the Schezwan chicken. We split the pork filled pot stickers. Everything was amazing, just amazing. Best Chinese food I have ever had.I think next time we go, I'd like to have my Chinese friend order for us. I think that'd be a lot more fun and I'd get to try more authentic foods since everyone has been raving about them. I think he'd choose a lot of different and tasty stuff besides the Americanized dishes. We got there a bit after 5. Around 5:30 it was like the flood gates opened at it was PACKED (it was a Saturday). There are a lot of tables. It's good for groups too because they have a lot of big round tables with the lazy Susan in the middle for sharing and passing different dishes. I can't wait to go again, at least I have plenty of leftovers to last a while! The portions are generous! Top notch!",
                "reviewer_id": "fVq5cSG1ULnAbo_GBezOKg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5129354826615438,
                    "positive_probability": 0.487064517338439
                },
                "stars": 5
            },
            {
                "review": "How would I know there was a yummy authentic Chinese restaurant in Champaign? Thanks Yelp! Loved this place. The food was delicious and almost every table had the giant lazy susan in the middle for sharing. We had a large crowd and ordered veggie dishes, orange chicken, sesame chicken, and spicy shrimp. Everybody loved it and the prices were reasonable especially for a large group.",
                "reviewer_id": "GBeiYNUcrLOuskeLdyl4-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02160811359646944,
                    "positive_probability": 0.9783918864035304
                },
                "stars": 4
            },
            {
                "review": "I took my parents. They both seemed to like it. My mother raved about her entre, which I believe was beef fried rice. She also enjoyed the fried pot-stickers, though they weren't all that thoroughly fried (obviously steamed and then quickly \"fried\" on one side). I wasn't too hungry and just had the crispy tofu, which was excellent as many others have said. Held up well the next day for lunch, too.We ordered a mix of things from the translated menu and the \"American\" menu. I didn't find the order process to be complex even as a first-timer. Grab a menu, find what you want, write it on a piece of paper, go up to the counter. Not rocket science. We grabbed a table first which made things a bit easier.",
                "reviewer_id": "Gd5Q2H8Et-SkLuDo7F98WQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005726193488525742,
                    "positive_probability": 0.9942738065114827
                },
                "stars": 4
            },
            {
                "review": "Unequivocally the best tasting Chinese food in town.  Though, recently it seems a bit understaffed.  The interior and the ordering system are both very utilitarian.  Bottom line, if you want great, cheap, and (usually) fast Chinese food, go here.  If you want any kind of ambiance or a quiet atmosphere, go elsewhere.highlights-excellent food-the ordering system allows you to sit in but not tip.-pretty cheap-can get very crowded and loud-For what it's worth, my Chinese classmate said it was the best Chinese place in town.-famous for crispy tofu",
                "reviewer_id": "GiCxjPrrrZ3q-M5_Y6UmVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0805187603502347,
                    "positive_probability": 0.9194812396497694
                },
                "stars": 5
            },
            {
                "review": "Their shrimp dumplings are my favorite! The service is quick. I have never dined in, but their carry-out never disappoints. This is one of my favorite Chinese restaurants in Champaign!",
                "reviewer_id": "gMptLmFSVO2gsAIk-pfSVA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8037919900502928,
                    "positive_probability": 0.19620800994970664
                },
                "stars": 4
            },
            {
                "review": "There should be a 10-star in Yelp! I am in love with this place. The food the staff everything is awesome about this place. I really really recommend the fried fish with vulur sauce. I have eaten at a lot of different chinese all over the US but to date have found none that come close to this place in flavor!",
                "reviewer_id": "go3_RCCCZBDTL_NPiWxVqA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08455640983422572,
                    "positive_probability": 0.9154435901657783
                },
                "stars": 5
            },
            {
                "review": "Love love love this place!  Word around town has been that there are some very authentic menu items and that venturing into this restaurant is daunting and definitely not in the average persons comfort zone. I decided I would try it when a group opportunity to go presented itself.  What a fool I am for waiting. When you go inside, yes, it is very authentic to the standard restaurant you'd see overseas. There is a menu in Chinese on the wall, but they offer an American menu as well, including one with more \"traditional\" Americanized Chinese food.  On the menu there are thousands of offerings!  Yes, some items may put most people off, such as tripe, pig intestines, duck tongue, and some others, but look past that to the other thousand or so offerings!  Best Chinese food I've had in over 15 years since I was in an area with real authentic Chinese food.We had the eggplant and pork, salt and pepper pork,  crispy pan fried noodle with seafood, pork and Napa dumplings, garlic string beans and the chicken with bean sauce. Everything was amazing.  Delicious! We all left stuffed with a bag of leftovers and I am anxiously waiting to get to eat them tonight. Sophie at the register is a delight. This place is no tip. Byob.",
                "reviewer_id": "GonYPp67Ba5ucqr83dqoZQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007769411642113762,
                    "positive_probability": 0.9922305883578669
                },
                "stars": 5
            },
            {
                "review": "Stopped while driving through town.  The food is very good but OUTRAGEOUSLY EXPENSIVE.They have a station set up so the customer fills out their own order and turns it in at the cashier (weird).Good but not worth the money.",
                "reviewer_id": "grSmy1Z-p1mFpCuLzQsYBg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06079717193060655,
                    "positive_probability": 0.9392028280693961
                },
                "stars": 2
            },
            {
                "review": "The menu here is ridiculous. I have a hard time choosing what to get! Also, the authentic Chinese menu is way better than the American menu. This is one of those places where it's definitely worth it to take a risk and try something new! Things I like:Sesame Balls: Interestingly sweet and delightful!Garlic Beef: Nothing too special, but a good addition to supplement a large group meal with many dishes. American-style Sesame Chicken: Eh. Crispy Tofu: LOVE. A little bland, but I love the sauce and the texture!Chinese-Style Pork Fried Rice: Hands down best fried rice I've ever had. It's not all over cooked and doused in soy sauce like many asian food places have. The rice is still moist and soft, and the eggs are cooked fresh. Also, the meat still has some juicyness to it. AWESOME.Rangoons: These only have cheese in them. I wish they had crab. Typical rangoons, really.American Chicken Lo-Mein: Typical Lo-Mein, but really good!I can't wait to come back again and try new things!",
                "reviewer_id": "GuI0CNeLXEIVAtoye0WJgQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.017665331367212423,
                    "positive_probability": 0.9823346686327821
                },
                "stars": 5
            },
            {
                "review": "As a Taiwanese, this restaurant makes me unhappy! Today is my first time to go to this restaurant. I asked a waitress that what's the best meal and she got irritated and said \"read the menu by yourself. After that, you can ask me.\" Then, I asked her to recommend one of the popular meal and she's still irritated and said \"it's shown on the menu.\" Jeez what's wrong with her? As a result of that, I chose one of the popular food in Taiwan--the oil rice and another food I thought it might not taste bad--stew beef belly. The oil rice they provided is not the oil rice at all!! It tasted weird and rice did stick together. This had to be one of the weirdest oil rice I'd ever had. For the beef one, I'd say it tasted ok but totally tough. Overall, it's an expensive restaurant and if you want to find a Taiwanese style restaurant, you will feel disappointed.",
                "reviewer_id": "H-ClPrZm4MriWZXHhotqyQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7723627851919752,
                    "positive_probability": 0.22763721480802843
                },
                "stars": 1
            },
            {
                "review": "I love this restaurant and it's one of the very favorites of my Taiwanese son-in-law.",
                "reviewer_id": "H4RbPWQUAMSfo4zrw55dKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.34029309664078244,
                    "positive_probability": 0.6597069033592167
                },
                "stars": 5
            },
            {
                "review": "I can only comment on the vegetarian food. From other people in my party though they seemed to really enjoy the meat dishes. I found the food to be the best chinese food in this area. They cooked the eggplant perfectly. Most places I find it's either to chewy or too dry. They got it dead on. The cripsy tofu is delicious. I recommend ordering 2 dinner dishes for 3 people. That will be more than enough food. When eating here for dinner be sure to allow for 45 minutes for your food to come. Though, I went with a group for lunch and went at the beginning of the lunch hour and our food arrived within 20 minutes. Anyways I highly recommend this place.",
                "reviewer_id": "H8wT4jji49mEB_CxXFF5LA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2022608860277812,
                    "positive_probability": 0.7977391139722193
                },
                "stars": 5
            },
            {
                "review": "Very good Taiwan style Chinese restaurant. Taiwanese I have met tell me they barely get better at home. Do I really need to continue writing?",
                "reviewer_id": "hd4E2wcaEQ2kKDnGIjbhFw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6751987088071928,
                    "positive_probability": 0.3248012911928072
                },
                "stars": 5
            },
            {
                "review": "Ok. Liked their kung pao chicken and the pork scwhezan stir fry didn't turn out to be as good.",
                "reviewer_id": "hHNp7ED-ZV1VVqCIXoAQ0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08530288104711625,
                    "positive_probability": 0.9146971189528837
                },
                "stars": 3
            },
            {
                "review": "Tasty and authentic.",
                "reviewer_id": "HIEtUrgB_fVNNWor-7n6Jg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 4
            },
            {
                "review": "ZOMG.  A good Chinese place in the middle of nowhere?  Okay, it's not nowhere, but it sure as hell ain't SF!Great authentic dishes-- ribs, mushrooms and greens, crispy duck, Prices = moderatePay in cash and you get 5% off.   They accept some plastic too.Service = friendly but they're too busy to really check on you.  Plus it's mostly self service, so no need to tip either!",
                "reviewer_id": "HleMXet__Xnwgjv8kbw4hA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.647281227620638,
                    "positive_probability": 0.35271877237936644
                },
                "stars": 4
            },
            {
                "review": "You know it is an authentic Chinese restaurant when the menu is in Chinese. My friends begged me to go with them because their Chinese reading skill is limited. But I had no idea that I would be standing in front of the wall for so long - the menu is super extensive. The funny thing is when I mentioned that they have an \"egg\" section and a claypot section - my friends didn't even know! They have an interesting operation where customers order by the number on a slip of paper and then you pay for it at the counter. They charge 50 cents for clearing the table. And you grab all the utensils, bowls, tea, cups by yourself. We ordered the fried tofu, because that's one of the few dishes that my friends always get. However, I thought it was just okay. I prefer crispy fried tofu, not mushy fried tofu. We tried the salted fish with chicken claypot rice and that was pretty legit. The pork bun from the Taiwanese section was good too. They serve the buns and the meat separately so you make your own sandwich. The pork chop udon was a little disappointing, the pork chop looked super dry. They also have a dim sum section and we got the liquid-y yellow bun aka \"lau sa bao\" in Cantonese. That's a popular dim sum in Hong Kong and it's special because the steamed bun has liquidy yellow egg custard oozing out when you bite into it. However, the egg custard at this place wasn't too liquid-y so it was more like \"lai wong bao\". We got some simple green veggies to balance everything else out. My friends warned me to drink lots of water due to the amount of MSG in the food and boy, were they not kidding. It's still good though. It sure beats ordering from the English menu :)",
                "reviewer_id": "HMY3mw8-o9M0SboOvcx9pg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 4.871819966826415e-06,
                    "positive_probability": 0.9999951281800459
                },
                "stars": 4
            },
            {
                "review": "This is the best place you can go in the Champaign area for Chinese food. Make sure you go with a big group so that you can all share food around the lazy susan. The prices aren't cheap, but it's completely worth it.Drink lots of tea so that you can eat more and don't be hesitant to try food off the authentic Chinese menu. We tried the stinky tofu just because there was a disclaimer about how badly it smelled and how no refunds were allowed. It wasn't quite worth it, but it was fun.The duck tongue and frog legs were great and the pork belly pancakes- if you want to try weird foods.",
                "reviewer_id": "hpaHRiqdYcDNlLJxo5C9JQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0811668584722536,
                    "positive_probability": 0.918833141527748
                },
                "stars": 4
            },
            {
                "review": "There is a huge difference between Chinese food and Taiwanese food. I think it's very misleading to have a restaurant bill itself as \"authentic Chinese cuisine\" then specialize in their Taiwanese dishes only. I had hoped their Chinese dishes would be good or passable at least, but their versions of Mongolian beef, Szechuan chicken, and chicken with black bean sauce were barely edible. I would give the Chinese food 2 stars and the Taiwanese food 4 stars (because the Crispy fried tofu was good) and average it all at 3 stars.Taiwanese dishes are heavy on soy sauce and sesame oil.  They can have a Malaysian influence. There are a lot of deep fried dishes. So if you prefer deep-fried food and brown sauces, as well as home-style or stewed meat, you might like this restaurant quite a bit. It's BYOB and bus your own table or pay a $1 fee, so good for feeding a large group family-style, by sharing dishes.Take a close look at the pictures that customers have attached of the food they ate here because that's what it really looks like. what wiki has to say about Taiwanese food:http://en.wikipedia.org/wiki/Taiwanese_cuisine",
                "reviewer_id": "ibnbXrtLARvdDGfo9cGx0w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0022117052926046332,
                    "positive_probability": 0.9977882947074077
                },
                "stars": 3
            },
            {
                "review": "The BEST Chinese food I have had in the United States in a long time. I love Asian food, but typically avoid Chinese restaurants due to the typical tired, Americanized fare. The flavors at Golden Harbor are very authentic, just like dishes I had in Taiwan and China (Shanghai, Suzhou, Hangzhou and Beijing) in spring 2011. I'm already trying to think of an excuse to return to Champaign. Try the crispy tofu, eggplant with garlic sauce, and spicy fried green beans.",
                "reviewer_id": "IHNhEhC_DeoIGtVT8Sithg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0028045174053913905,
                    "positive_probability": 0.9971954825946061
                },
                "stars": 5
            },
            {
                "review": "So good. Can be pricey but a great place to eat family style. You must try it at least once!",
                "reviewer_id": "IIRBF6_xbWYPbP_mjGI8RA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.46745500531677253,
                    "positive_probability": 0.5325449946832275
                },
                "stars": 4
            },
            {
                "review": "Went with a large group for a birthday celebration, ended up ordering family style.  Everything was fantastic, especially the stick fried tofu and the pork buns.  Fantastic place to go with a large group, but just make sure to bring cash to split the bill.Overall, the best Chinese food I've had, bar none.  A bit on the expensive side, but well worth the cost.",
                "reviewer_id": "IJ3m1dLcXv_NjDlXQ5J8Iw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8404677347489169,
                    "positive_probability": 0.15953226525107903
                },
                "stars": 5
            },
            {
                "review": "The food here is absolutely amazing.  I had been hearing some pretty sad reviews of this place ever since it changed ownership but all I've ever known has been under new management.  The food is incredibly \"authentic\" and not Americanized and reminds me so much of food I had growing up at home or while I was living in Asia.  I love, love, love this place.The downsides though?  The seating can be awkward since there have been times when I've gone with a very small group, or one other person, and had to sit at one of the large family style tables.  The menu is very, very, very comprehensive but sometimes difficult to navigate.  And the pricing is very expensive for what it is.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01357742268641159,
                    "positive_probability": 0.9864225773135781
                },
                "stars": 4
            },
            {
                "review": "Well, since my last review was flagged, I'll have to start this one again. (Previous post was to confirm the restaurant is indeed Tina's which was in question before she actually opened.)Tina's new place is at the site of the old Pickles restaurant on Green St.  She thankfully gutted most of the restaurant (needed it ages ago) and it is now very open.  There are numerous tables for Chinese Family-Style eating (lazy-susan in the middle of the table for food) along with standard tables (4-seaters).  So, this is a larger restaurant by Tina's standards (larger than Mandarin Wok's total seating).  She has Tea-Pots for tables now and a large tea making machine.  A great addition to the restaurant.  There's now enough space for the chinese menu out front and also the buffet table (only used during moon festival I think).Unfortunately I removed one star from the 5 for two things which together I felt were slightly important to new visitors...(- half-star) The new system of computer ordering from front to back of house is a bit frustrating for old customers of the Woks.  You are presented with a pad of paper and a pen and instructed to place your table number and number of party on the pad.  You then write down the numbers of items you wish to order.  When you get to the front all of this goes into the computer and zipped back to the cooks by electrical magic.  This is significantly faster than the older method of ordering, but much less personable.  One of the golden linings of Tina's restaurants is actually Tina herself- she knows her menu and she wields it well.  So, if you aren't sure what to order, you're in a bit of a bind with the new system.  Now, this was the first week, so it all might calm down in a week or two.  Incidentally some of the items on the menu are actually mistranslated.The items we had (and love) are:#204 - Spicy Basil Chicken  (mislabeled on the menu)#851 - Garlic Stir Fried Green BeansThe final half-star off is for a slight difference in flavor in the #204- I don't know what it is, hard to put my finger on it- I think it's due to new equipment, but it's ever so slightly different (at least when I had it).I'm definitely tempted to to give Tina 5 stars, as I can't express how happy I am I can eat her food again, but I feel for those who are going to go to her new place for the first time, those two aspects may make a difference.I hope to be back with more numbers to add to the list of dishes we really love.  I'll reconsider the last star as we go more often.  I suspect the first week will always be a bit rough around the edges.Definitely a place to recommend to everyone interested in Taiwanese food.[Addendum- we came for dinner the night before, but had to leave as there were no tables to be had and a 1 hour wait for food.  We came back the next day for lunch, and it was much better.]",
                "reviewer_id": "iLM27ACTnZt2x0RIibQtpQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.045463786320874576,
                    "positive_probability": 0.9545362136790977
                },
                "stars": 4
            },
            {
                "review": "Okay, Golden Harbor is not only the best Chinese place in the area, but I think it's also a contender for best restaurant PERIOD.  I love coming here with a bunch of people so I can try lots of different dishes.  I keep getting surprised by Golden Harbor and how consistently amazing it is.  Some of me and my husband's favorites, just off the top of my head:  yellow bean fish, crispy tofu, crispy duck with dipping sauce (the sauce becomes gelatinous when cooled; a good thing, it means they probably use some kind of stock in it), three cup chicken, softshell crab with hot oil and basil, and meatless eggplant with house garlic sauce.",
                "reviewer_id": "iN34tIuP_IYqQWIaPhddmw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006794805425768419,
                    "positive_probability": 0.9932051945742278
                },
                "stars": 5
            },
            {
                "review": "it was ok, like other Chinese restaurants in the U.S. Price was good, but I really was focus on the food. Sorry for the one star.",
                "reviewer_id": "inxT8ed7YwUT207W1RKE1g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3764466899779793,
                    "positive_probability": 0.6235533100220211
                },
                "stars": 1
            },
            {
                "review": "First, I feel that I should set expectations: You won't have a waiter to help guide you through the menus.  You choose from either the abbreviated American menu, or go through the full \"Translated Menu\" and write your own guest check and give it to the cashier, pay, then take a number to your table to receive your food.  I actually love this idea as I, a waiter, have always felt conflicted as how to tip in most Chinese restaurants where you terrible service, but a server does come to your table and bring you your stuff so you feel compelled to leave something. . . . Golden Harbor even has signs saying tips aren't required and instead charge a $.50 per person clean up fee.  I also like how they give a five percent discount if you pay cash and the cashier was completely fluent in English and was far friendlier than any other Cashier/waitress I've experienced at a Chinese restaurant in town.The food was on par with what I've had at Lao Sze Schuan in Chicago's Chinatown, and far superior to any Chinese place I've found in town where every dish was basically - meat, veg, rice, generic greasy sauce,/no flavor.\" This is definitely a place for someone who appreciates good Chinese food, but isn't necessarily concerned with the ambiance or service.",
                "reviewer_id": "iOswsZGkOMLs-EEroamL9Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9099439606502366,
                    "positive_probability": 0.09005603934977918
                },
                "stars": 5
            },
            {
                "review": "Stick to the popular dishes here and you'll enjoy it. Crispy tofu, Phoenix buns, fish in black bean sauce are all very good. Branch out too much into the more \"authentic\" less mainstream dishes and you'll find they aren't that well made. It's probably because they have a textbook-sized menu",
                "reviewer_id": "iR99P7t7tYWPMZw57o7Uow",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03215895704924106,
                    "positive_probability": 0.9678410429507552
                },
                "stars": 3
            },
            {
                "review": "Yelp  must be broken - this was barely edible. I can't possibly understand how the average ranking is so high for this place.  Honesly, I over-ordered so that I could get a sampling of a few different things.  Even with that shotgun approach I could not find any of the four dishes that was worth eating even half the portion. Is this really the best Chinese food in town??  It definitely feels like you are in a restaurant in China when you are at a table but.... not when it comes to the food.",
                "reviewer_id": "iUBh5a7hjGOXLPpqtOf9hQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009602285518619583,
                    "positive_probability": 0.9903977144813781
                },
                "stars": 2
            },
            {
                "review": "It is a terrible regret that I moved away before I had a chance to become a regular at Golden Harbor.  I've been there once and the food was out of this world good.  You can have the americanized staples, which are still good, or you can get into the real stuff and just have an amazing meal.  I wish I could pack this place up and take it with me wherever I go.It does have an odd cafeteria style service.  But it's BYOB, which I would love to see more restaurants in C-U adopt.",
                "reviewer_id": "IXFGCmgnB8YY-jtPCaNYeQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08133567578786154,
                    "positive_probability": 0.9186643242121358
                },
                "stars": 5
            },
            {
                "review": "Golden Harbor is as authentic and good Chinese food as you will get outside of Chinatown. Their most famous dish is their crispy tofu, which is delicious. These three dishes below are excellent:-Crispy Fish Fillet With Wulur Sauce-Taiwanese Salt and Pepper Chicken-Crispy Tofu (signature tofu)Their menu has a great variety of dishes. Even better, you don't even have to pay tip! There is only a $1 cleaning fee per person, which makes it a great place for large parties that would otherwise have to pay 18% gratuity. Wow, no tip? That's how you know you've found authentic Chinese. THAT'S how they do it in China; trust me.",
                "reviewer_id": "J8xQk0zNcQAm76XrThbEAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0033122697647365645,
                    "positive_probability": 0.9966877302352608
                },
                "stars": 4
            },
            {
                "review": "The place is nice, the interior is not as fancy but it is nice. I love the shrimp fried rice, definitely recommend that! The service was not too much my favorite because the waiters were kind of quiet, they were nice because they checked on us but not giving a really happy atmosphere.",
                "reviewer_id": "J_RuYVPEDZBtP70iH-_PRg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8613633004617437,
                    "positive_probability": 0.13863669953826066
                },
                "stars": 4
            },
            {
                "review": "The food here was great. One of the best Chinese restaurants I've ever eaten at. The portions are huge which explains why the prices are a bit high, but overall great quality and friendly service. Definitely plan to go back next time we're in town.",
                "reviewer_id": "JVilswhH4byPVom0nm5EyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0241371039401806,
                    "positive_probability": 0.975862896059823
                },
                "stars": 5
            },
            {
                "review": "Love crispy tofu here .. cashew tofu is also good for vegetarians .. Visited many times with parties of 10+ people.. Most people loved it",
                "reviewer_id": "jxStSYz2atJFuKmUS0iffw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11270177712692275,
                    "positive_probability": 0.8872982228730769
                },
                "stars": 4
            },
            {
                "review": "Honestly, this place is great. Has extremely authentic Chinese food. The restaurant has moved multiple times from being a extremely small shack in a nearby small town to a much bigger location, where it is now. Extremely good, but sometimes the food is definitely not as good because of the number of customers.",
                "reviewer_id": "k23Uo-4EVB4xFLqUNckNbw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0024212945493887568,
                    "positive_probability": 0.9975787054506133
                },
                "stars": 4
            },
            {
                "review": "This is the only place in town that I know of where you can order goat with the skin on and goat intestines. Other reviewers have commented on the lack of oxygen in the place; I'm not sure that matters all that much. If you're looking for goat, this is definitely the place to go!",
                "reviewer_id": "K9uvy5T1ElR96Hcwz5Yy8g",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.740055650982904,
                    "positive_probability": 0.2599443490170927
                },
                "stars": 5
            },
            {
                "review": "I rarely eat Chinese food in restaurants. I find the typical American version of Chinese restaurant food to be terrible so I avoid any of the \"buffet\" type restaurants. Golden Harbor is different. It is authentic. I thoroughly enjoyed the food. It is the best Chinese food I have ever eaten. I highly recommend it.",
                "reviewer_id": "KBqnnb4zXAO35s2SzVlUMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09067177118531368,
                    "positive_probability": 0.9093282288146869
                },
                "stars": 5
            },
            {
                "review": "Definitely worth 5 stars.  You won't get ambiance, but you will get amazing food!",
                "reviewer_id": "kc1uUlHySLvnUvQHtkvfqg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.30751943112318014,
                    "positive_probability": 0.6924805688768205
                },
                "stars": 5
            },
            {
                "review": "Seriously, best Taiwanese/Chinese food near U of I, try it for yourself but make sure you order the right dishes! The menu is extensive and often times overwhelming, but try to narrow it down to a few good dishes. Like most people, I recommend the Crispy Tofu, Peking Duck, and Three Cup Chicken.Don't go looking for typical Americanized Chinese dishes, you'll regret it because you have an opportunity to try real, delicious Chinese cuisine. Also, if you share a bunch of dishes amongst a group, your total won't come out to be unreasonable! It gets pretty busy on the weekends, but generally tables clear out pretty fast so don't be discouraged.Yum!",
                "reviewer_id": "kNs6ZmyYCuHBRORhx5OSKQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0020481508331562665,
                    "positive_probability": 0.9979518491668438
                },
                "stars": 5
            },
            {
                "review": "Thumbs up for the Best Chinese food ever.  No, I am not exaggerating.   Until I came across Golden Harbor, my Chinese food options were just limited to carry out places where I used to more often than not get the Vegetarian Fried Rice and the Vegetarian Spring Rolls but Golden Harbor to me redefined the concept of Chinese Food.  They have an elaborate menu for Vegetarians (which is very unlikely for a Chinese Restaurant) and note that none of these Vegetarian dishes contain duck sauce or oyster sauce like most of the other Chinese places.  The owner is an extremely friendly person who greets you with a smile and explains to you the menu in detail if you have any questions.  When it comes to orders, this restaurant works differently.  You have plenty of tables to sit and dine but the waiters don't come to take your order.  As soon as you enter you have a table filled with menus (both the American version and the Chinese version), a small book and some pens for you to write the order and mark it and give it to the owner at the billing counter.  The lady then gives you a token for you to take and place it on the table you sit.  Then the waiters come and deliver the food to your table.My personal favorites at this restaurant are Vegetable steamed dumplings and Spicy Hunan Vegetables.",
                "reviewer_id": "kp3GLnG9bdwSM2DtAQwwJw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.892387842192587e-06,
                    "positive_probability": 0.9999931076121602
                },
                "stars": 5
            },
            {
                "review": "Great authentic Chinese food but the restaurant has a different system than other Chinese restaurant. It's a self service restaurant - u write down ur order on the order pad and give to the cashier. Pay with cash as they charge u cc transaction fee if u use one. Also they charge u for table cleaning fee ($.50 per person ).  Water and jasmine tea are free.Endless options of food - from general tso chicken to sea cucumber. Crispy tofu seemed popular so I tried and it was very good - love the sauce!! We also had duck with bun , pork with black pepper (lots of black pepper), general tso chicken, seafood hot pot( this is different than what people would  normally call a hot pot), prawn with sweet chili sauce, wonton soup, egg drop soup, fried dumpling, and cheese ragoon ( no crab in it). In general, everything was good and tasty!!If you can go earlier, that's better so that way you don't have to complete for a table and wait in line to order  :) Again, their menu is huge so this is place you have go over and over to try different  food!",
                "reviewer_id": "KqY6HHpdlGh4IeaWWfkKww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3350637345755955,
                    "positive_probability": 0.6649362654244205
                },
                "stars": 4
            },
            {
                "review": "This is, hands down, the best chinese food in central Illinois.  Another reviewer put it very succinctly, though:  you go for the food and not the atmosphere.  If you want to be pampered, go somewhere else.  If you want tasty & authentic chinese, eat here!  Other reviewers have complained about the notepad ordering system, and it's really not my favorite system, either.  On the other hand, folks who knew them from The Wok in Mahomet who don't read chinese will appreciate the fact that the full menu is now available in English.  One of those reviewers was perplexed about how to order a dish not-so-spicey, but it worked great for us simply to write EXTRA SPICEY next to one dish and NOT SPICEY next to another.  I feel more confident writing NOT SPICEY on the pad of paper than I do saying it.  I've had dinner there two nights in a row and still find myself craving it for dinner tonight.  My partner went for lunch yesterday and met me there again for dinner; we may have to consider just moving in!  I had the crispy tofu, which has been an absolutely favorite from the Wok in Mahomet, and my new favorite is the Snow Pea Leaves with Garlic.  I was blown away by how tasty and fresh this dish tastes.  My partner had the Cilantro Pork on Noodle and loved it.  The dumplings were awesome, and I like the vegetable egg rolls better than the regular egg rolls.  The counter staff are extremely friendly and helpful.  When I placed an order for a dish from the Diced Chicken W/ Bone, she made sure I knew that the dish I was ordering was chicken ON the bone.  She also remembered us from the Mahomet restaurant and remembered to leave the onions out of my partner's dish.I was also surprised by the dollar charge to clear your table; at the Mahomet restaurant, I always cleared my plates away and they wiped down the tables. Frankly, the prices are so good I don't mind paying an extra buck.  So this restaurant is ideal for me:  great food, no frills on the setting or service, and lower prices.  If they had full waiter service, there would be longer waits for tables, and the prices would have to be much higher.  I'd rather save the money and eat there more often!",
                "reviewer_id": "Kr-ercNqKrx4FHycmHuX5A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.1301741299389387e-05,
                    "positive_probability": 0.9999886982587182
                },
                "stars": 5
            },
            {
                "review": "I can't let myself give this 5 stars because I've had better, however, I do think it's really delicious in its own unique way. The taste is very different compared to other Chinese restaurants in Champaign, IL and I think this has got to be the best around. I'd give it 4.5 stars if I could.I've ordered the noodles mostly but have tried other items like the chicken fried rice (that was okay, pretty plain), pan fried noodles with pork (too much ginger for my taste), and some Singapore noodles which were really great!I want to try the other items but it can be a bit overwhelming when ordering. There are SO many options. It also is a lot pricier than it should be but what can you expect. Also, if you pay in cash you pay 5% less or something.",
                "reviewer_id": "kRqk2li5lEm8R2EcYDrXBQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00881450557408468,
                    "positive_probability": 0.9911854944259154
                },
                "stars": 4
            },
            {
                "review": "I have tried this restaurant three times upon a recommendation from an acquaintance. I've come to the conclusion that it's pretty bad and prices are high.  Each time the sauces had no depth of flavor. The ingredients were minimal.  Though the menu is quite large, many of the sauces taste similar. This is home cooking at its blandest.  It's like visiting your mom for dinner who cooks with the least amount of effort.  They should reduce the prices by 33% to account for the lack of flavor.  The many five star reviewers here have no idea what good Chinese food should taste like.",
                "reviewer_id": "kZtNCg4fPulJAOCiWbpKOA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7794055251537043,
                    "positive_probability": 0.22059447484629702
                },
                "stars": 1
            },
            {
                "review": "I've just been forced to concede that, despite still not digging their ordering process, their food is just too good to disrespect with a 2 star review.",
                "reviewer_id": "l1ueBdwcaL0vNEZBq_7wzg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9662222981491306,
                    "positive_probability": 0.03377770185087115
                },
                "stars": 4
            },
            {
                "review": "Amazing! As a vegetarian, I was extremely pleased with all the options!! They are all delicious! Everything I've ever gotten here has been amazing! I strongly recommend this place for chinese food at a fair price!",
                "reviewer_id": "L4IEZUmaOh4SjhYtB8kWQQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025226992796263985,
                    "positive_probability": 0.9747730072037373
                },
                "stars": 5
            },
            {
                "review": "Easily the best Chinese restaurant in central Illinois.Food here is beyond phenomenal. Most dishes are as authentic as it gets outside China itself, and even American favorites like sesame chicken taste quasi-genuine, rich in the flavor of natural chicken, not of heavy artificial sauces.Golden Harbor has no waiter service, and the decor is rather nondescript, but I think that's a plus as it contributes to the hole-in-the-wall, local, traditional feel of the restaurant which, since its days as the Wok in Mahomet, has actually received many technological upgrades.",
                "reviewer_id": "LBvI6vU-vTrfjH0IQQVsMg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0002904669597412623,
                    "positive_probability": 0.9997095330402505
                },
                "stars": 5
            },
            {
                "review": "4 1/2 stars for food.   Not sure how to rate the atmosphere.  Unusual setting.  Lots of tables with lazy-Susan's to seat up to ten people. Very basic set up.  If ambiance isn 't a must for you, then definitely try the place for the food.  You write down your order at your table and take it to the counter to order and pay.  They bring plates, napkins and chopsticks to your table along with your food.They have two menus.  One is simplified--more like you see in a regular Asian restaurant, and another that is authentic and huge, with many unusual items.The portions are very generous, and ours was delicious.  I had the chicken vegetables with chili sauce.  It was pleasantly spicy and very tasty.  My son had the fried tofu in chili sauce and my husband had cashew chicken.  They cleaned their plates.   The only dish I wasn't crazy about were the steamed dumplings.  Just so-so.Regarding other comments about it being pricey, you have to consider this is a \"no tip\" place.  The price of each dish is approx equivalent to what you would pay elsewhere with a tip.We don't live in Champaign, but we 'll stop in again as we pass through town.",
                "reviewer_id": "lCR5L4ddC2absE0rOc4cEw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.987805386507733e-06,
                    "positive_probability": 0.999994012194619
                },
                "stars": 4
            },
            {
                "review": "Best Taiwanese restaurant so far since I came to the states!!!!!!!!!!",
                "reviewer_id": "lFHxqnuBQzzA_YSRBmhVVg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45499873767574184,
                    "positive_probability": 0.5450012623242576
                },
                "stars": 5
            },
            {
                "review": "",
                "reviewer_id": "LfuFdiS5V4z_SdH7TX34CA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 1
            },
            {
                "review": "For a place that looks like a Greyhound bus station, it's pretty good!Not going to lie, it's not fancy looking by any means, and they seriously need new menus. I had to sift through 5 menus to find out that it was one big menu, just torn apart. AND THE EFFING WATER!!! I know it's free but it seriously takes forever for the water to come out of the fountain dispenser. I wanted to get Sprite not because I really wanted it but because I knew I would've gotten it quicker. But hey...I like free stuff including free water.However, the cashier was super friendly and knowledgeable-- she recc'd the fried tofu which was AMAZING! There's a reason why everyone raves about it. I got fried rice which was simply delish-- it had the right amount of rice and meats--- the soy sauce was nicely balanced. For a large plate, it was worth 10.99!This place is pretty legit!",
                "reviewer_id": "lnI3o0mHyYjVPKadZdskeQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8175508304110773,
                    "positive_probability": 0.1824491695889306
                },
                "stars": 4
            },
            {
                "review": "This place is really great. I went here for the first time the other day and I will be coming back for more. I had the beef chow fun, crispy garlic beef, and hunan chicken. Everything was really good.The ordering system was kind of weird, but I can see how it is efficient. And I don't like how they charge $0.50 per person sitting at the table for clean up fee... I'd rather we all just clean up after ourselves like most of the other restaurants here in Champaign. But overall, food was great.",
                "reviewer_id": "LPKBHpoNcNqCa3KUifJfYQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07450214770219096,
                    "positive_probability": 0.9254978522978079
                },
                "stars": 5
            },
            {
                "review": "If you've never been to Golden Harbor before, do yourself a favor and first go to the website and look at their online menu (http://goldenharbor.weebly.com/english-menu.html) before you head over to the restaurant. Otherwise, you might over-order just like my family and I did today (our party were 4 adults and a child). Despite this, we were very happy with all of our choices (plus we got to take home an entire meal worth of left-overs--yay, tomorrow's lunch!). It was a wonderful way to celebrate our daughter's twenty first birthday.We ordered: #87A (fried tofu with onions, garlic, and shallots over noodles); #32A (beef brisket-tendon soup with noodles and bok choy); #128 (fried rice with Cantonese  sausage--aka lap cheong sausage); #523 (brisket with hozu sauce); #443 (braised duck tongue in spicy sauce); #592 (squid curry hot pot); #1503 (8-piece fried pork dumplings/pot stickers); and #B33 (10-piece steamed mini chicken buns). Let me just sum it up: everything was perfectly seasoned, cooked, and served at the right temperature and even though it was crowded when we got there, once we got a table and ordered, we did not wait long and we were definitely not disappointed! I could taste freshness in every bite--nothing was sitting in a steam tray under hot lights--it was all made to order.More first-timer tips before heading over: 1) I got the impression that it's first come, first served. If it's crowded and there are no tables, be persistent because the food is well worth it. Plus the tables turn over pretty quickly (we came between two successive waves of late afternoon and evening diners but we did not wait as long as we would have for a table at some of the popular places along North Prospect). 2) On the website, a contributor suggests that you bypass the menus, both printed or on the wall and just ask the friendly young lady at the counter who takes your order (she is pretty good at suggesting options according to what you're in the mood for). I might try this option next time. 3) The water and hot tea are very good and very free--yes, it was tap water from the fountain dispenser but I'd swear they use a filtration system because the water did not taste metallic or chemical like you might experience with a fast-food fountain. (I think this is one of the seemingly basic details that makes all the difference between having an ok experience and a really good experience). 4) You will not have to tip--they charge a one-dollar per diner surcharge for cleaning/bussing, but you are essentially placing your own order by writing down the number of the menu item and indicating how many diners are at your table. It's not your typical restaurant but it really works! 5) No alcohol is sold there but you can BYOB!Five stars is not enough stars for Golden Harbor.",
                "reviewer_id": "m6MLFP4Kqiud4QviuYt7Gw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.1225204272599651e-05,
                    "positive_probability": 0.9999887747957515
                },
                "stars": 5
            },
            {
                "review": "The food here is pretty excellent - lots and lots of choices, and nothing I have had here has ever been bad.  The ordering process is a bit goofy at first, but you get used to it.  My only gripes are that it's very, very drafty in here in the wintertime and the parking lot is screwy.",
                "reviewer_id": "M7Ay-iCMnLLXFWtcUhxI8w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7865688759917719,
                    "positive_probability": 0.21343112400823275
                },
                "stars": 4
            },
            {
                "review": "This is the go-to spot for Taiwanese / Chinese food in the Champaign Urbana area. This place is made for family-style feasting. The ambiance is very comfortable: a big room with tables everywhere, always buzzing with students, professors, and locals. Order from the sweetest, nicest cashier ever, Sophie, and ask her if you need help with the menu; she is very enthusiastic, and more than happy to help. Grab a seat, serve yourself and your friends some hot tea or water, and get ready for heaven.Best dishes? We always order crispy tofu (a couple plates of it actually), salt and pepper chicken, pepper beef, dou miao or kong xin cai, the honey walnut shrimp, and whatever else looks good in the pictures. If you ever need help finding something new and delicious, Sophie knows what to get, and you can follow the facebook page for Golden Harbor that she manages (rather, curates) for news on what's cooking, what's hot, what's in season, and what's good. As a bonus, every so often you get a handful of cute posts, pictures, and videos to brighten up your days of the week, and that's always a good thing.What more is there to say? This is the place to satisfy your tastes. I graduated this year and live in San Francisco now, but I still miss eating here. Do yourself a favor and choose Golden Harbor!",
                "reviewer_id": "mdOh-Xfo5wdaNX14TBu-5w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04464477509746013,
                    "positive_probability": 0.9553552249025219
                },
                "stars": 5
            },
            {
                "review": "I love Chinese food and this ranks up there with the best food/experience that I've ever had. It's a very unique atmosphere compared to almost every other \"Americanized\" restaurant. The only real way to describe it is a family style seating at the large round tables where everyone shares. However, they also have smaller tables for small parties. I ordered Hot-and-Sour soup, Crab Rangoon, egg rolls, and Mongolian beef. My girlfriend orders some type of chicken dish, which I tired and was delicious. One dish is definitely big enough to split between two people as the portions are rather generous. I will continue going here when I'm visiting Campaign-Urbana.",
                "reviewer_id": "MW09ejzq8mY2OjquQs50TQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.267868462918405e-05,
                    "positive_probability": 0.9999373213153805
                },
                "stars": 5
            },
            {
                "review": "I got orange chicken and fried rice. The chicken was not the typical orange chicken flavor that I'm used to but even if it was it was dry chicken. The rice was ok but not anything to go out of your way for.",
                "reviewer_id": "nBOu2mwggQW5DFn5hC0lTQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3546780483811637,
                    "positive_probability": 0.6453219516188373
                },
                "stars": 2
            },
            {
                "review": "For a vegetarian, this place is heaven. For my \"eats anything\" partner it's the same. He can get his beloved intestines and I can get hollow vegetable and tofu. There's so much variety and everything is good. For the amount of food I think the prices are fair. Great place to go with a large group. Great, hilarious, Facebook account.",
                "reviewer_id": "ncZxFHnFa9c_9Y33bVzKLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.029553572416363878,
                    "positive_probability": 0.9704464275836351
                },
                "stars": 5
            },
            {
                "review": "I'm always impressed with Chinese food down in Champaign, and this place definitely leaves me feeling the same. The menu is huge and posted on the wall (and there are menus). I'm so overwhelmed on what to order as everything seems delicious! The prices may seem a bit high at first, HOWEVER, they don't accept tip and it is sort of self-served (they will bring out the food to you though). I love how they have real authentic Chinese food with varying regional styles. This particular visit, we ordered their specialty tofu dish with soy sauce and scallions, a pork soup, drunken shrimp, and fried rice. LOVED the flavors although they were a bit salty for my taste, but some rice takes care of that. The tofu was crisped perfectly and the soy sauce is thick and filled with aromatic flavors from the garlic and scallions. The pork soup was nice, it is Taiwanese style and authentic. Haven't been able to find that soup elsewhere in the states yet. The drunken shrimp was spot on with the cooking wine and herbs. The shrimp meat was fresh as well! However, I recommend to skip the fried rice here, nothing really special whatsoever.Probably will drop by this place every time I visit the area. Give it a try!",
                "reviewer_id": "nd3n5T1H8TWADtrKf0FnVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.485977858733806e-05,
                    "positive_probability": 0.999985140221405
                },
                "stars": 5
            },
            {
                "review": "OK, here is the procedure for non-Chinese folks;1- Walk up to the front desk and grab menus, an order pad and a table number card. 2- Sit down and pick something to eat. You have 975 (no joke) choices of authentic Chinese/Taiwanese dishes. If you end up chosing sweet and sour chicken you deserve a slow fiery death.3- Write your entree number and the quantity (figure on getting one entree per person and having leftovers, unless you are super-hungry. You will get rice with the entree) and return the order to the lady at the cash register, who will take your money.4- That lady will give you glasses for water and direct you to where the tea is.5- Wait 10 min or so. Don't fret, they will bring your chopsticks and napkins.6- Enjoy the shit out of your yummy vittles. Don't forget to share, as no matter how freaking good your selection is, whatever your fellow diner got is just as good.I've had the Salt and Pepper Shitake Mushrooms (they are not on the menu, but the lady at the counter knows what you are talking about) and the Crispy Tofu as featured at http://champaign-taste.blogspot.com/2010/11/golden-harbor-authentic-chinese-cuisine.html These two are freaking divine. The tofu was the absolute best I've ever had.",
                "reviewer_id": "NGX1PZwHET_oQOT7vkkxag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25452261616186467,
                    "positive_probability": 0.745477383838145
                },
                "stars": 5
            },
            {
                "review": "This place has about anything you might want to order and a whole lot that you won't (not because it isn't great, just because it isn't your thing). While they can seat quite a few, it can get pretty busy. There is a small table with lots of menus available. If you pick one up an can't read a thing, pick up another (some are in Chinese).It's worth noting that if you want to have a beer, some sake, or any other kind of alcohol, go over to Picadilly's and bring it into the restaurant.",
                "reviewer_id": "NVUrOtbBK7HEvPpHsXmN8Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.119075301616248,
                    "positive_probability": 0.880924698383754
                },
                "stars": 4
            },
            {
                "review": "It's real real a delicious chinese taiwan restaurant!",
                "reviewer_id": "nwdwCbPMowEQb23VqZMlng",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6023180503255612,
                    "positive_probability": 0.3976819496744386
                },
                "stars": 5
            },
            {
                "review": "Seriously the best Chinese food I have ever had in my whole life. I have come here time after time and it just keeps on getting better from here. The crispy tofu is a must even if you don't like tofu it's so good the pan fried noodles yes yes yes and don't get me started about the duck . I highly recommend this place. It's can't get any more authentic than this also Tina is such a sweet person (owner) if you want to take a large group out to eat this is the place to go even if you are going for a small gathering",
                "reviewer_id": "OeVbKa-5bo0aL9AQ6bLodg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.048437834260783276,
                    "positive_probability": 0.9515621657392198
                },
                "stars": 5
            },
            {
                "review": "Best chinese in town . Only problem is that I have to wait long to place order. try three cup chicken, fried whole fish, steamed bread with meat. They have too many dishes.  It is better for you to stay with what you like. There is risk to try new dishes",
                "reviewer_id": "OHlNjcJko1RYE2Ihv7sOMQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.044897782499579764,
                    "positive_probability": 0.9551022175004212
                },
                "stars": 4
            },
            {
                "review": "This is Champaign, IL folks!  We don't have ANY good restaurants here, let alone, one as authentic as this one.  Went for Take Out on a Saturday at 5:45pm.  Waited in line and did not get up to the counter to order until 6:10p and food came out around 6:40p, so it takes a long time to order and be served, but in the end, the food is delicious.  I would have given it 5-stars, but waiting almost 1/2 hour in line while only one person is on cashier, is a little inefficient.  Hopefully, they will get up to speed.",
                "reviewer_id": "Ok3gtOMPTiKJ7KxUI5wsYQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22743362636110143,
                    "positive_probability": 0.7725663736389007
                },
                "stars": 4
            },
            {
                "review": "This is the best Chinese food you will find in the Champaign/Urbana/Savoy/Mahomet area. They used to be on campus, them moved out to Mahomet, now back on campus (note that the restaurant has changed names with each move). My friends and I always joke that they would make bank if they moved up to the Chicago suburb area. But they do very well already right now where they are. My family has known their family for about 6 years now, and they are the sweetest people on earth. If you're not sure what to order, you can always ask them (Tina is very helpful) what they recommend. Our staple dishes here are:Steamed fish (i don't know the name, but it's some type of white fish steamed with green onions, ginger, sitting on top of bean sprouts. So fresh and delicious!)Crab Rangoon - never had betterOrange ChickenBasil Eggplantsoup of some kind, they're all pretty goodsmoked chicken Crispy Tofu!!! People try to copy their recipe, but the original is still, after all these years, unbeatable!Service in my opinion is always great. If you're going to gripe about cleaning your own table or writing down your order on a piece of paper (it just makes the ordering and cooking process faster - win for everyone), then don't eat here. More good food for the rest of us who don't need to be sucked up to and waited on for a good meal. This is your cozy mom and pop and daughter Chinese food shop. There's so much love in that food! :)",
                "reviewer_id": "oolWxkuiaGjgh5wv6_Xh-w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0026518961695501365,
                    "positive_probability": 0.997348103830434
                },
                "stars": 5
            },
            {
                "review": "Ohmygod. THIS PLACE! Thiiiiiiisssssspllllaaaaaaaccceeeeeee! SO GOOD.As I was visiting from out of town, I decided to call in my order and proceeded to greedily eat all of my food by myself in my hotel room, in a manner that I would have been embarrassed to do in public. I was not mistaken to do so. I wanted to SHOVEL it into my face it was so delicious. I'm pretty sure I was using both hands to eat at one point. First things first: the woman who took my order? Very nice. Patient with me as I tried to navigate their 1-million-item menu. I asked her for a couple of recommendations; I like sweet and sour, chicken, maybe a veggie or two and not too spicy; she obliged with several tasty suggestions. I got the sweet and sour noodles, orange chicken, shanghai egg rolls and some awesome garlicky bok choi number; everything was on target. (Not the fried donuts though...those were kind of lame.)Go here. Order. Eat with both hands. You will be ever so glad that you did.",
                "reviewer_id": "Ota-6ush0gwe5QhWfdNZHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.022928376933696926,
                    "positive_probability": 0.9770716230662961
                },
                "stars": 5
            },
            {
                "review": "Food is amazing, all authentic and fresh. It's definitely the best Chinese restaurant in  town. Definitely get their signature crispy tofu, it's one of their best dishes and I just love coming there. So much variety and all the food is flavorful and just right. Food comes by fast and service is terrific especially the cashier - Sophie. Sweet woman, always had a smile on her face every time I came to see her. I recommend this place with both thumbs up. You won't regret it.",
                "reviewer_id": "oXU_b0-p_ii4_PHhM93pWA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0027506625735882785,
                    "positive_probability": 0.9972493374264095
                },
                "stars": 5
            },
            {
                "review": "That giant menu on the wall that you can't read because it's in Chinese - just close your eyes and pick something. Secret menus always guarantee great food.Maybe you're not that adventurous? It's ok, I don't judge. Just make sure you go with an experienced Golden Harbor-er (or someone that can read Chinese), because not everything on their giant menu is listed on the English one. Whatever you choose to devour, and you will cause this place is DIVINE, make sure you don't skip the crispy tofu ($10). It is THE best in the world...yes, capital T.H.E. BEST. Not a fan of tofu? Eh, your loss!Try not to crave this place on a Monday (I know, I know, it's hard), but don't do it! You'll pull up and have your heart broken to see that it's closed on Mondays. They also close from 3-4:30pm everyday, everyone needs a lunch break, y'know? So plan accordingly. UGH. SO GOOD.",
                "reviewer_id": "oYT1eRGFQxzPCR0h_JyvIw (1)",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9174410344690478,
                    "positive_probability": 0.0825589655309519
                }
            },
            {
                "review": "That giant menu on the wall that you can't read because it's in Chinese - just close your eyes and pick something. Secret menus always guarantee great food.Maybe you're not that adventurous? It's ok, I don't judge. Just make sure you go with an experienced Golden Harbor-er (or someone that can read Chinese), because not everything on their giant menu is listed on the English one. Whatever you choose to devour, and you will cause this place is DIVINE, make sure you don't skip the crispy tofu ($10). It is THE best in the world...yes, capital T.H.E. BEST. Not a fan of tofu? Eh, your loss!Try not to crave this place on a Monday (I know, I know, it's hard), but don't do it! You'll pull up and have your heart broken to see that it's closed on Mondays. They also close from 3-4:30pm everyday, everyone needs a lunch break, y'know? So plan accordingly. UGH. SO GOOD.",
                "reviewer_id": "oYT1eRGFQxzPCR0h_JyvIw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9174410344690478,
                    "positive_probability": 0.0825589655309519
                },
                "stars": 5
            },
            {
                "review": "My dad's a first generation Chinese immigrant, and he drives here first whenever coming to campus. Seriously, it's that good. If you know Mandarin or have a Chinese friend, order off the secret menu. It will be worth it for sure. Standard dishes that people love include the Yu Xiang Egg Plant, giant ginger meat balls and crispy tofu. Amazing food for a decent price.",
                "reviewer_id": "pD0ntLKZOopi2KmaVxSw_A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05892254440507198,
                    "positive_probability": 0.9410774555949316
                },
                "stars": 5
            },
            {
                "review": "It took me a long time to get to Golden Harbor. I had heard SO many varying opinions, from the over-the-top fantastic to the somewhat mediocre. I had heard about the complicated ordering system and the offering of strange meat items (goat? some kind of squid?).Well, I finally went last Tuesday... and WOW. Here's a breakdown of the trip:My friend made reservations for our group of six. Our table was ready right on time, and while it wasn't super crowded, it seems that making a reservation for a group of more than four is a good idea. We picked up our menus and a pad of receipt paper, and a friend grabbed tea and cups for all. The tea was fantastic. The menu, bewildering - in the best way something can be bewildering.There are SO MANY OPTIONS, and so many of them sound AWESOME. We ended up with six dishes, to be shared family style. I chose a crispy eggplant and basil dish, and Mr. Husband got some crispy pork. We also had another eggplant dish (I want to cry just thinking about it! SO much scrumptious eggplant!), a black vinegar pork, some kind of weird crab thing (I don't like eating things that look like spiders, so I didn't eat that), and, uh, something else fried. Our food was served surprisingly quickly, considering we ordered six things. It only took 10-15 minutes as I recall. (The conversation was amusing, though, so it may have taken slightly longer.)The eggplant dishes were like riding a dragon while eating cotton candy made from angel tears (awesome). I loved loved loved the crispy fried eggplant! I surprised myself, too, in that my second-favorite dish was black vinegar pork. Mmm. I tried everything except the spiders, and I was in heaven. Prices were decent. Expect to pay around $10-15 per person. Considering that they charge a table-clearing fee and there's no expectation to leave a tip, that's pretty decent. Consider going elsewhere - you might only spend $6-8 per person on an entree, but then you add a drink, and have to tip 20% at the end. The total trip cost me $25 for 2 dishes, which I was pleased with.Bottom line, for the \"tl;dr\" crowd: Awesome food, not too expensive, go with a group, make a reservation, drink tea, don't eat spider-crabs.",
                "reviewer_id": "pjIrFFjl03twCAaQMJQxwQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.328647296567972e-08,
                    "positive_probability": 0.9999999467134965
                },
                "stars": 5
            },
            {
                "review": "Moments like this, I wish Yelp would allow users to rate 4.5 stars.No complaints, food was definitely delicious, service was fine since it isn't really wait-staff, but I've had better food as well. Basically, it would be a strong contender in Chinatown, but it wouldn't be the best.",
                "reviewer_id": "PR8mTpquWDr3clN03-vMEg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16054704176386908,
                    "positive_probability": 0.8394529582361323
                },
                "stars": 4
            },
            {
                "review": "Food is really good!  The ordering process is a bit complicated at first but you get used to it.  You don't have to pay for tip which is a big plus for a college student.  Portions are fair and the food is excellent quality!  The fried tofu is really good!",
                "reviewer_id": "pSxXCwlE_djZ4RcLl2c4Sg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7670102867502114,
                    "positive_probability": 0.2329897132497843
                },
                "stars": 4
            },
            {
                "review": "I Loooove this place!  Living in this town my entire life I always like to discover new places but most leave me with a \"meh\" attitude after.  When This place first opened I was intrigued to try it.  I had not been to their place in Mahomet but my mother always raved about their food.When you first walk into GH you find a table with pens order tablets and menus, both an American menu and more authentic menu with a billion items on it! (Well.. not a billion but I still take 20 minutes to decide what I want to this day...and I've been to GH my fair share of times, and then some)  For some reason there are a lot of people that don't care for this way of running things and I have watched people literally walk in.. look around, you see it click in their head how things work as they read the signs, and walk out. WTH?!  It's not rocket science and its really a relief to have a place to go that isn't a cookie cutter restaurant like a lot of the chain garbage around here.  The lady behind the counter is super friendly and will help you through the process if you're confused.  She also will recommend something for you to try if you tell her what you're in the mood for.  If you want something done a little differently, no problem.  VERY accommodating!Anyway, you figure out what you want and write it on the pad and pay.  They give you a number and you find a table.  Hot tea and water are available to go grab while you wait (or soda for purchase)  AND this place is also a BYOB! awesome.  Depending on how busy they are they can take 10 minutes and some nights where its busy I've waited ~30 to get all our food.. which in comparison to other businesses on a busy night, is nothing.  Also sometimes the food comes out in strange orders (main dish before soup or apps)  but that also is no big deal, I would rather my food be fresh and hot (which it always is here) then have it come out cold due to course etiquette.Now for the food.  Everyone says the crispy tofu is amazing, which it is.  But since that is a given I won't go into that.  My husband and I have tried to switch things up every time we go, but over time we've found some go-to dishes.  I really enjoy all the \"crispy\" dishes, the basil chicken is almost a candied texture and soooo yum! And they are super generous on the basil! Enough for every bite! There's also one in sweet chili sauce that I remember enjoying.  Also a sweet chili crispy pork (I'm drooling now).  The crispy beef with black bean is nothing like one of those cheap chain beef and black beans.  Its huge chunks of meat that are cooked until just perfectly done and have the best meaty taste unlike allot of places where you question what the meat is you are actually eating and what they've done to it to make it the disgusting flavorless texture it is.  This stuff is a great combination of flavor and they don't use the sauce to mask the meat.  We also enjoy the \"salt and pepper\" items, The salt and pepper squid is great, simple and done perfectly(there is no sauce) though I would ask them to go light on the salt as it is sometimes a little overpowering (but I love salt) The one thing my husband always goes back to is the crispy shredded pork in hot oil sauce, and I've got to say, it's pretty darn amazing as well. (am I getting repetitive yet with the \"amazing/awesome\" comments, at least you're getting my point this place is friggen great!)  So this pork is little crispy golden tidbits with lots of cilantro and hot peppers and its coated in this indescribable sauce, I'm sure it's simple.. but simple is good!  And this is one thing you have to try!  Never disappoints!  My 3 year old daughter likes the egg drop soup and the vegetarian egg rolls, which I've tried nibbles of and also find enjoyable.  The soup is thick and filling and not neon orangey yellow, you know its homemade.  The veggie rolls are crisp and light.  Even the rice is delightful!  You can have fried or white (we tend to ask for both)  And if you need more, just bring up your bowl and they will give you more!I could go on forever about this place, you can't go wrong, be adventurous!  Close your eyes and run your finger down the menu, where ever you stop, you'll love it!",
                "reviewer_id": "pT_TsqlgOHpL_Mv2zmUhbQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.4314659058034732e-05,
                    "positive_probability": 0.9999856853409164
                },
                "stars": 5
            },
            {
                "review": "The first thing that strikes many diners at Golden Harbor is the set of rules and practices which differ from American expectations.  There's a table set aside covered in menus and \"Guest Check\" books for you to fill out your own order form.  Then you queue up and wait to pay.  If you have questions you are asked not to delay the people behind you, to step out of the line.  Except that the line is never ending so you cannot get your question answered without stalling the line.Next, only credit cards and checks pay the full bill.  Cash payers get a 5% discount. No tipping is allowed or expected.And a new rule as of November 27, 2011, they add 50 cents person as a charge for cleaning the table, because the former practice of allowing people to clean up after themselves on busy nights (and avoid the fee) caused spilled sauces and sloppy floors.Strange, but explainable.  Lastly, a soft drink with unlimited refills costs $2.60, which might be the highest priced soda pop in Champaign County.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0005643059733970126,
                    "positive_probability": 0.9994356940265893
                },
                "stars": 4
            },
            {
                "review": "Oh...my god, Becky, look at that Gen Tsos.  It is so crispy.  It tastes like one those authentic chinese restaurant's entrees.  But you know, where can you find one of those authentic restaurants, anyway? I'm only eating it because it's so damn tasty.  I mean, I'm not even hungry anymore.  It's just so....GOOD.Fantastic food, plentiful portions, downright delicious.  I've lived here a while before I came here and WOW, is it good.  I hate to say it, but skip Rainbow and try this.  Looks like a Dim Sum hall inside (but no dim sum so far as I noticed), clean, fast, and the first place I have been to in a while that does crispy chicken right.  Try the Gen Tsos or the cashew chicken.",
                "reviewer_id": "QBoFgFqWhGgJhgJzbQ5tYQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07335466135049473,
                    "positive_probability": 0.9266453386495095
                },
                "stars": 5
            },
            {
                "review": "Very good Chinese food.  Incredible array of dishes to choose from.  I would recommend going with someone who knows what they're doing though because most of the items are in Chinese and the English language menu is far shorter.  Golden harbor loses a star because two of the six dishes we ordered were distinctly average (chicken w/ mushrooms and beef in sweet garlic).  Also, comments about them stuffing too much in each container are accurate, we had some spillage to deal with when we got home.  This is a welcome problem of course.",
                "reviewer_id": "Qlj-6eVV-tKWSPZ-JQFVVQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.043851780270977934,
                    "positive_probability": 0.9561482197290184
                },
                "stars": 4
            },
            {
                "review": "Being Chinese myself, this restaurant is definitely in my must go list. They make some real wonderful Chinese food and the price is reasonable . Their tastes are favor southern part of China and I think the owner is Taiwanese, nonetheless, being this far from China and you can still have some nice local Chinese food just purely awesome.",
                "reviewer_id": "qvYlq_1KTP26IcZcLMQghg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2524707591517461,
                    "positive_probability": 0.7475292408482543
                },
                "stars": 5
            },
            {
                "review": "I came here for a Yelp event with about 30 people. We got to try about 12 dishes! My favorite was the Pork Belly Buns and Crispy Tofu. Everyone working here was incredibly friendly and accommodating... Service with a smile :) This is a great place for big groups to come and share many dishes. The menu is in all chinese on the wall, and while they offer an English menu, I recommend you bring along someone who is fluent. (or just knows what they're doing)The food is authentic and they offer complimentary tea with your dinner. If you pay in cash, you get a 5% discount. Check this place out!",
                "reviewer_id": "qXiN4Gi9N0FOeQYoeiWU8g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004722199566205962,
                    "positive_probability": 0.9952778004337999
                },
                "stars": 5
            },
            {
                "review": "Great food and atmosphere, although a bit expensive. The food and atmosphere is really authentic, with a huge authentic Chinese menu on the wall. There is also a shorter Americanized menu available for those who are overwhelmed by the full menu with over 1300 items. Another plus is that water and tea is free. The food was excellent, with large portions and fresh ingredients. I ordered #590 seafood hot pot, #1503 fried dumplings, #1548 beef with chinese broccoli,  and #101 beef ho fun. I would rate the food a five stars. The service is extremely quick for the quality of the food. Although the restaurant was pretty quiet when I ordered, my food was delivered to me in within five minutes of ordering. I would usually expect a moderate to long wait at restaurants of this type, so I was pleasantly surprised at the speedy service. Overall a great restaurant although a bit pricey.",
                "reviewer_id": "qZpkw9oFYughFfAFtTM8Ig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004741717419365321,
                    "positive_probability": 0.9952582825806281
                },
                "stars": 4
            },
            {
                "review": "Overall it is a nice place to enjoy various Chinese food from Taiwan to Sichuan. But i think the most dishes are too salty.",
                "reviewer_id": "r_qusk0u1v7kAOek0LK7xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05011341302156236,
                    "positive_probability": 0.9498865869784384
                },
                "stars": 3
            },
            {
                "review": "This is as authentic and high-quality as it gets in Champaign.  And they set the bar high.   Incredible vegetable rolls and I like the quality of their dishes.   They have an amazing amount of options on their menu as well.  This is simply a great place to go if you're looking for Chinese in the area!",
                "reviewer_id": "rKKSvOCm4YjbowQNjDXZZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07218539641426107,
                    "positive_probability": 0.9278146035857349
                },
                "stars": 5
            },
            {
                "review": "Everyone needs to eat here once if you like chinese food. This place is so amazing it will make you hate all the cheep dives in town (Hot Wok, No.1 Wok, etc). Number 305 (crispy shreaded pork) is a family favorite along with the Crispy Tofu, Fried Basil Chicken.",
                "reviewer_id": "rQ7arVWx_IfTXbnWBfqG9w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03675181221448709,
                    "positive_probability": 0.9632481877855147
                },
                "stars": 5
            },
            {
                "review": "Considering the scale of the operation they have going on there, I'm actually somewhat impressed. The food has always been consistently good which surprises me given the fact that their menu is absolutely enormous. The first time there, walking in can be pretty overwhelming, but you quickly realize that their business model is actually rather interesting and pretty efficient. If you have a large group of people, this is an excellent place to bring them to eat.",
                "reviewer_id": "RvYWDZSFv-wL4waACRswrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.033226641663675,
                    "positive_probability": 0.9667733583363288
                },
                "stars": 5
            },
            {
                "review": "This restaurant must be the paradise for Chineses living in Urbana. I've never seen this amount of items in a menu, ever. I got the cheese rangoons, which were delicious, and reminded me of Brazilian cheese \"pastel\". The golden mushrooms on tofu were a fun surprise, we thought they were noodles! My vegetable with sweet garlic sauce was very yummy. And cheap! Don't miss it!",
                "reviewer_id": "s7_H57sW8Wb1enDJhbVffw (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009215004267211955,
                    "positive_probability": 0.9907849957327866
                }
            },
            {
                "review": "This restaurant must be the paradise for Chineses living in Urbana. I've never seen this amount of items in a menu, ever. I got the cheese rangoons, which were delicious, and reminded me of Brazilian cheese \"pastel\". The golden mushrooms on tofu were a fun surprise, we thought they were noodles! My vegetable with sweet garlic sauce was very yummy. And cheap! Don't miss it!",
                "reviewer_id": "s7_H57sW8Wb1enDJhbVffw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009215004267211955,
                    "positive_probability": 0.9907849957327866
                },
                "stars": 5
            },
            {
                "review": "so underrated...but BEST.TOFU.ever. crispy or bbq tofu... get get get someeee",
                "reviewer_id": "se3OZ6AyYO-w-Kts0XUKxQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.530844365196395,
                    "positive_probability": 0.4691556348036048
                },
                "stars": 5
            },
            {
                "review": "I wish I could have eaten the food at the restaurant! We got take out and ate at our hotel two miles away, and by the time I got back, everything had leaked curry sauce, the eggrolls were soggy from steam.  :( I can tell it would taste great fresh! The \"Baked\" tofu with vegetables and basil sauce was super good.  It was basically just whole basil leaves, but had great flavor and was not overly salty.  The BBQ pork bun was a lot doughier than I'm used to- and yes I understand they are steamed bread, and always somewhat doughy. I loved the curry, which was not thick and sweet, but just curry-hot.  Vegetables and meats were all cooked perfectly, and the woman who took my order was very helpful in determining whether we wanted \"authentic\" or \"American\" versions of soups and eggrolls. A to-go station had all the chopsticks, utencils, napkins, and sauces.  If I lived in Champaign I don't doubt this would be my go-to Chinese restaurant.",
                "reviewer_id": "spu8ZSng5Rne1mnlNSC9dA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.000140488454047676,
                    "positive_probability": 0.9998595115459469
                },
                "stars": 4
            },
            {
                "review": "Everyone says this is the best place to get Chinese food, and it look like they are right. The menu is extensive and the service is fast and friendly. I've eaten-in and taken-out and the food is always delicious. I don't think you can go wrong with anything you order. The only reason they don't get 5-stars from me is because they are way too expensive. Eating here is not a weekly occurrence if you are on a budget. But once you've had the food here, you won't want to go to any other Chinese restaurant in the area.",
                "reviewer_id": "SRR22GB1nxTEI41_A1qK1w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23054839764673302,
                    "positive_probability": 0.7694516023532644
                },
                "stars": 4
            },
            {
                "review": "Best chinese food. Ever. No, make that Best Chinese Vegetarian food. Ever.I'm a big fan of chinese food and when I have my cravings, I usually have to settle for places that have limited vegetarian options and greasy stir fry that tastes suspiciously like it has duck sauce or oyster sauce. Not Golden Harbor though. The vegetarian menu option runs in pages. Literally. Well, first off, there are two menus to choose from- one is the American menu and the other is the Chinese menu. Both have lots of options in tofu, eggplant and vegetables. There is a super friendly and a sweet lady (who is also the owner) up in the front who processess your orders and you can ask her any question about the dish, she will take her time to explain it to you and what it has. She also makes sure that the kitchen caters to your vegan/vegetarian needs. Once the kitchen messed up our order and we got all meat stuff. When we went back to tell her that it was not what we ordered, she was so apologetic, threw in an order of steamed vegetable dumplings for free and personally made sure that we got our right order this time. Making good food is one thing but being so customer friendly and personal for a popular restaurant is another. Having been to many popular restaurants, with bad service and arrogant owners, I will easily give this place 5 starts and more. My personal recommendation- steamed vegetable dumplings. There are 8 pieces in total and make excellent starter. The outer coat is thin and less chewy (unlike other places where the outer shell is so chewy and thick)If you are a vegetarian and in the C-U area, I would highly recommend this place.",
                "reviewer_id": "swfUUft5Z7jyatGrNoUSpw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 9.30026746134208e-06,
                    "positive_probability": 0.9999906997325307
                },
                "stars": 5
            },
            {
                "review": "Best Chinese food in the C-U. A bit of an unorthodox approach, you go there, fill out your menu ticket, go up and pay (5% discount for cash) and your food is brought to your table. The menu is HUGE! I recommend spicy chicken, though I don't know their exact title for it and the crispy tofu. The place is usually crowded, especially on weekends.Also, although they don't advertise it, it is BYOB.",
                "reviewer_id": "t0gLHXq3s2z3RPFqyP4GsQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14424779629636514,
                    "positive_probability": 0.855752203703637
                },
                "stars": 5
            },
            {
                "review": "This place is THE PLACE to get authentic Chinese food in Champaign. Everything is great on the menu, you really can't go wrong. One of their signature dishes is the \"Crispy Tofu\". But really you can't go wrong with anything there unless you order something outside of your spiciness range.",
                "reviewer_id": "T2KFiEUzg1QdiJCO9IvLPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0390141831759856,
                    "positive_probability": 0.9609858168240125
                },
                "stars": 5
            },
            {
                "review": "Golden harbor never disappoints. Yes, its a tad pricey, but for what you're getting, there is nothing better in Champaign. Definitely try the Basil Chicken or the Crispy Tofu. Plus, Sophie is a gem!",
                "reviewer_id": "T3_rzDrub-aQYGCB1nydgQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3113857758576514,
                    "positive_probability": 0.6886142241423483
                },
                "stars": 5
            },
            {
                "review": "The mother of all menu is indeed supreme. The fried rice and crispy tofu are absolutely right on! Green beans in light garlic sauce is perfect. The steamed fish indicates the chefs are not Cantonese but unless you are, you will just enjoy good fish. Eggplant is lackluster. I will trek from Chicago to visit UIUC for the food. 'nuff said.",
                "reviewer_id": "t3Db5XLZEPscxzXBoD70lg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005681236760128311,
                    "positive_probability": 0.994318763239869
                },
                "stars": 5
            },
            {
                "review": "My friend was the only non-Chinese person here!  It must be good!  :)  We just ordered using pictures of dishes from Yelp.  They figured out what the dishes were.  The soup and fried rice were great, but I don't know what they are called!",
                "reviewer_id": "tfxU4RXkpDYTE1J77_Jbag",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.023578099529559804,
                    "positive_probability": 0.976421900470444
                },
                "stars": 5
            },
            {
                "review": "All of my Chinese friends rave about this place. I went here and while the price is a little more than your average Chinese restaurant on campus, the food is top notch. The best tasting Chinese food on campus bar none. The portions are huge too.",
                "reviewer_id": "TpGTyk-NuepCXxsda8iXUA (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3294427311955459,
                    "positive_probability": 0.6705572688044523
                }
            },
            {
                "review": "All of my Chinese friends rave about this place. I went here and while the price is a little more than your average Chinese restaurant on campus, the food is top notch. The best tasting Chinese food on campus bar none. The portions are huge too.",
                "reviewer_id": "TpGTyk-NuepCXxsda8iXUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3294427311955459,
                    "positive_probability": 0.6705572688044523
                },
                "stars": 5
            },
            {
                "review": "I am going to keep this review short and sweet. I have had a lot of Chinese here in Chicago, but this place beats them all. I love GOLDEN HARBOR. I have never been disappointed with any of their dishes. Here are some of my favorites:// Crispy tofu - must try. I think its amazing and light. My one Chinese friend informed me that this was NOT the best he has ever had but I don't believe him. // Szechwan beef - This might be my favorite dish. The meat is so tender, you would never believe it came from a Chinese restaurant. Ha!// Sesame ball - these are stuffed with red bean paste. I can't tell if they are a dessert or an appetizer. Either way it is delicious// Hot and Sour soup & Egg drop Soup - the MSG is to die for... haha I think i like the Egg drop soup a little more. The consistency is soo perfect. All in all, go to this place. SO GOOD.",
                "reviewer_id": "TQAdJlyYyVWyj7fs1qIWYg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9556585114228149,
                    "positive_probability": 0.04434148857717962
                },
                "stars": 5
            },
            {
                "review": "Their General Tso's Crispy Chicken is normally served without vegetables.  I asked them to throw in some water chestnuts and, served over fried rice, the result was wonderful, amazing, epic...what can I say?  I live in the Chicagoland area, and this was one of the best Chinese dishes i've ever had, period.  Now that my daughter has enrolled at U. of I., many return visits will be made.  I'm already plotting the next one.",
                "reviewer_id": "u9dF_geYBuAWO8pxJ2puHQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1596885592115156,
                    "positive_probability": 0.840311440788488
                },
                "stars": 5
            },
            {
                "review": "I don't write many five star reviews.   And didn't really expect good Chinese food in such a small town.    The service is sit down cafeteria style.    You write your table's order on an order pad and pay at the front counter.   The give you a table number and bring the food right out.    Very easy and low stress way to dine, though perhaps it may confuse some.Tea and water are provided for free.   This restaurant is BYOB, and there's a nice liquor store next door.PROS:   Amazingly authentic menu!   I've lived in China and traveled there extensively, and found many of my old favorites on the menu.   (A Chinese menu is posted on the wall with item numbers that correspond to the English language menus.)    I got to enjoy food I've haven't had in years and never thought I'd find in the US -- great stuff from several regions of China.    I also enjoyed some items that I hadn't had before, or had enjoyed in slightly different forms.   The crispy tofu for which this restaurant is so well-known is a fun item that everyone should try.   The pork bun is amazing!  Well-seasoned fatty deliciousness.    So many items to try.   I wish I lived in the area.CONS:   None at all.   I hope this place never changes.",
                "reviewer_id": "UHeQUCvkGBN-6UYmFYHxcA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.044002134354493266,
                    "positive_probability": 0.9559978656454983
                },
                "stars": 5
            },
            {
                "review": "Average at best Chinese place. The service here was poor. No one asked or cared that I was in to eat. If you don't know what you're doing no one will assist you. You have to ask for everything. The food is a tad pricey for the quality. The portions are descent but the overall quality of the food is flawed. Very bland at best. The Mongolian Beef was nothing to brag about, nether was the curry chicken. I was hoping for better tasting food but experienced average at best.",
                "reviewer_id": "uhw4jPdmMBqJXHg5KvLJww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1672225387274747,
                    "positive_probability": 0.8327774612725228
                },
                "stars": 2
            },
            {
                "review": "Suggest big party to go there. So that everyone can pay less and try more! Dishes are fairly good.",
                "reviewer_id": "UQ8iuU6IKnS8vzUTcL7VLA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3764057140549036,
                    "positive_probability": 0.6235942859450955
                },
                "stars": 4
            },
            {
                "review": "I feel lucky that I can found a restaurant like this in Champaign. It tasted good though.",
                "reviewer_id": "USGuicC53ZOwIVN99d9LIg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26761307303905185,
                    "positive_probability": 0.7323869269609473
                },
                "stars": 4
            },
            {
                "review": "Probably (definitely) my favorite Chinese restaurant in town. It has more traditional authentic Chinese dishes but also Americanized dishes if that's your preference. My favorites are the Singapore rice, fried tofu and basil eggplant. And the Kung Pao chicken is great also.",
                "reviewer_id": "Va-MEqffAp5YOHFciwBkUw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005443210176832467,
                    "positive_probability": 0.9945567898231688
                },
                "stars": 5
            },
            {
                "review": "Excellent food. Best Chinese hands down.",
                "reviewer_id": "vCh812goLfIoFxtUVoyXJg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45754716981132093,
                    "positive_probability": 0.5424528301886793
                },
                "stars": 5
            },
            {
                "review": "We have a weekly tradition of family style dinner with friends at GH and wouldn't change a thing about it. We were introduced to this place by a friend of the family that owns it - which was fortunate because we had plenty of help navigating the extensive & extremely diverse traditional menu. In short, the portions are large (hence family style dining), food is very flavorful, and you'll be rewarded for trying new things! If you avoid peak times (dinner Fri & Sat), there is rarely a long line to order & food comes out fast (& piping hot!). If there is a wait, it's still well worth it!Our favorite dishes are salt and pepper chicken, spicy green beans with pork, crispy beef with garlic, pork belly buns, crispy tofu and sesame balls for dessert - just to name a few. Hot jasmine tea is complimentary and it is BYOB so we typically bring a bottle of plum wine along, too. (Am-Ko carries a nice selection of plum wine and is right around the corner.) This is a great place to come with a group of friends (lots of big tables), pick out a handful of new dishes and eat family style. Enjoy!",
                "reviewer_id": "vcQfQJo3vdbCBeqeqo5rUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 6.70121121946806e-05,
                    "positive_probability": 0.9999329878878124
                },
                "stars": 5
            },
            {
                "review": "I am not Chinese, but my boyfriend is, and he says this place is close to what his family makes, so I believe him :). That said, I've had a lot of great food here. Chen-do chili chicken, eggplant, beef ho fun, stir fried bok choy and a fried melon dish are a few of my favorites. At first it can be confusing to order, and I've seen a lot of people look overwhelmed by the menu and people milling about the counter. I say: DON'T WALK OUT! Ask the lady at the register (daughter of chef) and she can help you. Highly recommend.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.16282540462131537,
                    "positive_probability": 0.8371745953786887
                },
                "stars": 5
            },
            {
                "review": "This place is amazing! I will give it \"ten star\" if I could! I love the food, love the service, and most importantly, the dishes came out so fast even during the busy hours. This place has become my routine for a year. I have never tried anything from the English menu, so I can't give a review on that.",
                "reviewer_id": "vgRqol2shgiXsD9_1ZDxIQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13012408401819642,
                    "positive_probability": 0.8698759159818024
                },
                "stars": 5
            },
            {
                "review": "I have been to Golden Harbor a few times and done take out a few times. This place is great. I haven't had even a 1/4 of the dishes they offer but so far the ones that I have had have been excellent. Yes the Crispy Tofu is amazing. The crispy orange chicken and the orange beef were very tasty. I really enjoyed the Taiwanese Salt n Pepper Crispy Chicken. We had one of the Hot Pots but I don't remember which but I wish I did because it was really good. I also tried the Crispy Cuttlefish with salt yolk which I was very surprised by how good it was, I though it would be too salty but it was quite tasty. The service is always pleasant and now that they have their system down the wait time is very reasonable. Each dish is large so it is best to go with a lot of people and that way you can share many dishes. Looking forward to the next time I get to go.",
                "reviewer_id": "vgx_L9BBd8DSSGidBJ6GUQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0006587113405249114,
                    "positive_probability": 0.9993412886594714
                },
                "stars": 4
            },
            {
                "review": "HOLY COW! I am originally from New York and because of that it is hard to find Chinese food that really impresses me. This has been one of those places. My boyfriend and I were moving in from out of town and his parents were here to help. We wanted a quick and easy takeout meal to thank our helpers. They suggested Chinese. I was a bit skeptical about finding good Chinese food in central Illinois. My skepticism is long gone! We ordered tofu and mushrooms, Kung Pao vegetables, bok choy in garlic sauce, vegetable and tofu lo mein, hot and sour soup (amazing!), and egg rolls. I'm not normally a fan of egg rolls, but I thought they were ok. They lacked filling for my taste, the inlaws agreed. My favorite part of the meal was the hot and sour soup. It is my favorite, when done right and not many places do it well. I am glad to say that they do an amazing job with it here. Best of all they are very reasonably priced! This is definitely my go to place in town for Chinese food. I don't even want to try anywhere else because we had such a great experience here. Even the boyfriend that isn't crazy about Chinese food wants to go again!",
                "reviewer_id": "vR5ZK9AtwSY9YIsG-jLYBw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.750428251444835e-06,
                    "positive_probability": 0.9999962495717467
                },
                "stars": 5
            },
            {
                "review": "My go-to place in Champaign for comfort food. I got my roommate and family addicted too.",
                "reviewer_id": "VS89OpdxlLsD7tLtmqjcUA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.36872283474727213,
                    "positive_probability": 0.631277165252728
                },
                "stars": 5
            },
            {
                "review": "OMG, this place reminds me of mom's home cooking.The stewed chicken in Szechuan sauce is out of this world.  This dish alone reminds me of mom, dad and us 9 kids eating dinner at the table.Has just enough salt to add flavor, spiciness to give it that lovely kick and a hint of lemongrass to remind me of home.The pork belly was good but not great, I would order it again.  The star of anise was a bit overpowering.The time it takes to prepare these wonderful dishes are amazing, considering the size of this place and the volume they are very quick.Highly recommend it!",
                "reviewer_id": "vsiQmP-XXKZqDETydzbW4A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.12178761779216028,
                    "positive_probability": 0.8782123822078404
                },
                "stars": 5
            },
            {
                "review": "\"Why didn't you take us here earlier?\" - My dadI've been at UIUC for 4 years, and in my last summer, I finally went to Golden Harbor. My parents visited me, and we have visited our fair share of local restaurants. This is probably one of the best things I have ever had. The Crispy Basil Chicken is the best variation of fried chicken I've had here in my time in the land of fried foods. I also had mixed vegetables with seaweed and shrimp-filled wonton soup, which were also glorious.I love my tea, and the fact that it is free and self-serve for pots of jasmine tea make my inner Uncle Iroh happy.",
                "reviewer_id": "w3K0UQHHT8Oht5eTSIAc4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.036332391649178,
                    "positive_probability": 0.963667608350813
                },
                "stars": 5
            },
            {
                "review": "We get the hot and sour soup Taiwanese style no meat, crispy tofu (sauce on the side), and some greens. For dessert we get the sesame balls.  Great food.",
                "reviewer_id": "wgdCHuRBx-36KAyRn-AMtg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8573330831220418,
                    "positive_probability": 0.1426669168779565
                },
                "stars": 5
            },
            {
                "review": "We loved our meal. My mom is usually intimidated by places  like this but the server at the counter was so nice her anxiety was quickly settled and she volunteered to get our hot tea (free) and water. We got the crispy tofu (wonderful), a hot pot, and buns. All were yummy and so different. Portions are BIG. The hot pot is not what we thought (no crispy rice). We would come back in a second. My mom said, \" this is a place I will wish I could have when I am home.\" Also, I should add my father is a chef and we are fairly hard to please.",
                "reviewer_id": "WQGlZzDGrtCf0SmgtNpmXg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14654019201949128,
                    "positive_probability": 0.8534598079805114
                },
                "stars": 5
            },
            {
                "review": "Try the crispy tofu! It comes out very hot with a nice sweet sauce. Perfectly crispy. Almost like a dessert for dinner. I would not recommend choosing something off the menu wall blindly. I've been stuck with some interesting meat dishes I wasn't ready for, despite being fairly adventurous for my Midwest roots.",
                "reviewer_id": "WTF9ks27byOYQjv63z40Sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.01786314247410774,
                    "positive_probability": 0.982136857525895
                },
                "stars": 5
            },
            {
                "review": "Good place to go when you want Chinese food. They have causal environment; good for friends reunion and/or family meals.",
                "reviewer_id": "wVQab8RRmPwhQ2fGiQnhyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.29632727899430766,
                    "positive_probability": 0.7036727210056926
                },
                "stars": 4
            },
            {
                "review": "The ordering process is just ridiculous.  I enjoyed the food when they were Mandarin Wok, so we tried to eat at Golden Harbour.  The menu was SO EXTENSIVE as to be completely intelligible (with little to no description of each dish) and the ordering was so completely annoying for a party of two that just wanted to order two small entree-sized portions (VERY RARE thing here) that we left without ordering.  There are a lot of options for Chinese food in this town, ones with a MUCH better dining experience.I have however had a few take-out dishes from Golden Harbor that someone brought to a gathering and they consisted of relatively the same brown sauce with different vegetables, some with mushrooms, some with squash, some with greens.  Rather ordinary, nothing terribly special.",
                "reviewer_id": "wZ2B3_9CiWUQCd6hS156Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04452682271420089,
                    "positive_probability": 0.9554731772858017
                },
                "stars": 2
            },
            {
                "review": "Best Chinese food I've ever had. First place I take people when they visit from out of town. Only place I go to celebrate.",
                "reviewer_id": "x112uRZb_ObZUjt5Oif5IA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.24960747313169923,
                    "positive_probability": 0.7503925268683019
                },
                "stars": 5
            },
            {
                "review": "My favorite place to eat in chambana. Crispy tofu and 3 cup tofu is amazing. We go there atleast once a month. Great for big groups.",
                "reviewer_id": "x39V93vo7fSJnxiwxZ-YdQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.454915211981117,
                    "positive_probability": 0.5450847880188822
                },
                "stars": 5
            },
            {
                "review": "GIGANTIC menu! Everything I have tried here was tasty. A great place to go in a group, order a few dishes and share. We have had several parties here and everybody has loved it.It is also BYOB, another plus for parties.",
                "reviewer_id": "xGkgSpo-PHONO9wIpTcQ4w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.022021205057784907,
                    "positive_probability": 0.977978794942215
                },
                "stars": 5
            },
            {
                "review": "By far the best tofu in town.",
                "reviewer_id": "XOKy3A0DCZuzeglHZw76XQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4229469800095661,
                    "positive_probability": 0.5770530199904339
                },
                "stars": 5
            },
            {
                "review": "Golden Harbor is my go-to Chinese restaurant. The menu is huge, the restaurant is excellent for groups, and it's great that they offer private parking.My friends had to guide me through the ordering process where you look at the extensive menus on the wall (both in English and Chinese), fill out an order ticket and give to the cashier. Simple.My favorite dish - or at least the one I keep coming back for - is the crispy tofu. They make both a family and lunch special portion that are priced accordingly.Food is delivered to your table but you must bus your own dishes unless you want to pay extra. Hot tea is free.Warning, this restaurant is popular so if you plan to come with a group, try to come for an early dinner.",
                "reviewer_id": "XOnwygK-EerILmQSxP2K6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.021868673647045075,
                    "positive_probability": 0.9781313263529507
                },
                "stars": 4
            },
            {
                "review": "Sesame Balls:  awesomeHot and Sour soup:  below average.  Great number of veggies but broth not to my taste.The crispy tofu was great but would be better if it was done a little more on the inside",
                "reviewer_id": "xTovmkZx-EivsEhlLcXA8Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6676721175553478,
                    "positive_probability": 0.33232788244465394
                },
                "stars": 4
            },
            {
                "review": "It was the night of the MayPac fight and since we had pizza the night before, we opted for Chinese.We've had most of the local places, but Golden Harbor has been on the list since I first came down.We phoned in our order for pickup and the cashier was very friendly and spoke nearly perfect English. My questions were answered and my order taken correctly, how easy!2 of us tried our hands at the Chinese menu, whereas one of us opted for the more simplistic Orange Chicken, which he said might have been some of the best he ever had. I got something called Chengdu chicken and my other roommate got a seafood combo with rice noodles. Unfortunately I was the only one who didn't really care for my dish. Don't get me wrong, it was different and the meat was of noticeable higher quality than the usual Chinese places around here, but the flavor just didn't grab me that much. I also didn't really care for the green veggies inside (raw zucchini or celery, maybe..?).The cost was significantly higher than typical Chinese, my dish was ~$14, granted the portion was enough for 2 large meals.I will have to try something else. I feel like Chinese food is always a gamble, usually I win, but this time I got unlucky and lost.",
                "reviewer_id": "XzIKZTb4I-7wW4BjKwV2Mw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00726228316441993,
                    "positive_probability": 0.9927377168355652
                },
                "stars": 3
            },
            {
                "review": "Absolutely fantastic place, so many options and all of them excellent! Also, although coming here with Chinese friends definitely helps, the fact that they have a translated version of the Chinese menu (as opposed to just an Americanized menu) means that even if nobody in your group knows Chinese you can still order interesting, authentic dishes. That said, definitely come as a group, as large as possible, and sit at one of the tables with a wheel in the center. The portions are large, and its great to share and try different things. Personal favorites here are the famous Crispy Tofu, anything with rice noodles (they do them perfectly), and what they call casseroles in English.",
                "reviewer_id": "XZXnUCqeFzmvgIq14V0J3Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00039106079874611546,
                    "positive_probability": 0.9996089392012437
                },
                "stars": 5
            },
            {
                "review": "This is the highest standard for real Chinese food (not Americanized) in, at least, the CU area.I have been there for about 10 times and 10 out of 10 they proved to me that their dishes are worth the price.In busy times it might take quite a while before you can order and get seated, so plan accordingly.",
                "reviewer_id": "Y7TaGvsfK8wbKoIkqMguOg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04598831568791128,
                    "positive_probability": 0.9540116843120849
                },
                "stars": 5
            },
            {
                "review": "5% discount, ",
                "reviewer_id": "y9ZRveVYCIZa7XONp1LGow",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.5,
                    "positive_probability": 0.5
                },
                "stars": 4
            },
            {
                "review": "An abnormally voluminous menu is the outstanding feature of this Chinese joint. The food is excellent in flavor and value, almost without exception. This would thus be one of my very favorite places, except that the service is minimal, haphazard, and somewhat ill-planned - absurdities like a line out the door with 90% empty tables being not unknown - and the place seems to try too hard to establish its bonafides as authentic. I'm sure it comes by these cons honestly, and possibly they bother you less than they do me; either way, check it out!",
                "reviewer_id": "y_hFQ7wyFFnodoMZ2quw5Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.31420236215959496,
                    "positive_probability": 0.6857976378404069
                },
                "stars": 4
            },
            {
                "review": "When I first walked in, there were a bevy of confused customers, walking in a circle, trying to figure out how on earth to place an order. Everything was written in Chinese, except, of course, for the giant sign on the wall, with moderately clear instructions (it's above the table on right, just as you walk in.) So, we took a menu, an ordering pad, and a pen, and sat down. You write the number of the order, not the name, on the pad. They didn't indicate whether you should write the type of rice you wanted, but we did so anyways. You then take the pad to the cashier (they're was a decent line) and pay for your order.Over the next 20 minutes, the wait staff bring your dishes to you. The first dish arrived easily 5 minutes before the rest, so I ate a lot of that... But it was sooooo darn delicious, and the helpings were generous. We spent about $70 for 5 heaping plates, a pot of tea, and two sides of rice. However, I did ask the busboy if he could bring me to-go boxes, and he never did. Granted, we're not supposed to tip, so there's that.Overall, it's well worth the confusion and questionable service. I'm pretty sure their system is there to optimize price and quality. The only thing I dislike is the shoddy directions. I feel like a big \"seat yourself sign\" with menus and an ordering pad at the table would eliminate the constant stream of bumbling newcomers. Or simply placing the sign immediately in the view of the entrance, instead of high on the wall to the right. Otherwise, it was a delicious adventure!",
                "reviewer_id": "yiRhtbRF-DHNnX3dfE8jFw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8234768557741637,
                    "positive_probability": 0.17652314422582777
                },
                "stars": 4
            },
            {
                "review": "Best Chinese food in driving range of UIUC! Believe the reviews about the crispy tofu; it's really that good. I've been here maybe 10 times and have never been disappointed. The optimal way to eat here is with a group of 4 or more people so you can share many different dishes! I haven't had any bad dishes, but some that were particularly good are: Crispy tofu (of course), Basil fried chicken, Taiwanese fried chicken, and salt and pepper fish.If you go on a Friday or Saturday night, expect a very long waiting time if you go any time after 6pm. It might be difficult to find a table, especially if there are 4+ people in your party. If you plan to go during that time, make a reservation!",
                "reviewer_id": "YoS_VTXsYXicWFW_kPDUtQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6766322541577832,
                    "positive_probability": 0.3233677458422191
                },
                "stars": 5
            },
            {
                "review": "Before I get into the food, I have to say that one of the _greatest_ things about eating here (or getting things delivered/to go) is the service.  Talk about bend over backwards!  You want them to do Princess Chicken with sliced carrots and a side of sauce?  You got it!  You want your fried noodles with a side of pea shoots and baby won-tons?  You got it!  Okay, wait... that last one I might be making up, but the first, dude... I get it every time!Alls I'm saying is-- these people will do everything to make your order, NAY, your EXPERIENCE something awesome.  And that's a restaurant I can get behind!The food is excellent.  Rice is the perfect consistency (not too dry, but not wet, either).  Their sauces are incredible (try the Princess for a spicy kick, or the Empress for something a little spicy-sweet).  Their veg is even good in my book, diced or sliced thin, not overbearing!  Everything is just hot, and yummy, and delicious and my favorite, not too hard on the wallet.Golden Harbor is located in the old Pickles location (trust me, a Champaign paragon in its day), so it's pretty much central to Champaign, Urbana, AND Savoy. Tell them where you're coming from when you order and they'll make sure the food is separated out in containers that keep things from getting soggy on the way. Whether you choose to eat in (now that they have the ventilation under control) or decide to carry-out, Golden Harbor Authentic is one of the best Chinese places you can choose in C-U.",
                "reviewer_id": "YtbXNQJEJAHZK_2DFXSa6w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.07918521827805962,
                    "positive_probability": 0.9208147817219391
                },
                "stars": 5
            },
            {
                "review": "There was some time, in what seems like ages ago, that I lived immediately outside Chinatown in Chicago. While Chicago is certainly not known for having the best gathering of Chinese food in the country, we certainly made do with some wonderful meals. The short of it: going to Golden Harbor makes me feel like I'm back in the city. I absolutely loved the food. I loved it so much that I'm currently laying on the couch because I can't move. It's good stuff, Maynard. I scoured the reviews and we ordered most of what others liked: crispy tofu (good, but I probably wouldn't order it again); crispy chicken basil (amazing with just the right amount of kick!); salt and pepper prawns (OMG salt and pepper anything, really, but these were great and had some kick, too); 1/2 Peking duck (okay, they give you tortillas instead of pancakes which kind of sucked but the hoisin and scallions were great and the duck - OMG - the duck! so moist and perfectly fried); Chinese pork fried rice (decent, I suppose, but didn't have a ton of flavor without soy sauce -- but, to be fair, I'm not a huge fried rice lover); steamed BBQ buns (always good, of course); and my brother got the general tso's chicken (not normally a fan of this dish because I think it's too sweet, but this version was less sweet and I really liked it).  Sophie at the front was maybe the most adorable girl ever and so helpful. :] She even threw in a thing of sesame balls that were incredible. So unique tasting and their sweetness was surprising. The menu is overwhelming and the seating is chaotic. I'm glad we took our food home with us to enjoy. I get panicky in places such as this sometimes, and I certainly couldn't have picked what to eat without the help of the yelp reviews; the menu is like 20 pages long and an anxiety sufferer's worst nightmare. This is what keeps me from giving it a full five stars. Next time I'm in chambana visiting my brother, I will certainly go back. Bravo, GH. Thank you for restoring my faith in Chinese cuisine.",
                "reviewer_id": "ZHWg4a30m7o7QJd51eTI8w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.720475210280607e-06,
                    "positive_probability": 0.9999912795248039
                },
                "stars": 4
            },
            {
                "review": "The Good:-The Shrimp with Mushrooms! It is so delicious; it's very simple with just onions, shrimp, and mushrooms, but it is delicious.-The Sweet and Sour Chicken. It is really delicious, and the chicken pieces were very large.-The white rice was steamed very well.-The fried rice was lighter than typical fried rice, and my S.O. said it was very good.-The customer service was really nice! You write down your own order and take it up to the cashier (who's really nice!), and they take care of everything from there. Water and hot tea are complimentary. The Meh:-The crab rangoon were okay, not great, but okay.-The vegetable dumplings just okay. The dumpling skins themselves seemed very, very thin, causing them to tear when we tried to pick them up. -The shrimp dumplings had mixed reviews (between my S.O. and me). I thought they were okay, but my S.O. was not a fan.The Bad:-NothingOverall:-I really liked coming here, the entrees were very good. I also really liked the atmosphere, it felt like a family run restaurant, which I always appreciate. We will definitely be back!",
                "reviewer_id": "ZjxfO0xvmxZ7BiNUg7ejjQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.021956182583022222,
                    "positive_probability": 0.9780438174169871
                },
                "stars": 4
            },
            {
                "review": "I love the lunch portion here because it's not too big for me.  My favorite lunch specials are Crispy Tofu, and Broccoli Chicken.  As for dinner, I love Basil Chicken I wish it came in the lunch portion too.  The only concerns I have at this restaurant are that tables are often dirty and the restaurant setting doesn't creat a relaxing dinning ambiance.  Will definitely go back!",
                "reviewer_id": "zkoMX4cSeV5LXbB7wAYU3A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6556220447390462,
                    "positive_probability": 0.3443779552609562
                },
                "stars": 4
            },
            {
                "review": "Another proof of what people who live here will put up with. I walked in the door for dinner on a wintry evening and due to a serious ventilation problem found myself enveloped by invisible choking fumes. The fumes were from cooking peppers, I'm guessing? They didn't smell so much as they burned and choked. Some sort of fan in the kitchen must have been broken -- seriously, it was comical. I am not reporting an individual sensitivity of mine.  A very large party arrived just after we did and so I got to watch about fifteen people walk in the front door and then sequentially have the same reaction: walk in from the cold, take a deep breath, and start coughing.We all went along, I'm not sure why.  The restaurant was about one third full and all of the patrons sat there, tears in our eyes, each eating a few bites and then experiencing a racking cough.  We went through the bizarre ordering process and obeyed the greasy cardboard hand-lettered signs. So many of the other reviews rave about the food but mine was extremely oversalted.  Oversalted, after all this?Even if it had been Michelin three star food, you've got to have air.  My advice: Focus on the basics.",
                "reviewer_id": "zq815p7o2OM1kNHG8OdobA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1956621024253066,
                    "positive_probability": 0.8043378975746849
                },
                "stars": 1
            },
            {
                "review": "Yes, the incredible number of choices can be daunting- but oh the fun you will have trying things out!  Food comes out straight from the stove (be careful with that first bite) and is well worth the wait.One of the reviewers mentioned a review in the Champaign Taste blog that might give you ideas of what to order. Another blogger has been posting pictures and descriptions at http://goldenharborchineserestaurant.blogspot.com/. I was inspired by one the pictures to order #896 (Snow pea leaves with King Mushrooms) - which included the greens and two kinds of thinly sliced mushrooms in a savory brown sauce (with lots of whole garlic cloves). Wow. In Hawaii, we would say \"broke da mouth\"!A warning - we arrived at 5:30 PM on a Saturday, and a lot of the tables were already reserved (which meant not a lot of tables left for walk-ins). If you have a party of more than 2-4 you might want to call ahead on a weekend.  Even if you have to wait, it will be well worth it!",
                "reviewer_id": "ZqsuI9ytbQpxTFuaaWRJ7g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4130708156374585,
                    "positive_probability": 0.5869291843625603
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "i0_W9_1abdjBS7d5-pWORQ",
            "rE8048_DAh3Z8Tep466wrA",
            "DB5rZ9spvyhBJsqOwckncw",
            "M5E7DW8rqI4v37HhD2pzGQ",
            "Kck9wE9Z1S_xxzglh1Qdwg",
            "u06X5C_pIAVuOXOznIcPYw",
            "qRgEy-m4sejzTKphIFKFkw",
            "fxYiDAxCK33ANk8-QemInA",
            "vubRS4bmJ_8yXpn-67wNZA",
            "umq8alp-uLf3hXnpSC99WA"
        ]
    }
}