{
    "D7ENnY6AzeFxlhNfnVH54w": {
        "keywords": {
            "bigrams": [
                "pad_thai",
                "thai_food",
                "green_street",
                "chicken_pad",
                "thai_restaurant",
                "bangkok_thai",
                "beef_pho",
                "spring_rolls",
                "hainan_chicken",
                "food_campus"
            ],
            "unigrams": [
                "thai",
                "pho",
                "good",
                "food",
                "pad",
                "curry",
                "place",
                "chicken",
                "nice",
                "restaurant"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false,
                "Wi-Fi": "no"
            },
            "business_id": "D7ENnY6AzeFxlhNfnVH54w",
            "categories": [
                "Thai",
                "Vietnamese",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "611 E Green St\nSuite B\nChampaign, IL 61820",
            "hours": {},
            "latitude": 40.110039,
            "longitude": -88.229804,
            "name": "Pho Cafe",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media2.fl.yelpcdn.com/bphoto/A5ilsWz3Ib70uKr3keni2g/ms.jpg",
            "review_count": 24,
            "stars": 4,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "The place was busy and it seemed everyone was either ordering the pho or a thai curry. This place has the best pho on campus! Their Pad Thai portions are also very big and taste great too. ",
        "reviews": [
            {
                "review": "This place has the best pho on campus! The employees there are always so genuine and kind. I am never disappointed after eating here every time. Their Pad Thai portions are also very big and taste great too. I would definitely choose to come here for Vietnamese/Thai food when down on green street.",
                "reviewer_id": "-GIzvin6t5z02_glV3pdgw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.06546755822894117,
                    "positive_probability": 0.9345324417710581
                },
                "stars": 5
            },
            {
                "review": "I ordered the hainan chicken from here and it was essentially four little strips of boiled chicken breast that came with a garlic sauce. The sauce was pretty good but the portion of chicken was just so small. The noodle dishes look alright but don't order the hainan chicken!",
                "reviewer_id": "-zKUepeTKWZWhm51Y8_2Lg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0011262141316576177,
                    "positive_probability": 0.9988737858683434
                },
                "stars": 2
            },
            {
                "review": "Super super super nice owner, place is really clean and the best part FOOD IS AMAZING!!!!! Their fried rice is my favorite, not oily or salty at all, and their pad Kee Mao is great too!!!",
                "reviewer_id": "3M6z3F238IMxdE8hfcjzCQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8848058934168408,
                    "positive_probability": 0.11519410658316273
                },
                "stars": 5
            },
            {
                "review": "I have came here twice now. Once, when it just opened and now again. The first dish i had was the duck rice. It was overpriced and lacking. I was expecting a grilled duck, but they fried it dry. This time, I was recommended to try their yellow curry and they did not fail to disappoint me. Run-down watery curry with meat that taste like dog-food. The taste was bland. Lack the uses of spice and herb. What a disaster.I am from Thailand and I am very embarrassed for them to call this Thai curry.",
                "reviewer_id": "42u6qzyy9rsymvdR9dw3kQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.59288021759576,
                    "positive_probability": 0.4071197824042465
                },
                "stars": 2
            },
            {
                "review": "I walked in shortly after 11am and the restaurant already had a steady stream of people trickling in.   I ordered the beef pho and egg rolls.  Total came to just over $12.    After about five minutes, my soup was ready for me!   It came with the traditional garnishes of bean sprouts, lime and jalapeno (but the mint/thai basil was missing...but i don't use that anyway). At first taste, the broth was solid.   The noodles were clumped up into a ball and despite other reviews, their wasn't a lot of meat in it.  A few meatball halves and the flank steak.  After a few squirts of hoisin and sriracha, i decided that this was just an ok Pho.  Nothing spectacular.... The broth didn't seem like it simmered overnight....there was something a little \"instant\" to it.    The egg rollls were crispy but really lacking any seasoning. I don't think I would order them again.   The pho was just ok... I'd rank it probably second best in the land.   I would prefer to walk down the street and eat At Pho 911 anyday.  The place was busy and it seemed everyone was either ordering the pho or a thai curry.   Welcome to town, Pho Cafe!",
                "reviewer_id": "aSyHqB5QIybJb3npJUy78A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02802378890353906,
                    "positive_probability": 0.9719762110964475
                },
                "stars": 4
            },
            {
                "review": "The two things I tried from the Thai part of their menu were very good, much better than the decidedly mediocre Bangkok Thai down the street, and at least as good as any other order-at-the-counter Thai restaurant in CU.  The portions were quite generous.  I will definitely add this place to my regular Green Street lunch rotation.",
                "reviewer_id": "BtdwnvZcoGGS4a7StMSl2w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7071813584794169,
                    "positive_probability": 0.2928186415205809
                },
                "stars": 5
            },
            {
                "review": "It may not look like it from the outside, with its overly-lit and plain inside. But it's the best far-east food on campus! The time it takes them to prepare the food is slower but it's well worth the wait. You can taste the difference in quality here. I won't forget to mention the kindness of the workers here and it's cheap too! I encourage everyone to try this place out!",
                "reviewer_id": "da-w3Sx9ZMlIl6d7XxOAHQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0406403168595984,
                    "positive_probability": 0.9593596831404037
                },
                "stars": 5
            },
            {
                "review": "The interior is nice, spacious, and clean although terribly plain. Don't come for the ambience. Orders are taken at the counter. I ordered the beef panang curry. It was about $9. The portion sizes were a tragedy. Most of the dish was rice. You can ask for more rice if you wish, which is nice. Essentially, you're ordering rice with a side of curry. The curry smelled lovely. It was very fragrant and it tasted good, but it was thin and unremarkable. The beef was also very thin. I also tried the pad ped with tofu and it was extremely disappointing. Again, the dish had rice as it's star and some marinated veggies on the side that I assume was the pad ped. The flavors were not very strong and I couldn't taste the curry at all. It's hard to believe that this cost $9.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014143441525116441,
                    "positive_probability": 0.9858565584748901
                },
                "stars": 2
            },
            {
                "review": "Restaurant reviewThis restaurant just recently opened up at the end of December when the students were away and it was featured this week in the local newspaper. I was excited about trying a new \"authentic\" thai restaurant. My prior experience at the other pho restaurant was rather disappointing on green street. When you enter you line up to order at the counter, afterwards you are given a number and wait for them to call you for your meal. I wanted to try the roasted duck with rice or the hainan chicken, but I went with a safe order with the chicken pad thai because they recommended it as one of the signature dishes. It didn't take long for the dish to come out, about 5-7 minutes after I placed my order. The chicken pad thai was a bit lacking in texture and flavors. For a good thai dish, you get the nice crunch of peanuts along with the sweetness and soft texture of noodles. There was a few specks of peanuts and nothing more. The flavors also was very one note, not very sweet like at other places, but also not very exciting. Portion size for the price paid was good. My wife had the tom yom seafood dish. No exotic seafood just some shrimp and mushrooms with lemon grass etc. It seemed to lack the sourness which is often a highlight of the dish. It really is a 2-3 star restaurant. I was hoping for better, maybe it will improve the next time.Pros: inexpensive thai food, friendly service, good portion sizeCons: flavors and texture are off, maybe they are new but it just doesn't have that specialness which would make you crave this place for thai foodHidden deals:None",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1656797309919393,
                    "positive_probability": 0.834320269008068
                },
                "stars": 3
            },
            {
                "review": "This is a fantastic place for cheap, fast, and delicious food.  It is not fancy - it is your basic noodle shop, but with a wonderfully nice family running it, a clean, bright environment, and a decent menu. We had the fresh shrimp spring rolls, chicken pad thai (requested spicy), and duck yellow noodle soup.  All were good, but the pad thai was one of the best we've ever had.  At the owner's suggestion, a squirt of lime juice brought it to life (it was already good, though), and the serving was enough for two meals.  The spring rolls were very good, and a good fresh start to the meal.  The duck yellow noodle soup had very generous portions of duck in it, and while it started off a bit bland, the addition of a bit of Hoisin and jalepenos (that's what those accoutrements are for!) it was lovely. I demolished it (and I usually can't finish a bowl of pho). For two, with one meal easily making two meals, we spent $24.  Very reasonable in my opinion. The only minor quibble I have is that there is no basil or mint with the pho or in the spring rolls. I would imagine that's either chef's choice or a cost thing.  I loved everything we got and this will be a regular stop, however, so it must not be that big of a deal to me.",
                "reviewer_id": "HP56L5EKlsmFkZTsOE6ISA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08589126385280048,
                    "positive_probability": 0.9141087361471827
                },
                "stars": 5
            },
            {
                "review": "I ordered tom yum goong which disappointed me so much! the broth is watery and flavorless, shrimp and veggie are too little compare with the price you pay for. Rice were dry and not warm as if it's leftover. What a waste of $10!! Also on the menu I don't see carrot and green pepper as ingredients (I hate them) but there were....yukkk....never again. In short: $10 for the quality of canned soup at grocery store!",
                "reviewer_id": "iZXnZSzTUWdXe_ZNIixgUA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9810452926388153,
                    "positive_probability": 0.018954707361188195
                },
                "stars": 1
            },
            {
                "review": "Tried every single noodle pad style and it was amazing!Great Food.. going there once a day!Flavored perfect! and served quickly!.Definitely going back there!",
                "reviewer_id": "kEQnFhmElRs4Zscmc2FIrw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.683706390984856,
                    "positive_probability": 0.3162936090151453
                },
                "stars": 5
            },
            {
                "review": "Wow! This place nailed it! It's kind of a hole in the wall place... We actually walked right by the first time. We had the Pho, the Pad Thai and Red Curry. All were amazing! Best we have all had in town so far. The owner even brought out our food and the daughter took our order. I asked for fresh cilantro and the owner brought it out!!!! Great service and amazing food. We will be back and recommend it to our friends. What a hidden jewel.",
                "reviewer_id": "kGVK_HmOjliHrKiPGiXmxQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.048790920211623484,
                    "positive_probability": 0.9512090797883734
                },
                "stars": 5
            },
            {
                "review": "One of the good places to eat with friends and relax. The owners are very nice and polite. Highly recommended to try it and it fills you up!",
                "reviewer_id": "KkfMD7Erl0f1UYsncCbN_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.014525694838563067,
                    "positive_probability": 0.9854743051614367
                },
                "stars": 5
            },
            {
                "review": "I would give no star if I could. I should listen to my friend. Will never come here again!",
                "reviewer_id": "KvvrNRG9xvW32r8GCe8u7A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7411066119594083,
                    "positive_probability": 0.25889338804059137
                },
                "stars": 1
            },
            {
                "review": "The beef pho here is delicious! I would venture to say the best on campus. The staff is really nice and the restaurant is very clean. I will definitely be going back!",
                "reviewer_id": "mAgEevmBxDL9v9CoOBKKhQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1135843973810612,
                    "positive_probability": 0.8864156026189369
                },
                "stars": 5
            },
            {
                "review": "Some of the best Thai food on campus, more flavorful than Bangkok Thai and comparable prices and portion sizes. Very nice customer service, super friendly people, very accommodating.",
                "reviewer_id": "OS1cXabQY3UGQynZf6f3xQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1964032141774628,
                    "positive_probability": 0.8035967858225368
                },
                "stars": 5
            },
            {
                "review": "The food here is very high-quality, fresh vegetables, crisply served and perfect flavoring. The owner is a pleasant fellow who interacts with all the customers. The food is served on clean china plates and the restaurant is much cleaner and well decorated than most of the campus Asian restaurants.You'll find it on the south side of Green street between Wright and Sixth.I often get the yellow chicken curry but they sell red curry and green curry with your choice of chicken, beef, pork, shrimp or tofu.Degree of \"hotness\" ranges from #1 to #5 and seems to be an accurate wide range from very mild to as hot as any reasonable person would like.  Ask and you shall receive.Their pho is delicious. Their homemade Ho Fun noodles (wide, chewy and made from rice) are served with the Pad Ke Mao and the Pad Siew.  Great flavors.They cook with eggplant, basil, green beans, carrot, bamboo shoots, onion, potato, depending on the menu item.  Ask questions to make sure you get what you want.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.854970316667432e-05,
                    "positive_probability": 0.9999214502968227
                },
                "stars": 5
            },
            {
                "review": "Really, really good Thai Restaurant. Delicious, well portioned, fresh meals. Reasonable prices. Clean facility. Friendly staff. 10/10 would go again. Try the Fried Rice and the Pho.",
                "reviewer_id": "R3aBQFg584hR9y5QlXXhJg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38115730178898766,
                    "positive_probability": 0.618842698211012
                },
                "stars": 5
            },
            {
                "review": "I came in on a whim on the way to Panera. The words 'PHO' emblazoned on their window caught my eye and I could have sworn there was a pizza place here last time I remembered seeing it. But my hankering for pho overcame my craving for bagels and without any record to be found via Yelp or Foursquare I went in.The interior is simple and a little spartan, but it's fine for a little university eatery. Some decorations wouldn't hurt though.I knew what I wanted coming in. A bowl of beef pho. The decision was a simple one, the only have one option for the different types of meat pho and one size. I wasn't disappointed by the lack of options though. The portion was generous and came out piping hot.The broth was solid, with a nice round taste and slightly sweet ping. I added some sriracha due to my love for some kick. No hoisin needed for me! The noodles were good. Hard to get those wrong. Now we get to the meat. Generous amount of meat slices, brisket, and meatball halves. The slices themselves were a little well done, but the taste was still good.All in all, I'd have a hard to choosing between Bangkok Thai and here for a good bowl of pho. Guess I'll have to take turns!",
                "reviewer_id": "Xwt0LinDiYavllo6XxJmnQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3272149946318566,
                    "positive_probability": 0.6727850053681457
                },
                "stars": 4
            },
            {
                "review": "Very good Seafood Pho, I added some chili flakes to kick up the spice and it did not disappoint.  Next time I fully intend to try the pad Thai spicy!Very much worth the trip to green st.",
                "reviewer_id": "xZhXEZnxK9eJ-gMzAn5GRg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6981765755201469,
                    "positive_probability": 0.30182342447985644
                },
                "stars": 4
            },
            {
                "review": "This place is awesome. Very good food. Wonderful service. Great experience! Would highly recommend.",
                "reviewer_id": "yz32fad4cJZINjaQX_7PZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2891958866385924,
                    "positive_probability": 0.7108041133614076
                },
                "stars": 5
            },
            {
                "review": "Best pho I've ever had in my life. Also they give you extra noodles for a dollar which is a deal.",
                "reviewer_id": "zduvZy9X8sLqyMcpABUvvg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5135121798442784,
                    "positive_probability": 0.48648782015572056
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "0lFRJ0q1PU_R4YaLNRWnpA",
            "8RP_A9rBaDRMQUwNYSl7YA",
            "oIU_awAiDThL0Xz0iGD5TA",
            "k0kNhfkp1GrYE15YDApKMg",
            "3lHBRYjfaMTZeWuQs9vvQw",
            "iK_jWW1xRfLCq693JVmD6A",
            "KQXusKEWX5iTdzSJStW8Dg",
            "5FPsw0_mNhylWujmJHseCQ",
            "lmDV-oW_dNn8kGHBbuNzXg",
            "u06X5C_pIAVuOXOznIcPYw"
        ]
    },
    "KQXusKEWX5iTdzSJStW8Dg": {
        "keywords": {
            "bigrams": [
                "banh_mi",
                "xinh_xinh",
                "vietnamese_food",
                "egg_roll",
                "asian_taste",
                "grilled_pork",
                "spring_rolls",
                "love_place",
                "looking_vietnamese",
                "place_vietnamese"
            ],
            "unigrams": [
                "food",
                "vietnamese",
                "place",
                "good",
                "mi",
                "xinh",
                "banh",
                "pho",
                "pork",
                "taste"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": false,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": false,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "quiet",
                "Outdoor Seating": true,
                "Parking": {
                    "garage": false,
                    "lot": false,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": false
            },
            "business_id": "KQXusKEWX5iTdzSJStW8Dg",
            "categories": [
                "Vietnamese",
                "Restaurants"
            ],
            "city": "Champaign",
            "full_address": "502 E John St\nChampaign, IL 61820",
            "hours": {
                "Friday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "20:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "20:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.1092811348301,
            "longitude": -88.2313949614763,
            "name": "Asian Taste Restaurant",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media4.fl.yelpcdn.com/bphoto/Uatdpm9P1eGAJAekrTtcrg/ms.jpg",
            "review_count": 19,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "This place specializes in Vietnamese comfort food. A few things off the top of my head on their menu are spring rolls,  egg rolls, great pho, toasted banh mi, and rice with grilled pork. I've ate at a couple places on campus that served Vietnamese food and although they were in some aspects tastier, they lacked the authenticity that Asian Taste has. ",
        "reviews": [
            {
                "review": "This is a Vietnamese gem!  Try the pho and spring rolls and you'll walk away with a smile.",
                "reviewer_id": "09VX_yNDmoCv3wm1mfB6iQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.44420582821397137,
                    "positive_probability": 0.5557941717860292
                },
                "stars": 5
            },
            {
                "review": "Disappointed.I really, really want there to be a good Banh Mi and Pho location in Champaign, but this isn't it.  My wife and I got two different Banh Mi sandwiches, the #7 and #8.  They were $5, not the $4 that others mention.  I bring this up because I couldn't find a menu online - and because there are times that a $4 sandwich is fine, but the same sandwich for $5 or $6 seems disappointing.  This was one of those times.  The bun came from a package; I was hoping for the crispy bun I've had from other banh mi places.  Most of the sandwich was vegetables piled high, with a little meat hidden underneath.  And a little cilantro and a few pieces of jalepeno pepper.  Though the menu promised pate, there was perhaps a half tablespoon spread very thin across the bread.  (I checked because I couldn't taste it.)This place reminds me of Xinh Xinh, at least based on the other reviews.  I felt that Xinh Xinh started strong and then started cutting corners once they'd established a reputation.  That seems to be what's happening here.  I'd look elsewhere for near-campus food.Maybe someday C-U will have a good banh mi place, but this isn't it.",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5771793740386444,
                    "positive_probability": 0.4228206259613474
                },
                "stars": 2
            },
            {
                "review": "I've  eaten here a few times, and it's a pretty decent restaurant.  Each time, i've had an egg roll and it's a bit inconsistent.  The first time, it was atop a cold noodle dish.  It seemed promising.  I wasn't crazy about the filling.... It's pork mixed with other things but it seemed mushy.   The dish itself (i forget what it was called) but it was on the specials board beside the register) was ok.... It had lots of julienned veggies, cold noodles, pork and the egg roll... I wasn't crazy about it....i was sort of hoping for a hot dish, but this is what the gentleman behind the counter recommeneded.  The second time, I had the pho.... It was really good... Better than Xinh Xinh.... But I think I like Pho 911's better.... Everything was good about it, but I just like the texture of Pho 911 noodles and taste of broth.   This time the egg roll was soggy and luke warm...it had obviously been sitting out for a while....The third time I had the banh mi.   It was a decent sandwich....piled high with veggies and pork but there was a lot of mayo.... That was a turn off for me.  The egg roll this time was fresh, hot and crispy, but now I'm convinced that i really don't like the filling.This is a decent restaurant and if i was in the area again, I would definitely eat here (as opposed to Fat Sandwich two doors down).  But it's not something i would go out of my way for.   The prices are cheap ($7 Pho, .75 egg roll, and $4.95 banh mi) so it's definitely student friendly prices!",
                "reviewer_id": "aSyHqB5QIybJb3npJUy78A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11549000233445622,
                    "positive_probability": 0.8845099976655617
                },
                "stars": 3
            },
            {
                "review": "the soup is so good !  i just stop by for my lunch time ! the store serve Vietnamese food very fast ...beat my short lunch time .....the lady she is very nice than my mom!!! may be i be back every day for my lunch or dinner ......",
                "reviewer_id": "d6JIFGrwzNhCLswzNXe4EA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7407198803498892,
                    "positive_probability": 0.25928011965011116
                },
                "stars": 5
            },
            {
                "review": "What sweet little spot for pho. I would have never noticed this place if I hadn't heard about it from a friend-- it's teeny tiny and tucked away near Fat Sandwich. It's dirt cheap (everything is around $5), and I have no complaints about the food. Since the plague that is winter has hit Chambana, it's been a bit disheartening walking out of my class into pitch blackness at only 5pm. But a hot bowl of pho on a rainy, windy night after a long day can cure all of my ills. Note: I don't think they have a customer restroom.",
                "reviewer_id": "dzKYG04n0nLXv6tGFvJX0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.009506927954928844,
                    "positive_probability": 0.9904930720450792
                },
                "stars": 4
            },
            {
                "review": "Restaurant reviewI am surprised this finally happen. I was looking for Vietnamese food and thought why not try this small restaurant on campus. The food pics looked amazing, however I was quite surprised when i came in and found no Vietnamese food at all on the menu. They must have changed owners and kept the restaurant name. There was very traditional asian noodle dishes i.e. beef and noodle with cilantro and a clear broth. I was not expecting anything amazing, but the flavors were simply off the wall. The broth itself was clear and seasoned well. I did not have the post MSG or salt thirstiness after dinner so it might be actual broth made with chicken. The noodles were cooked perfectly and the seasoned beef slices had the right tenderness. After eating all of the noodles, i wanted to drink all of the soup. Hands down one of the best classic beef chinese noodle soup. It reminds you of the famous Taiwanese beef noodle dish! I will definitely be back. Pros: inexpensive, fresh ingredients, great soup/brothCons: very small tables, hard to find restaurant (tucked away on the side of the building)Hidden deals: NoneHealth code rating: B. Kitchen area was clean. Health rating's okay not out of compliance significantly. http://champaign.il.gegov.com/champaign/estab.cfm?facilityID=1961",
                "reviewer_id": "f1a9KwsObpE54Yp9A1fVoA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0040179789162259226,
                    "positive_probability": 0.995982021083778
                },
                "stars": 5
            },
            {
                "review": "Bang for your buck! Love this place, as good if not better than other Vietnamese places in town, except so much more closer to campus than any of them. Their menu is simple but so far everything I've tried was good. And at a really really great price! big bowl of pho or vermicelli costs only $7. Their banh mis are also pretty good.",
                "reviewer_id": "fqQJv6t0UuHJF-riTzUXuA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38095697017674796,
                    "positive_probability": 0.6190430298232557
                },
                "stars": 5
            },
            {
                "review": "This place is excellent for a quick bite on campus. Note: they only take cash. I usually get the wonton soup or the beef stir fry - both are delicious. The Bahn Mi sandwich is quite flavorful, but a bit lacking in meat. The owners are incredibly sweet and sometimes they give me rice pudding samples (which are great) while I wait for my food. The food usually takes 2-4 minutes to make, so this is a good choice to grab something in between classes or on a lunch break.",
                "reviewer_id": "gHTzOYMc5vT1mL65TeWGZw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22149263442219053,
                    "positive_probability": 0.778507365577805
                },
                "stars": 4
            },
            {
                "review": "My husband and I read reviews and saw pictures on Yelp and decided to give it a try.  Alas, for whatever reason, it seems things have changed at this restaurant.  Banh mi are now $5 each, with the exception of the tofu one which costs more.  I got the grilled pork and pate one, and it was majorly disappointing.  A few skimpy slices of bbq pork, which was kind of spam-like; not a problem by itself, but for $5 and the quantity I kind of expected actual grilled pork slices.  The worst part was the pate, though.  There were seriously like three smears of it.  Basically all I could taste was the pickled vegetables, which were abundant.  My Vietnamese iced coffee was mostly ice and I finished it while we were waiting for the food to be ready.",
                "reviewer_id": "iN34tIuP_IYqQWIaPhddmw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.999979340503326,
                    "positive_probability": 2.0659496682972627e-05
                },
                "stars": 2
            },
            {
                "review": "This place has the best Chinese noodle on campus. Everything taste exactly like home. The price is a bit more than I expected but still reasonable. They serve signature Chinese entree that's rarely found in IL. This is great",
                "reviewer_id": "JMPDvBeShUJp9YRtTYjsxQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.315953888196049,
                    "positive_probability": 0.684046111803949
                },
                "stars": 5
            },
            {
                "review": "Management has since changed to the owners of Xinh Xinh. Unfortunately, the quality has since gone down; the pho has a similar quality to Xinh Xinh  and is still decent for your cravings, but nothing special. The pork and rice dish I tried here was better under earlier management and had more for your money. Still good for Vietnamese food in Champaign, but not as good as before.",
                "reviewer_id": "JZmLs0cLrFzgZtXrZwj8sg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09412826426411881,
                    "positive_probability": 0.9058717357358842
                },
                "stars": 3
            },
            {
                "review": "The food is pretty good although the seats are limited. If you're looking for a quick lunch or dinner, this is the place to try.",
                "reviewer_id": "KkfMD7Erl0f1UYsncCbN_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4767389753088375,
                    "positive_probability": 0.52326102469116
                },
                "stars": 4
            },
            {
                "review": "This is not a Vietnamese restaurant. A friend and I ordered 2 different noodle soups. They use the same broth base which is pretty much salty water. Hardly any meat and veggies. Just not worth the money. Do yourself a favor by buying some top ramen from the store, several  heads of Bok choy, some herbs and make it yourself. Not only will it taste much better, you will also feed yourself for the week or so. Honestly, the food is not worth the amount you are paying for it. As a student on a budget, there are better ways to spend your money.",
                "reviewer_id": "LoXlBCjTuyne0pH2GASMpg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08855441829854942,
                    "positive_probability": 0.9114455817014482
                },
                "stars": 1
            },
            {
                "review": "Asian Taste: A home away from home. It is the go to place when I feel homesick and want some Vietnamese food. I just visited this place in the fall of '14 and I have to say, the atmosphere has improved from last year. Gone is the mainstream American music and in its place is Vietnamese music. They added a few cosmetic items to give the place a more Vietnamese vibe and even a couple fish tanks. Now on to the food.The menu has improved from last year and the variety beats anything other oriental store offers for Vietnamese cuisine. I personally enjoy the bun thit nuong. As a kid from the suburbs, I've been to Argyle in Chicago and had the experience there. In particular the banh mi is a different experience, flavor and texture wise, from a place like Nhu Lan or Ba Le, but I enjoy the banh mi here. It is also authentic. If I were to compare their pho and bun bo hue to my parents, then they would be in serious trouble. Of course, nothing beats a meal from you parents right? I've ate at a couple places on campus that served Vietnamese food and although they were in some aspects tastier, they lacked the authenticity that Asian Taste has. The soups Asian Taste has may seem little bland to other stores, they provide all the condiments that should be included in the dish. Frankly if I were to score the soups then it would be a 4/5.I think this store will to continue to grow and improve and I do believe that this will continue to be my home away from home.",
                "reviewer_id": "N5RmTd7oj5S7alST_3pZmQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.000410275174272833,
                    "positive_probability": 0.9995897248257153
                },
                "stars": 5
            },
            {
                "review": "The owner is a very very nice lady, love the cozy space and their Banh mi (Vietnamese sandwich) is the best",
                "reviewer_id": "PM4GLnGacLxro61Zm76Few",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.788664538502218,
                    "positive_probability": 0.21133546149778457
                },
                "stars": 4
            },
            {
                "review": "Love this place!! Good price and good foood!",
                "reviewer_id": "uUp86-_AczfQUu-T-lM_Cg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4688389356950302,
                    "positive_probability": 0.5311610643049699
                },
                "stars": 5
            },
            {
                "review": "Their grilled chicken was so okay. It just looked like they microwaved the food. The place is a little sad too. The dishes were piled up and employees seem not motivated with their work.",
                "reviewer_id": "WQUaC-8zxLg3dphaLu9cYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21436499475766244,
                    "positive_probability": 0.7856350052423364
                },
                "stars": 2
            },
            {
                "review": "This place was awesome, then they jacked up the prices. 6 dollars for 2 spring rolls is insane. Factor in the fact that I would then eat them on picnic table. The experience just isn't worth it. I got a Bahn Mi instead, and it was disappointing.",
                "reviewer_id": "YZJv1ZwI2NMY9AHTFtbjqA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6255878966485174,
                    "positive_probability": 0.37441210335148256
                },
                "stars": 1
            }
        ],
        "similar_restaurants": [
            "lmDV-oW_dNn8kGHBbuNzXg",
            "D7ENnY6AzeFxlhNfnVH54w",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "6UftUvNBqANqybf8wpWeNA",
            "DB5rZ9spvyhBJsqOwckncw",
            "8RP_A9rBaDRMQUwNYSl7YA",
            "6M1F5AECDtWff1Tu3uLEWA",
            "k0kNhfkp1GrYE15YDApKMg",
            "rE8048_DAh3Z8Tep466wrA",
            "wGp0fgsmqCL8ovLwQrlSKw"
        ]
    },
    "lmDV-oW_dNn8kGHBbuNzXg": {
        "keywords": {
            "bigrams": [
                "banh_mi",
                "xinh_xinh",
                "spring_rolls",
                "vietnamese_food",
                "bubble_tea",
                "vermicelli_bowls",
                "fish_sauce",
                "pretty_good",
                "bean_sprouts",
                "mi_sandwiches"
            ],
            "unigrams": [
                "pho",
                "good",
                "xinh",
                "food",
                "mi",
                "banh",
                "place",
                "great",
                "vietnamese",
                "beef"
            ]
        },
        "metadata": {
            "attributes": {
                "Accepts Credit Cards": true,
                "Alcohol": "none",
                "Ambience": {
                    "casual": true,
                    "classy": false,
                    "divey": false,
                    "hipster": false,
                    "intimate": false,
                    "romantic": false,
                    "touristy": false,
                    "trendy": false,
                    "upscale": false
                },
                "Attire": "casual",
                "Caters": false,
                "Delivery": false,
                "Good For": {
                    "breakfast": false,
                    "brunch": false,
                    "dessert": false,
                    "dinner": true,
                    "latenight": false,
                    "lunch": true
                },
                "Good For Groups": true,
                "Good for Kids": true,
                "Has TV": false,
                "Noise Level": "average",
                "Outdoor Seating": false,
                "Parking": {
                    "garage": false,
                    "lot": true,
                    "street": false,
                    "valet": false,
                    "validated": false
                },
                "Price Range": 1,
                "Take-out": true,
                "Takes Reservations": false,
                "Waiter Service": true,
                "Wheelchair Accessible": true,
                "Wi-Fi": "free"
            },
            "business_id": "lmDV-oW_dNn8kGHBbuNzXg",
            "categories": [
                "Vietnamese",
                "Restaurants"
            ],
            "city": "Urbana",
            "full_address": "114 N Vine St\nUrbana, IL 61802",
            "hours": {
                "Friday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Monday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Saturday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Sunday": {
                    "close": "16:00",
                    "open": "11:00"
                },
                "Thursday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Tuesday": {
                    "close": "21:00",
                    "open": "11:00"
                },
                "Wednesday": {
                    "close": "21:00",
                    "open": "11:00"
                }
            },
            "latitude": 40.113390389546,
            "longitude": -88.2027876405812,
            "name": "Xinh Xinh Cafe",
            "neighborhoods": [],
            "open": true,
            "photo": "https://s3-media1.fl.yelpcdn.com/bphoto/f5P04rLgHsMnU8WXgfogZQ/ms.jpg",
            "review_count": 141,
            "stars": 3.5,
            "state": "IL",
            "type": "business"
        },
        "review_summary": "(like the pho) Their pho is good, though. Really good pho. ",
        "reviews": [
            {
                "review": "Being essentially a Vietnamese food virgin, I was eager to try a big bowl of this pho stuff I've heard so much about.  I decided to dive in head-first and choose the weirdest option, the pho with tripe and tendon.  I mean, when else do you see tripe and tendon on a menu?  Might as well get it.I decided that I really like pho, but not tripe or tendon.  (Seemed kind of flavorless, and the tripe's appearance especially skeeved me out.)  The steak and Vietnamese meatballs were delicious, though, as were the noodles, sprouts, and everything else in that seemingly bottomless bowl!  I finished maybe less than half of the whole thing, and for $5 on Wednesday nights, that is a CRAZY good deal.  My boyfriend's garlic beef bahn mi was to die for: the beef was excellently flavored and the pickled daikon was crunchy and fresh-tasting.  I will certainly try one of these sandwiches next time I go back.We split an avocado shake for dessert, and all I can say is WHERE HAVE THESE BEEN ALL MY LIFE?  So smooth, sweet, and creamy, and still retaining the subtle flavor of avocado.  Cramazing. The guy ringing us up told us that he uses a whole avocado (!), half and half, sweetened condensed milk, and ice, all blended together.  He also said that a couple customers had been on him to figure out how many calories were in it, but I begged him not to.  Some things I'm happier not knowing.",
                "reviewer_id": "-C93MHl3n-O_5KU_zGjEgQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1534480404553928,
                    "positive_probability": 0.8465519595446072
                },
                "stars": 4
            },
            {
                "review": "They now accept credit cards, woot!!!  No more embarrassed scrounging for parking meter change when someone forgets the cash =POh, and $5 pho after 5 pm on Wednesdays, GO! =D",
                "reviewer_id": "-Yk1KPbMJGY5OkRUeo8jlw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7025817821939415,
                    "positive_probability": 0.29741821780606253
                },
                "stars": 4
            },
            {
                "review": "My boyfriend and I got takeout for dinner one evening and were very happy with everything. We ordered online, and our order took roughly 15 minutes before pickup. I ordered pho and my boyfriend had a vermicelli bowl - both were very aesthetically pleasing and delicious. We also had the shrimp cake summer roll appetizer, which I would strongly recommend trying!Overall, great price, food, and service. Will be back for sure!",
                "reviewer_id": "-yYFnBCAVc3mgFt7m3syTw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05028028852104728,
                    "positive_probability": 0.9497197114789528
                },
                "stars": 5
            },
            {
                "review": "Been here a few times and had the sandwiches as well as the pho, all delicious. Also had a tried a few of the appetizers, one that I can't seem to remember the name of that involved pork and a lot of spic, and they were also great. While this place is a little out of the way for me it's worth visiting from time to time. Prices are fair and the food is tasty and comes out quick. Great lunch destination!",
                "reviewer_id": "061lsbK4eLnRJe3sZjPn0A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2751799561154057,
                    "positive_probability": 0.7248200438845938
                },
                "stars": 4
            },
            {
                "review": "When I moved to Champaign, I was excited that there was this Vietnamese restaurant. However, I was disappointed when I tried it out. I tried it a few times, hoping I would like it the next time but that did not happen. The staff is very friendly, however the food isn't the greatest. I might be bias or have a harsh judgement because I'm Vietnamese and have had great Vietnamese food in Philadelphia, PA and SoCal.",
                "reviewer_id": "2c3YHhPb0CCO-O708XmWNQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.034949090481127175,
                    "positive_probability": 0.9650509095188753
                },
                "stars": 2
            },
            {
                "review": "Been going here more regularly now...and i love it !! What's awesome about this restaurant is that the menu is dynamic and they change things according to the season. Since it's winter they have a new dish called congee, which is a rice porridge that is made out of a veggie/chicken broth...delish...brings me back to my childhood. They also have a few new sandwiches.Don't forget to try out the new curry beef sandwich (which are still a great deal for the price) and the other sandwich with some kind of spicy coconut sauce in it... (watchout for the jalepenos...so fresh ...but spicy!!).Also, subscribe to their twitter/facebook!! They update regularly what's new on their menu...good eats!!",
                "reviewer_id": "2HMvI5faaqWQyPdVOS8VyA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001753790627044962,
                    "positive_probability": 0.9998246209372963
                },
                "stars": 4
            },
            {
                "review": "This place was absolutely horrible. We had the lemongrass chicken noodle salad and the chicken didn't even look like chicken. I was very disappointed. I can only imagine how the other food must have been.",
                "reviewer_id": "3Pynh99O00Z3dKxzmErrzA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5096272430564731,
                    "positive_probability": 0.49037275694352495
                },
                "stars": 1
            },
            {
                "review": "The Best Vietnamese Pho in town. Came here often because it was fast service. The bean sprouts and cilantro leaves was always fresh. Broth was clean and flavorful. Definitely a place to check out if you are into pho. The owner is from Cali so I knew at that point that he knows how good pho tastes.",
                "reviewer_id": "4C5qJ_azTyJ3xz_cdrcgMQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6785850721526708,
                    "positive_probability": 0.3214149278473268
                },
                "stars": 5
            },
            {
                "review": "I was pleasantly surprised how good the food was on a recent trip here. Spring rolls were very nice and crispy, the mung bean pudding was rich and flavorful, Banh Mi had a good mix of flavors and textures with excellent bread, and the vermicelli bowls had fresh vegetables, perfectly cooked meat, and generous portions. I'll definitely be back since the prices are great as well.",
                "reviewer_id": "5BNI8ukGTlwUI2CCeyjZOw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.001806135559716682,
                    "positive_probability": 0.9981938644402769
                },
                "stars": 4
            },
            {
                "review": "Food. Well done and flavorful. Don't get the drinks, especially the ones that have salt in them. Bubble tea here tastes weaker than elsewhere.Atmosphere.The interior looks nice overall - much better than you expect from asian restaurants in the same price range. Its a vast improvement over most places. The location next to Shnucks isn't that great either, but its convenient.",
                "reviewer_id": "6cJGbgLJ0lfOXzB8YN6gQg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04880677582945323,
                    "positive_probability": 0.9511932241705464
                },
                "stars": 4
            },
            {
                "review": "I'm no pho expert.  I've only had it a couple times in my life, but Xinh Xinh makes some pretty good pho in my opinion.  I had the combination pho which came with a variety of meats including some raw ribeye which cooked beautifully in the delicious hot broth.  The pho came with the standard pho accoutrements: basil, lime, and sprouts.  I also had the lime soda which was nice and refreshing, but I'd probably skip it the next time I visit.  Seems a bit overpriced for lime, sugar and club soda in a cup.  I've also had their banh mi.  The bread they use is great, crusty on the outside, soft and tender on the inside.  Their combination bahn mi is a little funky which I attribute to the headcheese and pate, but it's mighty tasty.  The pickled vegetables are great although I feel my sandwich had a bit too much and some bites were just bread and veggies while some were just meat and bread.  However, when you do find a balance between all of the components it makes for one delicious bite.Xinh Xinh will be my go to for Vietnamese food, although I don't believe there are many options for Vietnamese food in C-U anyways.",
                "reviewer_id": "6D1PuiyYHndLeF8_WHpW6A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.24114777970285636,
                    "positive_probability": 0.7588522202971562
                },
                "stars": 4
            },
            {
                "review": "The food is delicious and fresh! I've tried all kinds of dishes on their menu. My favorites are the spring rolls with pork, any of their vermicelli bowls (absolutely amazing), and the lime soda. Not a big fan of the sandwiches, but I think that's more of a personal preference.",
                "reviewer_id": "6Gy2xDPe01rbFOqeVAc-tA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.027680133517048653,
                    "positive_probability": 0.9723198664829493
                },
                "stars": 5
            },
            {
                "review": "When writing these reviews, I know that people can't help but compare our local Vietnamese restaurant to other Vietnamese restaurants in L.A., San Francisco, or another urban area with a greater concentration of ethnic cuisine.  Maybe Xinh Xinh doesn't live up to a well-traveled foodie's expectations in terms of \"authenticity\" or flavor or the size of their pho bowls, but the same criticism could be made about any restaurant in this town (i.e., our best restaurant can't compete with New York's best)...and quite frankly, I doubt many people could shell out $300+ and fly to L.A. just to try your favorite Vietnamese restaurant out there.  Ok, rant over.So in terms of restaurants in the Champaign-Urbana area, how does Xinh Xinh stack up?  The menu might appear limited, given that most of the items are just variations of banh mi (sandwiches), pho (noodle soup), bun (cold noodle \"salad\"), and rice plates (usually accompanied by some kind of grilled meat).  However, there are usually 7 or more combinations of each dish, served with different meats, sauces, etc., so the menu is pretty extensive if you plan to sample it all.  While the restaurant didn't start with many vegetarian options, they've been consistently adding more over time, and the servers are usually helpful in pointing out vegetarian dishes on the menu.  You should also speak to the owner (Shai), who can tell you about upcoming dates when he plans to have vegetarian daily specials.For appetizers, I really recommend the glazed chicken wings or nantaing (spicy ground pork dipping sauce served with baguette slices and shrimp chips).  The chicken wings smell a little funky, but you'll overlook that once you get a taste of them.  I love the flavor of the nantaing, and I especially love the sound of crackling shrimp chips when they touch the sauce.  I usually order the pate ban mih, though many people complain about the strange \"metallic\" flavor that is often attributed to pate.  If you're feeling a little less adventurous, I'd recommend the grilled pork ban mih.  I am also really impressed with the bun (noodle \"salad\") that they serve.  Xinh Xinh's bun has generous portions of meat, bean sprouts, carrots, and lettuce (yum!), along with the usual rice noodles and spring roll.My only complaint is that the restaurant is pretty small, so it usually can't accommodate large parties unless you're one of the only patrons there.  With limited seating, Xinh Xinh also fills up rapidly on busy nights, especially for their Wednesday night pho happy hour.  I would suggest avoiding peak hours or getting your food to-go if you are impatient about waiting for a table.If you add Xinh Xinh as a friend on Facebook, you can get updates on their daily/weekly specials.  This is really helpful for vegetarians as some of the veg-friendly options (e.g., pho chay) are only offered on certain days.",
                "reviewer_id": "6nqakbu2zU6fjOmbE83_-A",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 3.0666095240538796e-06,
                    "positive_probability": 0.999996933390491
                },
                "stars": 5
            },
            {
                "review": "Everything is really good here, except the bnh m. Pho is awesome. So is the Vietnamese style coffee and the role. Yet, the bnh m came out with the crust already a bit soggy, and not as crunch as they should. Even though the stuffing inside does taste good.",
                "reviewer_id": "79dKZm3OfUumh6lSqqr_Qw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8156101458156699,
                    "positive_probability": 0.18438985418433076
                },
                "stars": 4
            },
            {
                "review": "Xinh Xinh Cafe used to be a regular stop for me and my roommate on the weekends after running errands in the morning. We have had lunch here several times in the past year, usually to satisfy my craving for pho, which I have enjoyed immensely in Vietnamese restaurants in Chicago and Dallas-Ft.Worth. The last time I came here, I had fried spring rolls and pho with thin sliced beef. The noodles were great, meat was just right, and the bean sprouts and herbs were fresh (but could be fresher). I also had Vietnamese iced coffee (ca phe sua da, condensed milk with black coffee that slowly drips down into the cup as it sits on your table) that was as authentic as any Vietnamese coffee I have ever tasted. Service here has been great, as well. My main gripe with Xinh Xinh cafe is that their portions are incredibly tiny. When I spend $15 for a meal, including tip, I expect to leave satisfied, but the serving size just doesn't cut it for me. I can understand this price point because it's probably the only decent Vietnamese restaurant in Central Illinois, but still, I think they can do a lot better for the price.",
                "reviewer_id": "7s1iQISYzM7GEr3TTTuJww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2597985635181355,
                    "positive_probability": 0.7402014364818781
                },
                "stars": 3
            },
            {
                "review": "I never have been a Pho person before...but the pho here is addictive. I would actually say this place is better than Saigon in Savoy. And the vanilla bubble tea is yum! (Xinh Xinh also offers a buy 9 get 1 free card on bubble tea too.)The owner, Shai, is very busy running practically the whole joint on his own...a very warm and welcoming owner, he definitely aims to please!....Urbana is kicking Champaign's butt in tasty food and dining experience!UPDATE: Shai has now included tofu as a substitute for meat in the soups. Of course, the soups are still made with beef broth, but the tofu is thick and killer.",
                "reviewer_id": "7zSppEZd2C6ASpNeBebxAA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.41219904582493655,
                    "positive_probability": 0.5878009541750543
                },
                "stars": 5
            },
            {
                "review": "My friend ordered chicken wings, when they arrived, the smell which quickly took over our senses was that of eitherA) Fresh fecesB) Rotting dog carcass orC) Satan's nutsackWe sent the wings back and tried to enjoy our meals. The pork sandwich I ordered was below average, very fatty, spilling all over the place and overall lacking in robust taste.Another friend of mine ordered a noodle dish which was not too poor in quality but once again, average at best. I will not be returning to Xinh Xinh...ever...",
                "reviewer_id": "8hFMyX-CYPv6XEYojQ6Zbg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.025543204071783603,
                    "positive_probability": 0.9744567959282122
                },
                "stars": 1
            },
            {
                "review": "I had been meaning to eat here for a long time and finally did, nothing bad to say but no plans to go back either. Had banh mi which was just ok and chicken curry which was better than most average places but lacking in flavor compared to the top tier in C-U. Another plus they have taro milk tea.",
                "reviewer_id": "8oJRVNV3Bi3VHAuI1Su7-A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7908351240510216,
                    "positive_probability": 0.2091648759489816
                },
                "stars": 3
            },
            {
                "review": "mediocre at best.The pho was good enough but the portion size was wayy too small for $7. I left this place still hungry. I'm a huge fan of Vietnamese food and I really want to love this place, but I left disappointed the two times I went there.",
                "reviewer_id": "9iRDAeoTW08yZgR0JaaOHg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5028610844202226,
                    "positive_probability": 0.4971389155797771
                },
                "stars": 3
            },
            {
                "review": "What happened, Xinh Xinh?  We used to take out of town people here because we were so impressed with the place.Last time we got take-out.  Three banh mis and an order of wings.  Wings were pretty good and certainly well seasoned with fish sauce.  (If you are not used to the smell of fish sauce, this might not be too appealing.)  My wife's sister's banh mi seemed pretty good, but ours had very little meat on them.  They still had the jalapeno peppers and cilantro, but the mayonnaise seemed less, too.  I got the catfish banh mi and the fish was tiny - especially in comparison to previous trips.  We'd noticed a decline in the quality of the bubble teas, too.  Originally they were really strong and offered flavors that Cafe Evo didn't.   But last time we got one (it was a while ago), it seemed like it was made with non-dairy creamer instead of milk.Disappointed.  Probably not going back - I guess I have an excuse to try making my own banh mi or pho instead.The service was still good, but the food is simply not as good as it was when they opened.",
                "reviewer_id": "9LZXJu6RZ6UpIXYGSZWB7Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.21170128645577505,
                    "positive_probability": 0.7882987135442286
                },
                "stars": 2
            },
            {
                "review": "Not a huge fan.  I went mostly for the boba tea (eager to try something beyond Evo) but had to eat as well.  I knew there wouldn't be much for me as a non-beef eater (pho is out) but the shrimp spring rolls were pretty good.  Not so satisfied with the green tea boba I ordered.  It wasn't slushy (which is okay) but the flavor was not as bitter as I was expecting from green tea and I just didn't like it.  So I tried again and got an almond tea, which was more to my liking.  Flavors seemed a bit hit and miss (my friend's spiced chai was pretty good, but red bean, not so much) so I wouldn't really be willing to go and explore more flavors in case I get more misses.  On the plus side, the boba itself (the tapioca balls) were smaller, chewier, and overall much more pleasant to eat than the boba at evo.  The staff was also very nice and friendly -- so points to that.",
                "reviewer_id": "_7VcEa3xUpsc9XUTFCqlhg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.007515565802066806,
                    "positive_probability": 0.9924844341979308
                },
                "stars": 2
            },
            {
                "review": "I don't know why people don't like the wings here. I actually think they are outstanding. Maybe there's a different set of wings from the fried sweet and spicy honey wings. I don't often eat fried food, but these wings have a delicate crunch and they are covered with this great sauce. There's honey, of course, and hot pepper flakes, and possibly ginger...my friend and I are dying to try and replicate this taste.I went today and, since I had gotten my refund check, decided to splurge. I had the lime soda, which was delicious and refreshing and homemade, not too sweet. We split the aforementioned wings, which are moist and delicious, and spring rolls, which were crunchy and fresh and held together well.My friend and I also got banh mi, which I have never had before. I got mine with garlic beef and was rewarded with soft crunchy bread, a subtle bite of pickled veggies, and tender savory bits of beef. I thought it was really tasty! There was a lot of bread, though, and I'm not sure it was much different from a normal baguette I could buy. I understand that banh mi is supposed to be on bread with rice and wheat flour, so I expected it to be a little lighter. Everything was really good though. In fact, I know that in the warmer months they offer vermicelli bowls, and I can't wait to try that. I also want to come for $5 pho on Wednesday. Yum.One weird thing: I'd love it if we got some plates with our appetizers. I always end up making a mess!",
                "reviewer_id": "_hz_dF3yYAUdbD8rwqbVPg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005870415667279655,
                    "positive_probability": 0.9941295843327353
                },
                "stars": 4
            },
            {
                "review": "It's a bit past 9pm on a Saturday night and I call Xinh Xinh to see if they're still open.  I've never been, but I'd heard good things, and I had a hungry crew of people from out of state to take care of.  Closing at 9:30?  We can make it...Good thing I did call, because they were about to close up shop early for the night.  It's a small place owned and run daily by one guy (Shai), so it's a forgivable practice.  Just make sure you call ahead if it's near closing time.We felt a bit embarrassed coming in, but Shai made us feel completely welcome and we never felt rushed at any point in the night.  Since we were also the last patrons of the night, he took the time to make sure we were satisfied and chatted with some of my friends who from his home state of California.I've had a lot of pho in my time, but the broth here was much more flavorful than any other place I had been.  The meat balls weren't as dense as I'd have liked (that's what she said), but overall everyone was happy with their soup.  My one sick friend said she felt considerably better once she finished, so yay pho!Protip: they take credit cards and are open Sundays now.  Shai mentioned a Sunday special on Pho, though I don't know if it was just that Sunday or every Sunday.",
                "reviewer_id": "agJz7qFAkwGbzoC3I03h0Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.002379415914773459,
                    "positive_probability": 0.9976205840852457
                },
                "stars": 4
            },
            {
                "review": "I've generally had a great experience here, good pho, spring rolls, and vermicelli. The specialty drinks are hit and miss depending on the day.  The chicken wings are something to pass up though. I was served undercooked wings, one of which was the joint between the throwaway wing tip and flat part of the wing. The individual working there at the time was quite rude when I complained, raising her voice and complaining about how much makes and the economy.  This experience ruined my overall impression since I used to really talk up the place in a positive light.",
                "reviewer_id": "bBKDACKvEwJ0kEkMSSLzmA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.02873686662015887,
                    "positive_probability": 0.9712631333798497
                },
                "stars": 3
            },
            {
                "review": "I went here with my boyfriend and we loved it! We both had vermicelli bowls and it was DELICIOUS. I'm a huge noodle fan too, and this was probably one of my favorite noodle dishes I've ever had. It came with this delicious crispy eggroll and it all made for a perfect lunch.The only reason it hasn't received five stars from me is simply because that's all I've gotten at this place. I need to go back and try more, but the vermicelli is just so good!UPDATE: Just went back with the bf and sister this past week and officially added another star. The vermicelli bowls are just too good, especially for Champaign.",
                "reviewer_id": "BvGV9lMMUmB5hLWkNlY3vw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005247658044081943,
                    "positive_probability": 0.9947523419559146
                },
                "stars": 5
            },
            {
                "review": "Absolutely something you cannot miss in Champaign-Urbana.",
                "reviewer_id": "C9pTqfB_Tlt1MDI5FDwnlw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45104416253738455,
                    "positive_probability": 0.5489558374626149
                },
                "stars": 5
            },
            {
                "review": "I grew up in the Midwest, and my experience with different cuisines suggested as much before I moved out to the Pacific Northwest. There I tried my first Pho, and I fell in love. I recently moved back, and have been looking for decent Vietnamese restaurants in the area, but, unfortunately, this IS the Midwest, and there are many things it lacks; a wide variety of restaurant types being one of them.This was the only place that I found that really fit what I was looking for, so I decided to try it out.Their chicken dumplings with the dipping sauce were absolutely delicious. I will definitely be getting those again. I'm craving them, and I just had them yesterday! I chose their Pho Tai Nam, and everything was very fresh. The broth had a very distinct cardamom flavor, which made it a little difficult to drink too much of it, at one time, but it was still very tasty. The thing that pleased me the most, though, is that I ordered online and they had my order ready as soon as I got there, and knew it was me who ordered for pick-up as soon as I walked into the door, and it was my first time there. It makes me feel as though they must have a very faithful client-base, because they were so aware.",
                "reviewer_id": "c_TC9XD-gDifFXQWMxCL6g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00020118671116975466,
                    "positive_probability": 0.9997988132888117
                },
                "stars": 4
            },
            {
                "review": "I have tried multiple things on their menu and have never been disappointed. The curried beef banh mi is my current go to. It is richly spiced and always great. The coffee is always good and the mung bean pudding is a great way to finish the meal. The service is phenomenal and the overall experience has always been good. Highly recommended.",
                "reviewer_id": "cRZVABuN4Dt_lxa1FGJffQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19170547016921385,
                    "positive_probability": 0.808294529830784
                },
                "stars": 5
            },
            {
                "review": "Had a business meeting on Friday, February 12th.  Shai, the owner runs a clean, clean, clean place.  Good start.  Easy to read menu.  Good explainations by Shai himself.  Options on the menu are clear.  Then you get what you ordered.  Components are delivered on the side so you can mix to taste.  Had a type of meat soup that was outstanding.  Fresh basil mixed to taste with fresh jalepeno.  Appetizer was a hard boiled egg, deep fried with a sweet/spicy sause lightly applied.  There is a lot to enjoy here and well presented.",
                "reviewer_id": "D70UxoBHPDB344w0ItsrGw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0932069417026487,
                    "positive_probability": 0.9067930582973538
                },
                "stars": 5
            },
            {
                "review": "Yummy everytime. The staff here is always willing to help with recommendations(must try the pho), their prices are decent, and the atmosphere is great - all reasons why Xinh Xinh has become one of my favorites.",
                "reviewer_id": "d78NImAvsEnyw5UwPBvmFQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.03264427846954404,
                    "positive_probability": 0.9673557215304572
                },
                "stars": 5
            },
            {
                "review": "Great Pho! Not the best I've ever had, but the best I've had in town. I was interested in trying the deep fried boiled egg but it wasn't that good. It was a little dry and over cooked. I always get the combination pho. I wish they were a little more generous with the toppings and had an option for rare beef but, you can't complain about the price!",
                "reviewer_id": "D98vylCT1fLKBIU6iAKxhw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05558820537095572,
                    "positive_probability": 0.9444117946290415
                },
                "stars": 4
            },
            {
                "review": "Food was delicious.  Atmosphere was mediocre, which is why I gave it 4 starts.  On the inside it looked like a place that mostly does take out.  But it doesn't really matter because the food was outstanding.  We got the pho and pork spring rolls.  The portions are generous too.  I'll definitely be back.",
                "reviewer_id": "Da-rTzXpsOVOIAEnGrjjAQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22135744627328766,
                    "positive_probability": 0.7786425537267117
                },
                "stars": 4
            },
            {
                "review": "Inexpensive, but you get what you pay for. I got the vegetarian tofu sandwich and it was basically a MASSIVE bun with a few carrot peels, sprouts, and three tiny pieces of fried tofu. I don't recommend their sandwiches if you're hoping for something other than an enormous white bread bun.The waiter was cool, though. He was very blunt about the food. He warned me that sandwich was boring and flavorless... I liked him.",
                "reviewer_id": "DL8GF-ptGsBeegb6OWFptg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9274168398435928,
                    "positive_probability": 0.07258316015640481
                },
                "stars": 2
            },
            {
                "review": "Pho is so so. The rice bowl with grilled steak is good. Service is good.",
                "reviewer_id": "dPjYfacluGoHiCRjDmIIlA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1568077942935955,
                    "positive_probability": 0.8431922057064056
                },
                "stars": 4
            },
            {
                "review": "I came in here with high hopes of satisfying my pho craving. It's hard to find good pho in the Midwest when you're a Vietnamese person from Southern California..but I digress, I had the pho and although it wasn't bad..it wasn't great. Also, it was weird that my pho didn't come with any cilantro or green onions..isn't that a part the meal's identity?! Also, I ordered thai tea that was 95% half and half and 5% tea. This place wasn't bad, but the next time I visit I will be having something other than the pho.",
                "reviewer_id": "Du5ursHkJhcamqY0F3hTCQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.008481971099494081,
                    "positive_probability": 0.9915180289005041
                },
                "stars": 3
            },
            {
                "review": "Xinh Xinh is in my opinion one of the best restaurants in Champaign County. While I have tried many things on their menu, their stand-out dish is their Pho. The broth is super tasty, and they use excellent quality meat which sets them apart from the other places in town that serve Pho. When you are finished eating you are full and satisfied. They also have some great appetizers, especially their Nataing.I'm not entirely sure why some people here don't like their prices. They have $5 Pho dinner specials on certain days which is a phenomenal deal (I'm not sure you could buy their quality ingredients at that price at most grocery stores), and their normal prices are less than $10 for a huge portion. A dish is a meal, and you're not going to find much in town that's cheaper. Once you factor in the food quality, eating here is a great deal.",
                "reviewer_id": "dyWHODu6HQwEHzYBOPFJPQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0024847907880182307,
                    "positive_probability": 0.9975152092119833
                },
                "stars": 5
            },
            {
                "review": "I absolutely love the pho! I come here about every Wednesday for $5 pho with my wife. Shred the basil leaves, add the sprouts, and toss in the jalepaneos for a savory broth. Add some sriracha and the hoisin sauce to the small dishes and dip away. Arrive around 5:30pm to beat the rush. Remember cash only for the special. Food arrives snappy, but service is limited. Don't expect water refills, take your cup to the counter and self serve if your thirsty. The broth should quench your thirst though.I've come for the Monday special and it was great, but the pho happy hour on Wednesday is what gets me back. The sandwiches have also been tasty, but pricier.",
                "reviewer_id": "e4qNJCd6tmEQNkflFiTdyg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5269270852946486,
                    "positive_probability": 0.4730729147053468
                },
                "stars": 5
            },
            {
                "review": "I didnt like this place. The vietnamese food was bland and the noddles tasted poorly. The service was slow despite being the fact that there was two tables. I ordered a rice plate and the girlfriend ordered a beef pho. I would recommend ordering from cravings or another vietnamesr place if your in the mood for good vietnamese food. Also the cost was about 20 bucks.",
                "reviewer_id": "EM3qgcLfUzPU2boJIL77eQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.026886225526155126,
                    "positive_probability": 0.9731137744738488
                },
                "stars": 1
            },
            {
                "review": "Urbana, IL has an embarrassment of good restaurants to choose from, and Xinh Xinh is high on the list. Both the hubster and I are quite fond of Vietnamese food and seek it our wherever we are, so we ate here twice during our 3 day stay. First, I really like the space, which, with its' corrugated metal walls and local art work, manages to be both urban and cozy at the same time. The guy at the counter waits tables, so he sat us, brought us water and served our food, all while taking care of other customers and running the counter very efficiently and with a smile. I had eaten a large lunch, so had the tofu summer rolls, which were great...very fresh veggies and marinated tofu, with a crunchy fried component in the center that added textural interest, served with a tasty hoisin-peanut sauce. When I looked around I noticed many other folks had ordered those tofu summer rolls, so they're very popular. I also ordered the chicken dumplings, which were excellent...tasty little fried morsels served with a sweet fish sauce dipping sauce. Doug had the bun (vermicelli rice noodle bowl) with chicken and an extra fried spring roll and said it was great...noodles a little thicker than the average that looked homemade and well marinated chicken, served with a sauce that he thought too sweet initially, but then warmed up to. Xinh Xinh has a wide range of beverages choices, from bubble teas to Vietnamese sodas, hot tea, an avocado shake, Thai iced tea, coconut juice, and that most delicious of beverages, Vietnamese drip coffee sweetened with condensed milk...rich and sweet yumminess. We had the banh mi on our second visit, which is the traditional Vietnamese baguette sandwich. We tried the roast pork pate combo and the pepper chicken, and they were both good, but not stellar. I admit to being a little spoiled by the banh mi at Dong Phuong in New Orleans, which have ruined the experience for me anywhere else. We didn't try the pho, as we don't eat beef and they don't offer the chicken variety, although they do have a vegetarian pho on the menu. I like the thought they put into everything here, from the fresh ingredients to the cute decor. They even have their own little hand drawn character...the Pho King Man...keep in mind that \"pho\" is pronounced \"fu\" and then say it out loud. You'll get it.",
                "reviewer_id": "F5WW6egmmUrIWRI_ZNpbEA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 5.742078549219957e-08,
                    "positive_probability": 0.9999999425792436
                },
                "stars": 4
            },
            {
                "review": "Really good pho. Rich and flavorful! If you are on a high fat diet like I am then ask them for a cup of beef fat (they skim it from the beef broth) to add to your soup! Awesome way to keep warm on a winter day.",
                "reviewer_id": "FGSbDV0aycdd4BOGjNx6ZA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.493595810305012,
                    "positive_probability": 0.5064041896949903
                },
                "stars": 5
            },
            {
                "review": "It is decent, If you are looking for a place with homemade Viennese food. I have been to this place three times, twice in the summer and once just a week ago. During the summer times, pho and rolls are my favorites. Bubble tea is a must have. Last week, I like how they marinated the the beef short rib. It's not too salty nor sweet and grilled to perfection. Deducted one star due to decor, but it's a great family restaurant.",
                "reviewer_id": "fkezdVKtS9QKQZQTj4pUEw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3682074110571421,
                    "positive_probability": 0.6317925889428571
                },
                "stars": 4
            },
            {
                "review": "Ok everyone will talk about pho because it is like the hamburger of Vietnam.So I'm gonna rave about all the other stuff.1:  Shai is hella awesome. He really takes pride in his work and you can tell because when he asks how everything was, he's really asking how everything was.2: Get the freaking Banh Mi. Get the banh mi. Get it. Now. I'm going to assume from the domination of pho reviews that a lot of people in CU haven't been converted yet to this most awesome ambrosia of Asia. It's basically a Vietnamese hoagie (I cringe too as I type that): the bastard child of the French occupation of Vietnam that grows up to be a beautiful, exotic Helen of Troy. A banh mi baguette is made with rice flour which gives a fragrant papery aroma (versus the yeasty aroma of French baguettes), a delicate crackly crust and a softly chewy interior. It's filled with any combination of ingredients that reflect the Vietnamese talent for marrying flavors (who else can make something taste hot, cool, spicy, succulent, crunchy and meaty at the same time?).Xinh Xinh's banh mi is effing great! It's not the behemoth banh mi of SF (which are the size of a Fat Sandwich sandwich) but it's the perfect size for a meal. I'll confess that when I go in, I order five sandwiches. Because this place brings out the glutton in me.Shai changes up the menu as well so there are daily specials and new sandwiches to put into my five-sandwich rotation.For starters, I'd go with the B1 (classic), the beef with papaya salad (different), the chicken (comforting) or... well, you see how this gets out of hand.Moving on before I drool more and short out my keyboard.3.) The appetizers are also awesome. Hands down the BEST spring rolls in town. Yes, beating out any of the Thai restaurants. I'm partial to the pork one that has some kind of wonderful crunchy stick. I also tend to add both kinds of spring rolls on top of those five sandwiches.4.) There is some really cool and unusual stuff on the menu for adventurous foodies. There's nothing more thrilling than finding someone in CU who know's what's up and would rather go balls-to-the-wall than play it safe. I'm talking about the egg soda. Not an egg creme soda. An egg soda. Bubble tea is all well and good but... EGG SODA!!This is the only restaurant that I will trek to Urbana to. On the days when I roll out of bed too late to make it there (they are open til ten pm Mon - Sat), I go hungry because I know anything else will be a disappointment. I love this place. If I could live there and eat their banh mi forever, I'd be a very happy girl.",
                "reviewer_id": "fKMxBr3zzvLlB3mmzfCDXQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 7.468105208212632e-08,
                    "positive_probability": 0.999999925318912
                },
                "stars": 5
            },
            {
                "review": "The Pho is tasty (particularly the brisket), but the highlight is definitely the banh mi sandwiches.  I typically come here with my husband, so we'll split a pho and sandwich, and it's hard to beat.The only reason I'm giving 4 instead of 5 stars is because we have a lot of vegetarian friends who we like to dine out with, but I'm told Xinh Xinh only serves vegetarian broth for pho on certain days.  Would love it if they could figure out a way to have it on the menu full time.But the moral is, give it a try! Definitely the best pho in town.",
                "reviewer_id": "g3h6N0yKdYcVLTh67ivJRw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5604315630627402,
                    "positive_probability": 0.4395684369372681
                },
                "stars": 4
            },
            {
                "review": "Been here a few times since Smile Politely mentioned they were opening up, and each time I have walked away impressed with the dishes that have been served up.Things can be a little squished due to the size of the place, but the food absolutely makes up for it, both in quality and price. My pho is piping hot with lots of great additions (I did the vegetarian chou pho offered last weekend), and the banh mis are crispy and savory.Best item however are the spring rolls! Perfectly fried and delicious, especially with the mushroom in them, mm-mmm! I would almost want to get several plates of those just for dinner!",
                "reviewer_id": "GtkyHb8hxAN7keJLBYPywA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13250885087595438,
                    "positive_probability": 0.8674911491240493
                },
                "stars": 4
            },
            {
                "review": "Looking for some good Vietnamese food, I stopped by Xinh Xinh Cafe. I ordered the pho and my guest ordered the roast pork banh mi. The pho was mediocre. Noodles were fine, the soup was generic, and the meat and garnishes were lacking in flavor and freshness.The banh mi followed the same path, with my guest saying it lacked in the amount of roast pork and the baguette was thick and lacked the crispy outside needed for a great banh mi.The service was on par for what was expected, nothing amazing but not terrible. Overall, not a terrible place but leaves the desire for a real Vietnamese food experience. If you absolutely need some pho, this place will be barely sufficient. If, however, you're looking for something new and tasty... Do yourself a favor and pass on Xinh Xinh Cafe.",
                "reviewer_id": "H2kSK9GWXgjru_zfH9yO9A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9955736232257848,
                    "positive_probability": 0.0044263767742136586
                },
                "stars": 2
            },
            {
                "review": "Great food and people running it.  I highly recommend the vermicelli bowls as they are like nothing I've found elsewhere. Unfortunately I've moved from the area but whenever I'm back I always try to stop back.  Again: get a Vermicelli bowl.",
                "reviewer_id": "H8wT4jji49mEB_CxXFF5LA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.23760569788118902,
                    "positive_probability": 0.7623943021188115
                },
                "stars": 5
            },
            {
                "review": "holy shit WORST BUBBLE TEA I'VE EVER HAD. i know a fair bit about bubble tea, and this must have been a sick joke. i thought Evo Cafe on campus had bad tasting bubble tea, but that was only slightly bad compared to what Xinh Xinh Cafe gave me. it was truly AWFUL. i have been to quite a few bubble tea establishments in my life, and never tasted tapioca this bad.  it's normally chewy, and some places make it firmer than others, which is fine, I personally like softer, but whatever they put in my drink was like... chalky. way to solid. it shouldn't even, be edible whatever it is.  maybe it had expired?? is that possible?this is the first & last time i go here for bubble tea. maybe their food is better, i didn't try it. also i got the green tea flavor, and they didn't ask me if i wanted milk in it. i feel like most places will ask you if you want green milk tea or not, or at least all the places ive been to in New York City would ask. so i basically was given sugar water with a bit of green tea flavor.aside from the awful drink, the employee was friendly enough, and i feel like for the size of the drink you're getting your money's worth, so that's good at least. but if you want good bubble tea, PLEASE go to Cocomero (on Wright st!) ...it's amazing.OH also, when we got home, we poured soy milk into it, which did make it taste a lot better.",
                "reviewer_id": "H_H8O9RcO6DTbBDHJT5e1Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.27141453467030313,
                    "positive_probability": 0.7285854653296969
                },
                "stars": 1
            },
            {
                "review": "I have only been once but I ate a full appetizer and pan fried garlic beef all by myself.Why? because I could not stop eating it. It was delicious enough I developed a temporary over eating disorder.I can't see the soup's being anything I'll ever try but I am not a fan of asian soups.He's putting on a new summer menu, check it out.",
                "reviewer_id": "hd4E2wcaEQ2kKDnGIjbhFw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.020232719690744055,
                    "positive_probability": 0.9797672803092591
                },
                "stars": 5
            },
            {
                "review": "This is one of my favorite places to eat at in CU. Great, friendly service, excellent food, good prices. I usually get the tofu vermicelli, its awesome. I've also had the tofu bahn mi, and summer rolls, both really tasty! This place doesn't look like much from the outside, but its great!",
                "reviewer_id": "HlTT3I4PzjlhXAGJlS_xTg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05700698660316345,
                    "positive_probability": 0.9429930133968372
                },
                "stars": 5
            },
            {
                "review": "Growing up fairly close to one of Brooklyn's Chinatowns I had easy access to authentic Vietnamese food whenever I wanted. I came into Xinh Xinh not knowing what to expect- how good would Vietnamese be in Central IL?Turns out, it's great! I had the dac biet (Go with this pho- you get beef slices along with all the other fun cow parts like tripe and tendon) and my girlfriend had a banh mi. My pho had flavorful broth (watery pho broth is the worst) and the garnishes were fresh and a good portion. I was really impressed at the quality of my girlfriend's banh mi's bread. Banh Mi is all about the bread- when you've had a good banh mi you know what I mean. We also shared an avocado shake, which we both really liked.My only real gripe, surprisingly enough, was the price. I guess it's hard for Xinh Xinh to get some of the ingredients they use down in Urbana but believe it or not I think the pho in NYC might actually be cheaper and a larger portion (eg, the dac biet here costs about  as much as xe lua in NYC [xe lua is like a giant portion of dac biet]). Nonetheless, I'll happily come back! Plus my price issues are really mitigated by the fact that they take 5% off if you pay in cash and they have pho happy hour on Wednesday.",
                "reviewer_id": "Hrbp5EeBOu2esRdRKeMAkg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9889711292350182,
                    "positive_probability": 0.011028870764999402
                },
                "stars": 4
            },
            {
                "review": "Xinh Xinh is where I go whenever I'm missing the amenities and diverse cuisine of home (L.A). Shai, who also hails from L.A., does a great job in bringing some good, cheap Vietnamese food to a town that has a limited selection of tasty and fairly authentic ethnic foods beyond the few Chinese gems I've found. Though its definitely not quite like going to Little Saigon in Santa Ana, Xinh Xinh offers some really tasty food. Their pho is really good, though definitely smaller than the ones I've had at home, and their Vermicelli bowls are also super tasty. I'm especially fond of the egg rolls that go into the Vermicelli bowls, which are really different from the ones I've had at home. I've also had some of their rice dishes which are excellent.One of my favorite things though on their menu is their Nataing, or ground pork(?) in coconut milk. It is really different and sooo yummy with the chips that they use which crackle when you put the Nataing over them.The service is always great, and Shai the owner is super-friendly and accommodating. I always go early on Wednesdays because it's a hole in the wall place and gets busy for Happy Hour Pho, but even without the Wednesday discount the food is always still well worth its price.",
                "reviewer_id": "HtgxhzJ_4FS-erE1yeFq3Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 8.410251531603067e-07,
                    "positive_probability": 0.9999991589748295
                },
                "stars": 4
            },
            {
                "review": "5 star for Chambana, maybe 4 star in general.You would be hard-pressed to find better banh mi in Chambana, though that wouldn't be the case up in Chicago.The pho is good, but a bit pricey for the portions.  I would recommend NOT getting the bubble tea, unless of course you're cool with powdery bubble tea rather than fresh.The reason this earns such a high rating from me is the banh mi sandwiches.  Relatively cheap and filling and delicious!  Not the absolute best, but still pretty damn good.",
                "reviewer_id": "hXU0LGNPUPluU3sQcb7B-Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9343602585958684,
                    "positive_probability": 0.06563974140412918
                },
                "stars": 5
            },
            {
                "review": "If you look at my other reviews I rarely give a restaurant less than 3 stars, but this one doesn't even deserve 1! I ordered chicken wings and a beef sandwich. The wings were rotten!!! Can you believe that?they smelled like garbage, we were completely disgusted by the smell!The beef sandwich was at least edible, but not that good either. My friend who ordered a pork sandwich couldn't finish his as well. I will NOT go back there!",
                "reviewer_id": "I3qt_NaZfu3j5RfCQTiq4Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.11207655466640924,
                    "positive_probability": 0.8879234453335888
                },
                "stars": 1
            },
            {
                "review": "Not the best Vietnamese food you'll ever had. It's definitely pretty good though for a decent price. I stick to the veg menu so I can't say much about the rest of the food. The sandwiches and noodles are good. Sometimes I can tell that they don't use the freshest ingredients though.",
                "reviewer_id": "iC_160H6_qYTe1z9Rs1igQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38025444235972683,
                    "positive_probability": 0.6197455576402692
                },
                "stars": 3
            },
            {
                "review": "This is a great spot for some delicious and affordable food. . I like the sandwiches and the pho. Also try the rice pudding!",
                "reviewer_id": "IIRBF6_xbWYPbP_mjGI8RA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05301449429673161,
                    "positive_probability": 0.9469855057032697
                },
                "stars": 4
            },
            {
                "review": "This is actually the second time I've been here.  It wasn't terrible, but it was rather underwhelming.  My girlfriend and I got banh mi sandwiches, since I had recently read about them online.  On mine, though, the BBQ pork wasn't very flavorful, and the bun was a bit stale.  This was on a $5 sandwich.  My girlfriend's was a bit better, because it had grease to soften the bun, but once again relatively underwhelming.  Also, I felt like we were a bit glossed over in favor of regulars.  A couple sat next to us, after we sat down, ordered after us, but received their food and drinks before us.  I'm a bit disappointed after seeing all the reviews and large crowd, but the people there were almost entirely aging hipsters, so I'm willing to accept that their judgment is a bit weak.It wasn't terrible, but I don't think I'll be going again.",
                "reviewer_id": "IJ3m1dLcXv_NjDlXQ5J8Iw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.19308918422141058,
                    "positive_probability": 0.8069108157785966
                },
                "stars": 2
            },
            {
                "review": "After reading so many rave reviews this place, I was a bit skeptical on my first visit a couple of weeks ago.  I was also slightly intimidated, as I'd never had Vietnamese-American food before -- a glaring omission in my culinary education -- but the concepts of meat and veggies on a baguette and noodle soup are so deeply ingrained into my consciousness that I was excited to try a different cultural twist on the familiar.  I was absolutely not disappointed; I tried the banh mi (#2) and my dining companion had pho, and we were both incredibly happy eaters.  The owner was personable and very excited about his food -- his passion for what he does is obvious both in conversation and simply in dining.  The only negative part of the meal was our server, a surly woman who toed the line of outright rudeness throughout our visit.  Nonetheless, I intend to go back tonight, and often in the future.  Crappy service doesn't even begin to phase me with food this good.",
                "reviewer_id": "IKO583kZ2e2Xz8RYbBB4Zg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001098018948085681,
                    "positive_probability": 0.9998901981052046
                },
                "stars": 5
            },
            {
                "review": "What a disappointment.  So many people recommended I go here for the pho but every time I've been there I've been reminded of how much of a disappointment it is.  The noodles are generic, the broth lacks flavor, the meats don't really add much to the pho.  The banh mi's are equally lackluster and flavorless and leave you craving more.",
                "reviewer_id": "iKt9RWLOS_PE4SKBRFkKww",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6927249008908681,
                    "positive_probability": 0.3072750991091345
                },
                "stars": 2
            },
            {
                "review": "Tried Pho for the first time here.  Excellent stuff.  It forced me to expand my taste palate a bit, as I don't usually have cinammon, star anise, etc., with beef, but it was very enjoyable.  Would love to have more jalepeno in the dish, but again, I think that's my palate trying to drag the flavor into something else.  Huge bowl of beef broth with meats and huge plate of mung bean sprouts, jalepenos, lime wedges, cilantro- excellent additions to the soup.  Of course I also grabbed my first Boba tea there, excellent.  The owner was super kind, had great suggestions, and is continually playing to hone his menu.  We'll have to go back to explore more yumminess.On The Wings:In talking to the owner, he ran down a good portion of his menu for us, and explained what he feels is good and others buy frequently.  In this discussion he mentioned the wings!  Guys- the reason it smells funny, as with all Vietnamese cuisine, is that fish-sauce is used instead of salt.  So... those chicken wings?  A special fish-sauce dressing!  If you weren't expecting the smell of fish, there's your issue right there.  That has got to be the issue with the other comments about the wings.We'll be back, and thanks to all the Yelper's comments on this place!  Excellent owner, clean, and enjoyable food!",
                "reviewer_id": "iLM27ACTnZt2x0RIibQtpQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.024382842307302043,
                    "positive_probability": 0.9756171576927164
                },
                "stars": 4
            },
            {
                "review": "It pains me to say it, but there's a reason I don't go here anymore.  Went there for the first time in months recently and was seriously disappointed.  My husband's fried fish banh mi had one seriously tiny piece of fish on it, and my nem nuong banh mi was similarly lacking in meat.  Their banh mi have never been especially generous in the meat department, but this time it was pretty sad.  It was mostly made of pickled veggies.  In comparison, Black Dog's sandwiches are about $8 ($3 more than most of the banh mi) and they're huge and come with a side.  I'd rather pay a bit more and get a better sandwich.Two stars because the banh mi my sister got (creamy pork) was better and the service is always good.",
                "reviewer_id": "iN34tIuP_IYqQWIaPhddmw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9645092428243198,
                    "positive_probability": 0.03549075717568454
                },
                "stars": 2
            },
            {
                "review": "Judging by how packed the place was on Wed, word is getting out!A solid four stars after trying the 5 buck pho special on Wed nights.  Trying to be a more adventure-some eater, I chose the pho with all the meats, including tendon and tripe.Everything was wonderful.  Pho is served with tons of mix-ins to flavor it just to your taste.  Mung sprouts, jalapeno, cilantro, Thai basil, fish sauce, schriraca, soy sauce, hot cock (the super hot chili garlic sauce with rooster on bottle, geesh ya perv!) etc.I actually really enjoyed everything but the tendon.  Even though it melted in mouth like butter, just couldn't get over eating TENDON.  Tripe (stomach) was super chewy in a reminiscent of calamari way.Two other housemates with quite diverse taste were extremely pleased with their soups.  Others have said in reviews here that they were not full, perhaps portions have increased since then.Our bowls were huge, all 3 of us could only eat about half before full on stuffed.  Very worthwhile way to spend five bucks on dinner.We had fried spring rolls as an app, and all thought they were awesome.  Comes with cilantro, cuke, and lettuce to wrap with the fried roll and dip into yummy sweet n' sour type sauce.Looking at the place, you wouldn't probably want to bring a group of more than 6.  The tiny dining room is set up for 2-4 at a table.",
                "reviewer_id": "iWcr-TRqIuIXqMpd_MrdrQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00022178502611759185,
                    "positive_probability": 0.9997782149739005
                },
                "stars": 4
            },
            {
                "review": "Pretty good little joint. It's definitely a change from the majority of other restaurants in the C-U area.As for the food, the banh mi is good. Fresh vegetables, tasty ingredients, a little small, but that's to be expected. The vermicelli is good too. Decent portions, delectable stuff!It seems like the rice dishes can be underwhelming (friends orders). Stick to your pho, banh mi, vermicelli.",
                "reviewer_id": "J3MDQ_iHks7rqJdY7_MTKw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.010656165570262962,
                    "positive_probability": 0.9893438344297386
                },
                "stars": 4
            },
            {
                "review": "The food here was sooooooo good! This was my first time having Vietnamese food in Illinois after having been spoiled with good Vietnamese food in California. I thought it wouldn't even compare but I was not disappointed at all! I ordered the fried spring roll appetizer, which was amazing! That was my favorite part of my meal. Then, I ordered the beef vermicelli bowl, which was also amazing! Lastly, I ordered the fried banana desert. That was very delicious! I am definitely going back here to get my Vietnamese food fix!",
                "reviewer_id": "jPrsHiYucnzlcqm51I4G_w",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.22422806252553545,
                    "positive_probability": 0.7757719374744687
                },
                "stars": 4
            },
            {
                "review": "This place is great!  Small interior, but beautifully decorated.  Food is great too - Pho, Banh Mi, etc.The only thing i wouldn't recommend is their banh mi sandwich that's coconut milk and ground beef.  Something about the flavors didn't settle right, but other than that, The Phnom Penh Pho was fantastic and any of the banh mi sandwiches with radish, carrot and cilantro is a winner!",
                "reviewer_id": "JpVEI742APrTvGwoHln-iw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.15288182991402532,
                    "positive_probability": 0.8471181700859782
                },
                "stars": 4
            },
            {
                "review": "Mondays they have $5 vermicelli bowls IF you pay cash. I don't like places where you need to tip but they don't actually serve you. The guy who was working just brought us the food and that's it. I'd say take out if you can, it's cramped and air is blasting brr!Pho is aight, it used to be better a few years back but if you're not picky with pho then go for it. Bahn mi sandwiches are also just okay- I always get a tummy ache when I eat those, not sure why. I rec the deep fried spring rolls, those are my fave thing there (these also used to be better a few years back but still good!)",
                "reviewer_id": "JUwpNkoZhkOM2XUQfhfYtw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7639570438134795,
                    "positive_probability": 0.23604295618652682
                },
                "stars": 3
            },
            {
                "review": "Not sure what all the hype is here, I've been a couple times, the sandwiches werent that special, they were quite small, and just seemed mediocre. Pho was mediocre too, solid place, but definitely been to better. If you do come here, I definitely would get the sandwiches",
                "reviewer_id": "k23Uo-4EVB4xFLqUNckNbw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5132690042483001,
                    "positive_probability": 0.48673099575170115
                },
                "stars": 3
            },
            {
                "review": "I visited Xinh Xinh when it first opened. I had been going crazy over the fact that there were no restaurants in the area that served good tasting, authentic Vietnamese food. Then I found Xinh Xinh Cafe.Their banh mi is still the best tasting I have had to date. Fresh ingredients, great flavor, what more can you ask for? They also have a great variety of specialty drinks that I really enjoyed, including the avocado shake. Definitely expand your horizons. So worth it!The pho is dece - nothing extraordinary. The serving sizes aren't too large, but it does the job when you're hungry and just feenin for some hot noodle soup to warm your bones.Owner is nice and personable. He loves to talk to his customers and get to know them.Love this place!",
                "reviewer_id": "KJZftTc-ct3fT4shisBb9Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.053351173224750165,
                    "positive_probability": 0.9466488267752441
                },
                "stars": 4
            },
            {
                "review": "Pho chay is great. So are vermicelli bowls. It's not just for vegetarians. The hours seem to be getting weird, but business says sharp. Good service. Good location.",
                "reviewer_id": "kp4bp3pA8YhXqdEirskvAQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5045621347744693,
                    "positive_probability": 0.49543786522553074
                },
                "stars": 4
            },
            {
                "review": "I like the pho and vermicelli here. I've had the pho with the thin steak. They give you a generous serving of this pho! Also, the vermicelli with the pork is delicious with a variety of veggies and the fish sauce to pour on top.Good service and a nice place to go for some comforting pho. Mmmm.",
                "reviewer_id": "kRqk2li5lEm8R2EcYDrXBQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.04614747560733967,
                    "positive_probability": 0.9538525243926591
                },
                "stars": 4
            },
            {
                "review": "Let me start off with the good. I thought the cleanliness and decor of the restaurant was good. The tables were not sticky, the chairs were clean, and the floors were clean. I didn't mind that it was a small restaurant. I'm used to that from dining in San Diego. Our server was very nice, patient with us, and made sure our water glasses were filled. Now for the bad part. I did not like the food. Three of us ordered the bun (bun nem noung, bun thit cha gio, bun cha gio) and our fourth ordered the banh mi dac biet. The meat in the bun was extremely dried out, hard, overcooked, and tasteless. I thought that nem noung was suppose to be meatballs on skewers that were grilled or patties that were grilled. Instead we were served chopped up pieces of dried out pork. The grilled chicken bun was the same way. The food portions were fine. I would've preferred much more lettuce, bean sprouts, and herbs. I also would've liked peanuts and fried shallots on top of the bun.  I also didn't like the the sauce that came with it. It was lacking in flavor. It was neither salty, sweet, nor spicy. The banh mi was average. The pickled daikon and carrots and the cha lua were the best things about it. The pate was horrible. The bread was not the typical banh mi baguette. I've never seen a banh mi baguette that had corn meal on the bottom of it, thus I assumed it was regular American-made bread. It was too dense and hard. The egg rolls in the bun tasted okay. Our food was presented nicely. But the food tasted only so-so to almost bad. I almost wished one of us had tried the pho just so I could get a better idea of the food.I understand my review is somewhat harsh. Two of us are from San Diego, one is from Dallas, and the fourth is my mom. We are used to good Vietnamese food. Xinh Xinh did not deliver.",
                "reviewer_id": "Kts8Wyn1wxSxviEPiXxO2Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9517308885561773,
                    "positive_probability": 0.048269111443825986
                },
                "stars": 2
            },
            {
                "review": "Although my Vietnamese friends told me that the food at X X is not real Vietnamese cuisine, the food there is not bad at for me. The service is friendly and quick. I usually order the #1 Pho which contains all kinds of meat or Vermicelli Bowl which is are dry noodles with grilled meat and vegetables. On Wednesdays, they have $5 plus tax special for all Pho. Great deal!",
                "reviewer_id": "L1uprehekETNswlqhL1B6Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4124955524158561,
                    "positive_probability": 0.5875044475841473
                },
                "stars": 4
            },
            {
                "review": "Found this place via Yelp on our way to Marion IL. Easy to find, about 1 mile off the highway. Place is packed with students from the school around. Great selections of your typical Vietnamese restaurant. Pho tastes great and I ordered the rice plate which is not bad. Price is a bit on the high side and service is pretty good. Very friendly. We will be back if passing through again.",
                "reviewer_id": "l_YY6O-BooHM8AJ5cYelxw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0013857135264594284,
                    "positive_probability": 0.9986142864735352
                },
                "stars": 5
            },
            {
                "review": "their pho is pretty yummy but not what I'm used to as real pho. maybe it's cuz i didnt order their typical number 1 combo :Panyway, their boba was yummmy!!! and that's all that really matters",
                "reviewer_id": "m8u49f6BQbnLBPujd6twaQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13637706759377693,
                    "positive_probability": 0.8636229324062217
                },
                "stars": 4
            },
            {
                "review": "I absolutely adore this place! You simply cannot beat $5 pho happy hour on Wednesdays. I go every week and I'm never disappointed. They have everything a solid pho joint needs - great chili sauces, fine grained pepper, lime wedges, jalapenos, sprouts, basil, etc;. Easily the best on campus. The staff is friendly, efficient, and attentive. Plus, they're signed up with Perk Pug so its easy to get deals if you're a frequent customer. Its clean, well-decorated, and rarely too crowded. I cannot recommend this place enough!",
                "reviewer_id": "MN3atBTBkBJOwPYSUh7OIA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.013521883943363809,
                    "positive_probability": 0.9864781160566342
                },
                "stars": 5
            },
            {
                "review": "I'm a vegetarian--let's just start there.  The only reason I ended up at Xinh Xinh was because I'd been told that it existed and because I work across the street.  I have enjoyed both the summer rolls and the spring rolls so far, and I must say they are delicious!  The summer rolls are particularly so; they have tofu and fresh veggies wrapped in rice paper.  The peanut sauce could be a bit less salty, but I can survive.  I've also had the fried spring rolls, but those weren't as good; they seemed not to have much in the way of veggies and the vegan sauce didn't have much flair.  They were deep fried a bit too much and I ended up with a stomachache.  The bubble tea is as good as any; plenty of bubbles but could be a bit stronger.  I had the papaya.All in all, certainly a place to try, but don't expect a full meal if you are a vegetarian!  Nowhere near as good as the Vietnamese food my friends have made me, but for Champaign-Urbana, it's probably among the best.Another note:  they aren't open very late, so keep this in mind!Update:  The tofu stir fry sandwich single handedly made me change this.  That, and the vegetarian pho that Shai has once a month!  Yummy!This has become one of my #1 places for food on-the-go.",
                "reviewer_id": "MNec5hNFpv3GwQNXnO6NSA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 1.5228935968348347e-05,
                    "positive_probability": 0.9999847710640315
                },
                "stars": 5
            },
            {
                "review": "I love this place. The food seems very authentic. I dont know for sure because I'm not vietnamese. I loved it. Very natural and flavorful. Can't wait to go again.",
                "reviewer_id": "Mwe28dBaUr_1dnPvs4pXug",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.3909674346133127,
                    "positive_probability": 0.6090325653866879
                },
                "stars": 4
            },
            {
                "review": "My boyfriend and I were looking forward to this restaurant since it received four out of five stars on yelp. We ordered vegetable egg rolls and two bowls of pho. 1) The vegetable egg rolls were overly oily and the owner gave us sweet and sour sauce instead of the usual fish sauce that we normally get at other Vietnamese restaurants. But that wasn't the real issue...the biggest issue came from...2) Pho: Out of all the authentic Vietnamese restaurants we have been to (several at Argyle in Chicago and other places outside of Chicago-NY, VA), this place was by far the worst. First, the soup was too bland that we had to put in a lot of sriracha and hoison sauce -- normally, at other places we've been to, the soup would not need any seasoning because of the already flavorful beef broth (in other words, it was optional to put in the sauce but in this case, even with the additional sauce, the soup was still bad). Noodles were not fully cooked and after a few bites, we gave up. 3) Price: For some odd reason, they charge fairly high for their dishes. You can have far better tasting pho at other places in Chicago for much cheaper price!All in all, we were very disappointed. Ever since the viet place on Savoy closed, we have been wanting to try other Viet places in Champaign/Urbana. The positive reviews here may have been for other dishes but it is still hard for me to believe that this place received four stars out of five. Usually I can depend on Yelp reviews and they have been fairly consistent with my personal experiences but this definitely was an exception.",
                "reviewer_id": "MyOOnACDighT__BBQf_Eqg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.05719344208326794,
                    "positive_probability": 0.9428065579167211
                },
                "stars": 1
            },
            {
                "review": "Pho was average. Not that great.The broth lacked that warm richness found in most pho. I was in the mood for Pho and I was recommended by Yelp and Aardvark to try this  location. It was a little pricey for the quality and i expected more based on phenomenal reviews. I went with two other friends and one ordered the vegetarian Pho which was actually very good. I more than likely will not return to this restaurant but if I do I'll know to load up on the sriacaha and soy sauce.",
                "reviewer_id": "n4oNuUCMZll5PwcVN5lZpg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012887240936835808,
                    "positive_probability": 0.9871127590631654
                },
                "stars": 2
            },
            {
                "review": "I have mixed feelings about this place. Service is always quick and kind, and the food is reasonable. However, the pho hasn't impressed me yet, and some of the dishes just weren't that tasty.. It's also somewhat expensive for lunch, which is always important for us graduate students.. Unless they wow me in the future, it's no more than 3 stars for me.",
                "reviewer_id": "N7cIbEOvl55MQ9Syz6QQvw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.08931082474717278,
                    "positive_probability": 0.9106891752528321
                },
                "stars": 3
            },
            {
                "review": "Food is good:) The cook knows what he's doing in that blue apron!!!! =D",
                "reviewer_id": "n8rot-7eV59wxH4zXaBJqg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.45250140275448925,
                    "positive_probability": 0.5474985972455101
                },
                "stars": 5
            },
            {
                "review": "So happy to find a pho place in CU!  Ordered some boba tea straight off, way better than what I've tried on green st so far.  Then ordered the ribeye pho.  Could not figure out what one of the herbs that we got on the 'toss this stuff in your pho' plate was, turns out they special order 'culantro', which is a more vietnamese type of cilantro... pretty cool.  Really nice staff/owner, I'll be dropping by again next time I need a big bowl of hot soup.",
                "reviewer_id": "nmh7Z99urzgy2xmh9v_pYA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004376400020217314,
                    "positive_probability": 0.9956235999797851
                },
                "stars": 4
            },
            {
                "review": "Excellent customer service, the food comes out quick, the prices are pretty fair, and the food is good. The banh-mi are ok, but I think they would be a lot better if they used better bread. I have yet to try the pho, but I will update the review once I do.",
                "reviewer_id": "NVUrOtbBK7HEvPpHsXmN8Q",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.6676047082547815,
                    "positive_probability": 0.33239529174521704
                },
                "stars": 3
            },
            {
                "review": "Great Pho and spring roles. Their pricing is great and if you go between 5-6 PM and pay cash you get a 50% discount on many items. The service is very friendly and efficient. I have been to Urbana on three occasions and have eaten here 4 times. Just love it.",
                "reviewer_id": "NWqM3BrTMZLXrZ_fj0nN9g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.1957848854266044,
                    "positive_probability": 0.8042151145733917
                },
                "stars": 4
            },
            {
                "review": "So it was my first time to Champaign and obviously my first time to Xinh Xinh Cafe, I must say it was impressive. I had the garlic beef banh mi sandwich and it was love at first bite. It was full of flavor and very filling. I ended up coming in the next day for the pho and again was impressed with the dish. The owner, Shai, remembered me from the previous day too. That is points in my book. Overall, I would definitely recommend this place.",
                "reviewer_id": "OfNvZXzz3M8HfUOneSTvPg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7078939423246164,
                    "positive_probability": 0.29210605767538617
                },
                "stars": 5
            },
            {
                "review": "My wife and I were among the first guests at this amazing store-front restaurant. If I recall correctly, we were there on the first night they were open. Since, we've been back a few times, always loving it. Unfortunately, most (all?) of our favorites depend in great measure on carbs, and my wife prefers to avoid the temptation. (When she reads this, I will be in such trouble!)Tonight, being the last night before my wife comes back from visiting family, etc., I went over and had a few of *my* favorites, kinda pigging out a bit.I had the Fried Spring Rolls appetizer, some of the best Vietnamese fried spring rolls I've ever had. They are served with lettuce leaves, cucumber strips, and cilantro sprigs. The intention is that you wrap a Spring Roll, some cilantro, and a cucumber strip in a leaf of lettuce, then dip that package into the lime fish sauce and enjoy. You get a lovely combination of fried, crispy, oily, hot, cool, and fresh.I also had the Nataing appetizer. This is a small bowl (I want a big bowl!) of meaty, spicy, oily, sweet yumminess, served with prawn chips for dipping, and a few pieces of good French bread. (When they first opened, they used a different prawn chip. I enjoyed them because they were different than I'd had anywhere else. The current chips probably are a bit better, though.) The French bread works really well for soaking up the sauce and becoming bites of pleasure.I finished with a Charbroiled Beef Skewer sandwich. Very flavorful beef with a spicy papaya and carrot salad and cilantro sprigs. I wound up removing the top of the (good French bread) loaf (which I took home to have for breakfast tomorrow) because I was running low on capacity. I had a couple cilantro sprigs left from the Spring rolls, which I added to the sandwich. This made a great sandwich. I think with the top bread in place, the bread to filling ratio is higher than I prefer (partly because the meat is so very good).As I was paying, I noticed a white board with a variety of vermicelli noodle bowl dishes. At other Vietnamese restaurants, these are among my favorites, and I will have to come back here soon to try their version.Almost forgot to talk about service. Very friendly and attentive, but between the kitchen and servers, they do not understand the concept of pacing. I got both appetizers and sandwich quickly, but within a span of about 3 minutes. I suggest that if you care about such things, you order the appetizer(s). Then, when you are nearly finished with them, order the main course(s).",
                "reviewer_id": "oH_EeAPfH3QJzR9xNWmuvg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00040295393040856156,
                    "positive_probability": 0.9995970460696175
                },
                "stars": 4
            },
            {
                "review": "Finally made it in here and really enjoyed it! It's a nice, clean place with huge portions. Ordered the Vegan pho, veg egg rolls, and the son-in-law eggs, all of which came out quickly thanks to the quick service.I did feel a bit rushed to eat, as it was about 830 when our food arrived and they were clearly cleaning up for the night.Oh, and you go up to the front to pay, they have your tab up there!",
                "reviewer_id": "OJSxeaDpGv74qOkK9HQCfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.005162884297882508,
                    "positive_probability": 0.9948371157021201
                },
                "stars": 4
            },
            {
                "review": "The pho is subpar, no true Vietnamese egg rolls and the vermicelli noodles were over cooked.",
                "reviewer_id": "oKiLhmrgltaBMvJusZ7ScQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.37216556750056895,
                    "positive_probability": 0.6278344324994309
                },
                "stars": 2
            },
            {
                "review": "I always go to Xinh Xinh thinking that I will order the pho but end up ordering their sandwiches or trying something from their \"specials\" board instead.  Their pho is good, though.  I think I order the sandwiches because they are different for an Asian restaurant in the area - something you can only get at Xinh Xinh.    Their sandwiches are simple and delicious and priced reasonably.  The last time I was there, I ordered their roast pork and rice noodles dish with sweet fish sauce.  It was a good portion with fresh vegetables - carrots, cucumbers, cilantro, bean sprouts - and crushed peanuts.  It was refreshing.  Also, if you're not too full, you should definitely get the avocado shake.      They are addictive! What I like most about Xinh Xinh is its ambiance.  Its' clean, simple and modern deco complements the clean, simple, refreshing food.  I also love how all the sauces, utensils, napkins, etc., are on the table in nice silver containers.  The colors of the interior are great - black, creams, whites.  Shai is very friendly.  The service is prompt and great!  If you want good vietnamese food at a reasonable price, this is a great place to go.",
                "reviewer_id": "OkQ_oJM3nUfvPW5bEbCBLg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 2.8527585750069294e-06,
                    "positive_probability": 0.9999971472414293
                },
                "stars": 4
            },
            {
                "review": "I was a bit disappointed after being a first timer here the other night. My roommate and I work at a Vietnamese eatery back in the city which made us grow a love for their food. Moving down here we were craving a Banh mi and a noodle salad. We were very excited to tryout this new place although we knew it wouldn't be the exact same we didn't expect this.We ordered a lemongrass chicken Noodle salad and it didn't even look like chicken! It had no type of lemongrass flavor in it as well and the noodles were too soggy. When I asked the server if she could please put all of the veggies on a side plate for me she insisted it was impossible and why would I want to do that. REALLY ? Knowing this is the only Vietnamese place around campus makes me upset about my visit here, sorry but won't be back.",
                "reviewer_id": "oOD5x4bMs8YARPM9GZz8uQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.642603865754273,
                    "positive_probability": 0.35739613424573125
                },
                "stars": 1
            },
            {
                "review": "Don't really know much about Vietnamese food, but vegetarian Pho was delicious, with tofu,mushrooms, bamboo shoots, etc. So were summer rolls, which were tangier than I've had before, perhaps due to slightly pickled carrots inside. Service at 6 on a Friday evening was prompt and courteous, and everything, from table to floor to restrooms was clan and in good condition.",
                "reviewer_id": "OVVh6X1ZbeUwWfvmXRBHzg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0013289725589127916,
                    "positive_probability": 0.9986710274410895
                },
                "stars": 4
            },
            {
                "review": "So I took the family last night and branched out from my beloved Banh Mi.  We had pho, a vermicelli bowl (chicken), and the beef spare rib rice platter.  Pho was amazing, and the noodle bowl looked beautiful, though I didn't get to try it.  The toddler launched handfuls of the beef spare rib and accompanying veggie egg roll into her mouth fistfuls at a time.  Preschooler seemed especially fond of the pickled veggies that came with the rice platter.Since this was also my first time dining in, I can confirm that Shai is as great as he seems in the other reviews.  The place was really busy, but he happily took the time to explain what the specials were, and gave instructions about how to prepare the pho with the herbs, veggies, and sauces.So now I am going to have a true dilemma each and every time I go to Xinh Xinh.  If everything is great, which one will I choose?",
                "reviewer_id": "P9IzWYGOoVPaAxLo4MswMw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.015070468211835494,
                    "positive_probability": 0.9849295317881679
                },
                "stars": 5
            },
            {
                "review": "Kind of pricey for lunch, but I hear they have great diner deals. I'm not a big fan of the pho price, but the flavor is pretty spot on. I do wish they would put more meat into their stock given the big price and the big noodle bowl, but I'd take the authentic flavor over quantity. Toppings are usually lacking as well. They give one lime wedge, a few sprigs of basil and a good tablespoon full of bean sprouts. That's it.Outside of quantity, the flavor is decent and worth going out to eat for.",
                "reviewer_id": "pD0ntLKZOopi2KmaVxSw_A",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7651543107530417,
                    "positive_probability": 0.2348456892469631
                },
                "stars": 4
            },
            {
                "review": "This place is one of the best in the Urbana-Champaign area. I go there frequently because it is consistently good and satisfies me every time--which is sorta rare in these parts. Shai is super friendly and the staff provides great customer service. Totally recommend!",
                "reviewer_id": "pJV6MeQbcrwUvwTZNDpHDA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006162406336968235,
                    "positive_probability": 0.9938375936630325
                },
                "stars": 4
            },
            {
                "review": "Good stuff. We went around 7pm Friday night; a 3-5 minute wait for a table. We ordered pho, a banh mi with pork roll and pate, spring rolls, a lime soda, and a vanilla boba tea.The pho was the lighter style; less salty, but also less rich. (I compare it to the Southern style you find in San Francisco.) The tripe was fresh and bouncy, the tendon a little soft, and the beef a little less flavorful than I like, but the noodles were excellent. The broth could be due to the fact we went late. (If they run out of broth during the day, they have to make more, and it can be a little thin.)The banh mi was great - the baguette was very fresh and light. Excellent balance of meat and carrot. The Mrs. thought the meat was too meaty, but this often happens - I tend to prefer my meat a little... gamier. I'm not the biggest fan of daikon, but this worked out. I would ask to hold the cilantro next time, but that's me, not them.The spring rolls - excellent. They include a small strip of what seems like either deep fried tofu skin or rice paper, and a strip of some kind of pork (it reminded me of the kind of maling meat-food-product that you get in spam musubi, but fried). Truly excellent balance of flavors.On a sad note, we never got our drinks (and on top of that, when we went to pay, they explained were out of boba (!), but the service was otherwise full of smiles, polite, reasonably fast (although not fast enough for a working lunch), while leaving us in peace to eat.The owner was ringing us up immediately recognized that we didn't get our drinks and apologized, explaining that they're still working out the kinks. I have no problem with that. They seem understaffed; it's always difficult running a new restaurant and the little extra effort makes me forgive forgetting the drinks.Verdict: Would pay about 2x as much.",
                "reviewer_id": "PNDrT4WXP-CpiPI878m_ww",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.030287337180685867,
                    "positive_probability": 0.9697126628193303
                },
                "stars": 4
            },
            {
                "review": "Nice people, but when you leave you'll want to get a sandwich somewhere for some protein (or some root vegetables).  The Pho noodle soup is attractively presented, with a cup of rice noodles at the bottom of a 5 cup bowl of hot broth.  Then there are two wafer-thin slices of beef swimming in the hot broth, and a side plate of bean sprouts to add to the pho soup.  Not very fulfilling but it tastes authentic.",
                "reviewer_id": "pwyRJuJoodUS__gsQMGlMw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9647002693566935,
                    "positive_probability": 0.03529973064330904
                },
                "stars": 2
            },
            {
                "review": "this spot is pretty chill. i like the whole set up, its nice and cozy. GREAT specials when the owner is in a good mood =P  the beef dishes can never go wrong. but if u know me im very particular with PHO. i didnt try the pho here but it looked really good. the springs rolls I mean summer rolls, were quite tasty. I like this spot because it's pretty authentic with a little twist... Check it out next time you're in Chicago!",
                "reviewer_id": "r1aEnBrpLiNHQ6b8NPALuQ",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5906141318913887,
                    "positive_probability": 0.4093858681086087
                },
                "stars": 5
            },
            {
                "review": "The place is lovely with nice service. If you care about the sanitation, this place is better than mandarin wok or golden harbor for pho. I always ordered the dessert after each meal. Try the dessert, it only costs 1 dollar.",
                "reviewer_id": "r_qusk0u1v7kAOek0LK7xw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.13828191598463044,
                    "positive_probability": 0.8617180840153706
                },
                "stars": 4
            },
            {
                "review": "Nice atmosphere, but the food is just ok.  Not exactly authentic Vietnamese.  We tried the pho and Thai fish cake sandwich.  We also had beef skewers - a Cambodian dish.  We didn't like the beef skewers at all, the marinade had a sour note.  The pho was salty but not really aromatic.  My sandwich had good bread and meat, but the condiments weren't right, especially the pickled vegetables.  They were too sweet and not traditional.  They also topped it off with a sweet and sour sauce, which was a bit odd.  For dessert, we shared the fried bananas.  I believe they used unripened bananas, so they were firm but not sweet at all.",
                "reviewer_id": "rG3FeOMDk7MWkIfm-zr6sg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8671532949286773,
                    "positive_probability": 0.13284670507133062
                },
                "stars": 3
            },
            {
                "review": "Papaya salad is very tasty - nice lunch. VERY tiny restaurant, we got there during the lunch rush... took a while to get our food.  In the meantime some free-range children (you know the kind that are fed and clothed but not raised?) were raising hell at the next table while their oblivious mother enjoyed her soup.  My husband while paying our bill, innocently opened the front door and let the children escape.  They instantly when running down the sidewalk... the mother chased them down and brought them back into the restaurant.",
                "reviewer_id": "rqWYUwtpzE11kEiXqgmPOA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.14492905691996846,
                    "positive_probability": 0.8550709430800235
                },
                "stars": 4
            },
            {
                "review": "Okay, so the sad strip-mall location leaves much to be desired, but this is a great little place.There were seven of us, and the owner (well, I'm maybe 90% sure he was the owner) nicely rearranged things in his tiny restaurant to make room for us, then offered tons of recommendations when he realized we were from out of town.  My lemongrass chicken was good (though I've had better).  The pho was awesome, and the vegetarians in our group really liked the tofu rice platter and tofu sandwich.  There are a bunch of different condiments on the table for customizing your food, too.They were completely sweet and patient about doing seven separate checks and letting us wait around for our cab, taking up space in their restaurant for a very, very long time.",
                "reviewer_id": "rwe7Lxbp9jB_m8LGJw7P_Q",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004025057915232221,
                    "positive_probability": 0.9959749420847666
                },
                "stars": 4
            },
            {
                "review": "Pho tai and spring roll were pretty good:)",
                "reviewer_id": "S9YtUMPnOD_gX2CNYJVXkQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.09543300058091628,
                    "positive_probability": 0.9045669994190847
                },
                "stars": 4
            },
            {
                "review": "I love Xinh Xinh Cafe! The tofu banh mi is tasty with a bit of spice and the pho is great! Every weekend they have been serving vegetarian pho and let me tell you I like this even more than the beef pho! The owner is a great guy and a number of times he's come out to our table and asked us how the food was and talked to us. Definitely someone who wants his customers satisfied! Everyone I've taken to Xinh Xinh has really liked it! I recommend checking it out for sure!!!",
                "reviewer_id": "scZY3WOmttqkVN3Lkr9_fw",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.671722996974983,
                    "positive_probability": 0.3282770030250156
                },
                "stars": 5
            },
            {
                "review": "I woke up incredibly, incredibly sick yesterday, with a thudding headache, achy limbs, hacking cough, and sniffling nose.After dragging myself through a long day of class, I knew--KNEW--I needed a decent bowl of soup.  When I was living in San Diego, the best cure for my tiredness and illness was always a big bowl of pho.  And I'd just heard that Xinh Xinh Cafe had opened next to the Schnucks.  Thank God.The space is a bit small, and has a whole \"Chipotle-forced-industrial\" look to it, softened with Vietnamese hats and other cultural items.  I made a beeline for a nice big bowl of pho and was delighted by the flavorful bowl in front of me.  However, it could have used a little more beef.That said, I enjoyed myself very much, and the menu is extensive, and the staff is incredibly friendly.  They've only been open three weeks, so you should give them a shot, especially if you're sick and need a big steaming bowl of pho to feel better.Edit: Keep in mind, they don't take credit/debit cards yet.  So, just run into schnucks and use the ATM or get cash back.",
                "reviewer_id": "SpKVX3rt892E-BrL-yeqiw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.26799667620157847,
                    "positive_probability": 0.7320033237984176
                },
                "stars": 4
            },
            {
                "review": "Let me start out by saying, I started my Pho life at one of the best Pho restaurants in the nation, which makes me have really high standards. After moving to CU I need a pho fix and I thought Xinh xihn would do the trick but it left much to be desired. The Pho broth itself was weak and sweet. The condiments that are served with Pho (sawtooth herb, bean sprouts, lime, basil) were skimpy at best. The meat was tough and bland. The fish sauce they served was some of the worst fish sauce I've ever had and they had no clue what Chinese black vinegar was. The service was average as was the atmosphere. I will be looking else where for my pho fix.Didn't try the sandwiches, but not sure if I'm willing to go back and try them.",
                "reviewer_id": "T_NYHn96WQl5KAMjaBMXXg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9582202903060962,
                    "positive_probability": 0.041779709693899894
                },
                "stars": 2
            },
            {
                "review": "I was happy to find a place that made banh mi in this town.  I've tried about half of all the different types, and my favorite is still the black pepper chicken.  The vegetables are fresh and crisp, the jalapeno is spicy, and it is a really refreshing sandwich.  The pho is also good, the vermicelli is better (personal preference).  I'm excited about the 5 dollar vermicelli Monday lunch specials!",
                "reviewer_id": "tU4rXcgg8EORXPcw2fN7tA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.8945201438382568,
                    "positive_probability": 0.10547985616174031
                },
                "stars": 5
            },
            {
                "review": "Had some banh mi, and it was pretty yummy.  Not my concept of authentic, but quite good.",
                "reviewer_id": "tw3PFgey15p0ruFRVoFidw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.441141463747906,
                    "positive_probability": 0.5588585362520937
                },
                "stars": 3
            },
            {
                "review": "I'm so happy that Xinh Xinh finally opened! I've gone twice now and both times I loved everything I tried. The pho is the best in C-U in my opinion 'cuz it tastes the way authentic pho should. The broth is very flavorful and tastes like time and care was put into it's preparation. The veggies that come with the pho looked nice and fresh. The plum soda tastes just like it does back home...salty and sweet just the way I like it. It's definitely an acquired taste though. The almond boba I tried was also delish and refreshing. The rice paper wrapped spring rolls (the fried version) were very tasty and I loved being able to wrap them in the lettuce and mint leaves. The rolls looked skinny but they were actually quite filling...you get 4. I also tried the fresh spring rolls (not fried) and those were huge! The fried wontons inside were a delightful surprise and the whole thing tasted so good! The meat is definitely flavored well. You get 2 in an order but one was already filling for me. I would definitely still try to eat both by myself though! And the sandwiches...also the best in C-U (although I think Xinh Xinh is the only place that actually has banh mi sandwiches). There's a variety to choose from but I tried the grilled pork sandwich. The size was just right. It had plenty of the delicious traditional fillings like pickled radish and carrots, jalapenos, cilantro, etc. The pork was super tasty and there was plenty of it. The prices were reasonable for this area -- about $2 for the drinks, $4 for appetizers and sandwiches, and $7 for the pho (all prices approximate). I also just noticed that Xinh Xinh has weekly specials for things not on the menu, like rice dishes. I'll have to try that next time. There's actually a lot of other things I want to try. Service is still pretty fast even though I only saw one waiter. For takeout, I would call ahead. Overall, I love this place and I will definitely be coming back as much as I can as long as the quality of the food and friendliness of the staff never changes. [Ok, this review got pretty long...but this place is great. Go try it now!!]",
                "reviewer_id": "URY1LJnYztAQ8esqhoqz-g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0002714041812613017,
                    "positive_probability": 0.9997285958187501
                },
                "stars": 5
            },
            {
                "review": "I used to love the stir-fried tofu sandwich, but my recent trips have disappointed me as they've made it bland and taken away the lovely sweet heat that made me crave it in the first place.  The spring rolls are okay, but I've been disappointed by everything else I've tried there (pho, chicken, all other sandwiches including pork and beef).  For central Illinois, it's okay, but I'll just wait to head back towards Chicago for better Vietnamese food.  I want to like the place - the owner is sweet, the decoration is nice, but the food just leaves a lot to be desired.",
                "reviewer_id": "V9v_NNjvnN4ujttF44L3Vg",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.7229288016655163,
                    "positive_probability": 0.277071198334477
                },
                "stars": 2
            },
            {
                "review": "Lots of delicious choices. Pho is the obvious choice, but I actually like some of the bahn mi sandwiches better. Curry beef, pork and catfish are my favorite. love the pork spring rolls. Vermicelli bowls are good, as is the salt and pepper pork chop. Avocado shake is great, but it's got to be about 1000 calories. Can get crowded.",
                "reviewer_id": "VFO8RtZQOGOUpOxbVpMNRA",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.9345922266108009,
                    "positive_probability": 0.06540777338920184
                },
                "stars": 4
            },
            {
                "review": "I love Vietnamese food.  I could eat it all day every day for god knows how long.  When I moved to Champaign a couple of years ago, I was extremely disappointed that there were no good Vietnamese places in Champaign-Urbana.  There's Saigon down in Savoy, but if you take the bus or bike everywhere (like I do) it's a little too far away.Which brings us to Xinh Xinh.  The menu is small, composed primarily of appetizers, banh mi (vietnamese sandwiches), and pho (beef broth soup); however, here it's all about the quality, not the quantity.  I've been to plenty of restaurants with bloated menus that only have one or two things I want to try.  I think I've tried most of the menu at Xinh Xinh, and I've enjoyed all of it.Also, the owner is very interested in his customers' opinions and will probably come ask you how things are going at some point during your meal.  He's extremely accommodating to various diets (vegetarian, vegan, gluten-free), so if you have a specific need, just ask him, and he'll do his best to work it out for you.To break it down: the place has a nice, modern atmosphere; the owner is a great guy and comes out to get feedback from customers all the time; and the food is a delicious combination of traditional vietnamese flavors with some slight variations (i.e. the fried egg roll wrapper in the fresh spring rolls).  Just give it a try sometime, and I promise you'll want to go back for more.One quick note: Xinh Xinh is cash only, so save yourself some trouble and make sure you have cash on hand when you go.  Trust me - it seems like a very small inconvenience once you try the food.",
                "reviewer_id": "VhLSDRugSKC1qnovy9V96g (1)",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0010023431406974343,
                    "positive_probability": 0.9989976568593132
                }
            },
            {
                "review": "I love Vietnamese food.  I could eat it all day every day for god knows how long.  When I moved to Champaign a couple of years ago, I was extremely disappointed that there were no good Vietnamese places in Champaign-Urbana.  There's Saigon down in Savoy, but if you take the bus or bike everywhere (like I do) it's a little too far away.Which brings us to Xinh Xinh.  The menu is small, composed primarily of appetizers, banh mi (vietnamese sandwiches), and pho (beef broth soup); however, here it's all about the quality, not the quantity.  I've been to plenty of restaurants with bloated menus that only have one or two things I want to try.  I think I've tried most of the menu at Xinh Xinh, and I've enjoyed all of it.Also, the owner is very interested in his customers' opinions and will probably come ask you how things are going at some point during your meal.  He's extremely accommodating to various diets (vegetarian, vegan, gluten-free), so if you have a specific need, just ask him, and he'll do his best to work it out for you.To break it down: the place has a nice, modern atmosphere; the owner is a great guy and comes out to get feedback from customers all the time; and the food is a delicious combination of traditional vietnamese flavors with some slight variations (i.e. the fried egg roll wrapper in the fresh spring rolls).  Just give it a try sometime, and I promise you'll want to go back for more.One quick note: Xinh Xinh is cash only, so save yourself some trouble and make sure you have cash on hand when you go.  Trust me - it seems like a very small inconvenience once you try the food.",
                "reviewer_id": "VhLSDRugSKC1qnovy9V96g",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0010023431406974343,
                    "positive_probability": 0.9989976568593132
                },
                "stars": 5
            },
            {
                "review": "Absolutely tasty!  TONS of vegetarian options, including specials, the bahn mi is SO tasty, but so is the stir fry and the pho!  The vegan fish sauce it awesome, I always ask for a little cup to dip my sandwich in.  The puddings (only $1) are a tasty little treat to end the meal.  All around great place to get a bite!",
                "reviewer_id": "wZ2B3_9CiWUQCd6hS156Tw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.38194559813128426,
                    "positive_probability": 0.6180544018687139
                },
                "stars": 5
            },
            {
                "review": "I highly recommend checking this place out. The food is generally tasty and the staff friendly and attentive. Get a sandwich and a thai iced tea or an avocado milkshake. The pho, on the other hand, doesn't really compare to what I've enjoyed in restaurants on the west and east coasts. I personally think the pho broth here is a bit too sweet, but I know others who enjoy it a lot, so it's a matter of personal taste. If you want to try it, do so during their $5 pho happy hour on Wednesdays from 5pm until closing. Any pho on the menu is $5, which is an awesome bargain!",
                "reviewer_id": "x8zEbTbVFv9Ju1U_Y3xrIw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.012739182495109545,
                    "positive_probability": 0.9872608175049
                },
                "stars": 4
            },
            {
                "review": "They have pretty good sandwiches. I heard the noodles are okay. My favorite sandwiches are: Nataing, Ground Beef Curry,  and Grilled Chicken sandwich.",
                "reviewer_id": "Xc1dIj1B5KEMGI0kpK1j6w",
                "sentiment": {
                    "label": "neg",
                    "negative_probability": 0.5651196193595419,
                    "positive_probability": 0.43488038064045853
                },
                "stars": 4
            },
            {
                "review": "After 7 years in Champaign, I finally tried this place out, and I wish I had tried it out sooner.  Overall, the food really hit the spot.  Every time I ate there, I would have a craving to go back the next day.  I always get the pan-fried garlic beef banh mi sandwich.  Everything about it is great.  The vegetables are fresh, the beef is surprisingly tender and non-gristly, and there is a TON of cilantro on top.  The bread is light and airy but has a slight crispy crunch. The avocado shake is also very flavorful and refreshing.  Who knew avocado in shake form could be so tasty?  Service was prompt...then again, I ate there during the summer months, so I can't vouch for the service during the school year when more students are around. Try this place out...you won't be sorry!",
                "reviewer_id": "XdlBjKW-leAJ_Ui31sFVHA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.004005582635441518,
                    "positive_probability": 0.9959944173645574
                },
                "stars": 5
            },
            {
                "review": "Very, very good food for extremely low prices. The sticky rice pudding is exceptionally good for $1. I like the sandwiches a lot.",
                "reviewer_id": "XL7xNs2CpJ8TrTx-Dot4jg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.25892607505172366,
                    "positive_probability": 0.7410739249482784
                },
                "stars": 4
            },
            {
                "review": "I lived in NorthCal before and I know exactly what good pho tastes like. Xinh xinh caf has probably the best tasting pho in Champaign. It's not the best pho ever, but still the best in town. I've always gone for the $6 pho on Wednesday dinner. It's worth the money!!",
                "reviewer_id": "xUu9gORsM_AEWJjiEN4fHg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2108851465286373,
                    "positive_probability": 0.7891148534713645
                },
                "stars": 5
            },
            {
                "review": "The service here is extremely slow and there is a really off flavor.",
                "reviewer_id": "YoPW8tMhI5qFogajExJZXw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.4172935898403094,
                    "positive_probability": 0.5827064101596902
                },
                "stars": 1
            },
            {
                "review": "Banh mi sandwiches and vermicelli bowls are GREAT. Specifically, the ground beef curry and charbroiled beef skewer sandwiches are excellent. Grilled pork is always a safe choice for banh mi and vermicelli bowls. 4 stars because their pho (the quintessential Vietnamese dish!) is only so-so.",
                "reviewer_id": "YoS_VTXsYXicWFW_kPDUtQ",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2050706941558719,
                    "positive_probability": 0.7949293058441257
                },
                "stars": 4
            },
            {
                "review": "I love this place. I can't tell you how much. The place is a bit small so if you have alot of people get take out. The food is amazing. I could honestly go on and on for hours. If you have never tried Pho get it you will be missing out if you do not. But they have lots of other good things here. I am a fan of the creamy pork vermicelli bowls can't get enough of it.",
                "reviewer_id": "Z5SBgJ9QHAwPH1XCJUUfZg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2350001024975978,
                    "positive_probability": 0.7649998975024069
                },
                "stars": 5
            },
            {
                "review": "reading some of the reviews I am not sure what people are looking for.  I had appetizer number two and a bowl of pho.  the appetizer was spectacular and the pho was delicious.  served very quickly and the service was solid.  just really good.  The spicy condiment in the little jar on the table was outstanding if you like heat and was much fresher than most of the pho joints I go to.",
                "reviewer_id": "Z6QA0t4ZzWhOuaKYwITcfA",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.00011138391973078925,
                    "positive_probability": 0.9998886160802719
                },
                "stars": 5
            },
            {
                "review": "First visit to Xinh Xinh today for lunch.  I ordered the rice vermicelli with chicken and peanut and a spring roll. Food was delicious but the service left something to be desired.  We had to wait quite awhile for someone to take our order, and no one ever came to ask how everything was or to refill our drinks.  I wish I had ordered an appetizer or side dish because, while what I had was delicious, it was not quite filling.  I will be back again when I am in the mood for good Vietnamese food.",
                "reviewer_id": "zaAnvzBTJh6mMrEJXUD4ig",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.0001787680343264055,
                    "positive_probability": 0.9998212319656659
                },
                "stars": 3
            },
            {
                "review": "1- love their boba. we've tried the milk tea and the green tea... pretty amazing.2- love their banh mi! anyone who caters to the vegetarians (tofu! fake meat! YUM!) gets an A+. 3- the owner (and his mom) are the sweetest. overall, professional, courteous, and incredibly tasty food.",
                "reviewer_id": "zAOHb4mnbrQ5D4Je3Tdhhg",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.33978739306711053,
                    "positive_probability": 0.6602126069328907
                },
                "stars": 5
            },
            {
                "review": "excellent pho and dumplings-we come at least 1-2 times a week for the pho. the bubble tea was fine but you have to tell them that you want milk in it or that you want it blended with ice. other than that its a cute place with super quick service and very friendly people.",
                "reviewer_id": "Zh9V5HoJNogRE38v093pcw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.006283927341653295,
                    "positive_probability": 0.9937160726583476
                },
                "stars": 4
            },
            {
                "review": "Stir fry tofu platter was amazing and filling. I highly recommend it.  Egg rolls ok. Check it out",
                "reviewer_id": "Zp3ojmTFU8er6NISMh5Oqw",
                "sentiment": {
                    "label": "pos",
                    "negative_probability": 0.2295136433049232,
                    "positive_probability": 0.770486356695075
                },
                "stars": 5
            }
        ],
        "similar_restaurants": [
            "KQXusKEWX5iTdzSJStW8Dg",
            "D7ENnY6AzeFxlhNfnVH54w",
            "oIU_awAiDThL0Xz0iGD5TA",
            "8LCPOZXh_yvigEOWg0ZR2g",
            "a4JU2JqAbT0p8_A8s_v8Kw",
            "UBriZt4m5BzkvNqnCeuGmw",
            "2SycDjGWWpFs1ODL-YBoHA",
            "zLkok9inSL4lzVoSzfpxAA",
            "M5E7DW8rqI4v37HhD2pzGQ",
            "_rrWTz0W1K_eWafh-8r3fA"
        ]
    }
}